[
{"title": "සුකුමාල කුමරියේ", "artist": "චන්දන ලියනආරච්චි", "author": "Unknown", "lyrics": "සුකුමාල කුමරියේ මනමාලකම් නොවේ හැමදාමත් පුරුදු සෙනෙහසින් මදහාසයෙන් බලා සිත ආලකම් කලා සඳ පෑයු ලෙසින් අම්බරේ රෑ සීතලේ පිණි හා මිඳුම් වළා ගෙනෙනා සිහිලැල් සුළං පාවි පාවී මල් මල් සිතුම් පැතුම් එක එක කඩා හැලේ තනිවේ මා යළි තනිවේ මා යළි සුකුමාල කුමරියේ රෑනක් ලෙසින් තරු වැල් දෑසින් ගලයි කැළුමන් ඈතට නොයා මාගේ ඇසුරේ මොහොටක් රැදෙන්න දැන් හදවතට ඉඩ අරන් සිතන්න දැන් යළි සිතන්න දැන් යළි සුකුමාල කුමරියේ"},
{"title": "සඳ යාත්‍රා කළා", "artist": "චන්දන ලියනආරච්චි", "author": "Unknown", "lyrics": "සඳ යාත්‍රා කළා වගෙ මතකයි ඔබ නේත්‍රා වලින් මට පවසයි හැම මාත්‍රාවටම සිත සැනසෙයි අපෙ ආශ්‍රයේ සත්වෙනි දවසයි දස දහස් වරක් ඔබට සිත බැඳි සපුරන්නට ඇති පැතුම් මල් මිටි භවයෙන් භවයට ආ මඟ සඳ වී ඔබ ඉන්නැති මගෙ ලොවට එළිය දී සඳ යාත්‍රා කළා තව සහස් කලක් මේ දුර යන්න සිත් අහස් ගැබේ තරුවක් වෙන්න ඔබ මා ළද පින් ඇතිය හිතන්න අපෙ සෙනෙහස පර මලක් නොවන්න සඳ යාත්‍රා කළා"},
{"title": "සිතින් අදිනවා", "artist": "චන්දන ලියනආරච්චි", "author": "Unknown", "lyrics": "සිතින් අදිනවා ආපසු යන්න නොදී ඇස් දෙකෙන් අදිනවා වාගේ අහිංසකී යන්නම ඕනෑ වී නම් මගෙන් මිදී කෙටි පණිවිඩ ඇයි එව්වේ අළුත් වෙවී දුරක් දුකක් අමුනාගෙන එක නූලේ ගෙනා දුරක් ඇති ඒකයි දුක් වෙන්නේ පෙමින් තෙත්ව හිත මොකටද අවුලන්නේ හිතක් මවත් මට නුඹ විතරයි වාගේ සිතින් අදිනවා හදාගන්න හිත කිරිල්ලියක් අළුතින් හොයාගන්න තුරු ඉන්නව අද රහසින් තරු සිදුනත් නැහැ අහසට සද ඇවිදින් මගෙ හිත ආයේ කොතැනද අළුත් ඉඩක් සිතින් අදිනවා"},
{"title": "සිත පරව ගියා", "artist": "චන්දන ලියනආරච්චි", "author": "Unknown", "lyrics": "සිත පරව ගියා වත මිලින උනා කදුලින් දෑස තෙමා ඔබ හදුනා ගනු කෙලෙසින් මොහොතක මා සිත පිනවයි යලි මා එලෙසින් රිදවයි මුසා බසින් මා රැවටී යාදෝ සිතුදේ නොමවේ… පැතු මැවේ වසන්තයක් යලි ඒදෝ කතරක මා තනි වේදෝ මසිත සොරාගන වෙන්වී නොයන්න දුකෙහී සැපැහී… මා ඉන්නම්"},
{"title": "සිතුවිලි සිරවී", "artist": "බණ්ඩාර අතාවුද", "author": "Unknown", "lyrics": "සිතුවිලි සිරවී හදවත පතුලේ ඉකිබිද වැල‍පෙනවා රුව සැංගී මගෙ මතකය අතරේ නෙත් අසරණ වෙනවා ඔබෙ සෙනෙහස දැක සැගවෙනු කෙලෙසද නෑ මට තවමත් වැටහෙන්නේ සුසුම් නිම්නයේ සමුගන්නට නම් මේ ලෙස ඇයි අප හමුවන්නේ සිතුවිලි සිරවී මිලාන වූ මල් ඉකිබිද වැලපේ විකසිත කුසුමන් හිනැහෙද්දී ලොව දහසක් නෙත් හිනැහෙන මොහොතේ ඔබේ මගේ ලොව කදුළු දකී සිතුවිලි සිරවී"},
{"title": "නන් සුරන්", "artist": "බණ්ඩාර අතාවුද", "author": "Unknown", "lyrics": "නන් සුරන් බැතියෙන් පිදු සරු පින් බිමක් විය මිහිතලේ රන් සඳක් විලසින් දිලේ එය මේ අපේ තුන් සිංහලේ දෙස් විදෙස් පතලාවූ කිත් යසසින් පසුබා සැදී මී මුතුන් සුවහස් ගණන් විය මව් බිමේ නාමෙන් බැඳී සීහළේ සුවදින් ලැබූ නව ජීවයෙන් පිබිදී නැගී උන් මලත් අපගේ විකුම් බිම සාදා නොනිදා හිඳී දැන් නැතත් ඒ ශ්‍රී විභූතිය ඒ ලෙසින් සදනා යුගේ උන් ගැයූ අභිමාන ගී ස්වරයෙන් සැලේ හදවත් අපේ මින් මතුත් මේ මව් කුසේ උණුසුම පැතු දරුවන් ලෙසේ පින් පුරව් සිහලුනි සදා ඉපදී මියෙන්නට සිංහලේ නන් සුරන්"},
{"title": "රුවන් තාරකා", "artist": "බණ්ඩාර අතාවුද", "author": "Unknown", "lyrics": "රුවන් තාරකා - නුවන් පායලා හිදින් හද‍වතේ රැදී - වේදනා නිවා නිසල රැයේ නැගෙන සදේ සිසිල වූ ඔබේ සෙවණ ඇගේ සුවය ගෙනේ නිබඳ මා වෙතේ නිබඳ මා වෙතේ රුවන් තාරකා තිසර විලේ පිපුනු මලේ රැඳුණු ආදරේ සුවඳ ගෙනේ සතර දෙසේ යොවුන් මාවතේ යොවුන් මාවතේ රුවන් තාරකා"},
{"title": "මහළුමඩමේ කාංසියට", "artist": "චාමර වීරසිංහ", "author": "Unknown", "lyrics": "මහළුමඩමේ කාංසියට මමත් උනා හුරු පපුව ඇවිලුනා තිස්‌සෙම පුතා ගැන සිතූ ටික දවසයි මමත් ඉන්නෙ හුස්‌මයන තුරූ ඇවිත් යන්න එන්නේ කවදාද මගෙ පුතු අම්මා නැති වුනත් නුඹට නෑ අදුවක්‌ කලේ පුංචි කාලෙ නුඹව හැදුවේ මහාමෙරක්‌ වගේ දිනෙන් දිනම ඉහල ගිහින් වැඩිවුනාම අගේ හිතුවේ මම දුනුව කියලා රත්තරන් පුතේ නුඹගේ මනාපයට විවාහයක්‌ සිදුවුනා එතැන් පටන් නුඹලාමට වෙනස්‌කම් කලා නුඹ හදන්න මා වින්දේ දුක්‌ කදුලු විනා දියණි කෙනෙක්‌ හිටියානම් සලකාවි එයා"},
{"title": "ලියන්නට පෙම් හසුනක්", "artist": "චාමර වීරසිංහ", "author": "Unknown", "lyrics": "ලියන්නට පෙම් හසුනක් ඔබේ සිත ගන්න උපන් සහසක් හැඟූමන් ලියා තැබුවා මං හිතේ පූදින පෙම් මල් ඔබට පුදදෙන්න වසන්තය යලි එනකල් බලන් හිටියා මං ආදරයේ සුන්දර තැන් සියුම් ලෙස විඳගන්න ඔබට බැරිනම් මෙතුවක් ආදරේ පිලිගන්න දැනෙන මේ පෙම් හැඟූමන් පවසාවි  විඳවනා තරම් ලියන්නට පෙම් හසුනක් ඔබේ සිත ගන්න… ජීවිතය ලැබු අභිමන් යලිත් බොඳ කරලන්න පරාජිත වූ ප්‍රේමෙන් බැහැ තවත් ඉවසන්න ගෙවන මේ දුක් කඳ නම් ඔබ තාම දන්නේ නැතිද ලියන්නට පෙම් හසුනක් ඔබේ සිත ගන්න…"},
{"title": "දුර අහසට මේ පොළොවෙ", "artist": "අරුණ  තමෙල්", "author": "Viraj Amarakoon", "lyrics": "දුර අහසට මේ පොළොවෙ ඉදන් ගව් ගණන් කීයද මා විසිකෙරුවේ ඒ තරම්ම දුරින් දුරටද ඔබ අත් හැරලා පෙම් කරාට මාව සඳහට මට හිදින්න බෑ ඒ මතකෙන් කොහොමත් එලෙස මහමෙර වගේ තවමත් මගේ හදවතේ නුඹ රිදවනවා පපුව මගේ ඇවිදින් විටින් විට වෙන්වීලා දුරක ගියත් මගෙන් සඳහට වෙන් වෙන් නෑ සත්තකින්ම හදවතින් නුඹ දුර අහසට මේ ප්‍රේමය විරහා ගිණි කන්දක මා සදා තනිකර දුරින් ඉන්නේ කොහොමද දැන් සතුටින් හදන් හිත වෙන්වීලා දුරක ගියත් මගෙන් සඳහට වෙන් වෙන් නෑ සත්තකින්ම හදවතින් නුඹ දුර අහසට මේ"},
{"title": "නිහඬ ගමනේ", "artist": "භාචි සුසාන් සමග ෂානිකා මදුමාලි", "author": "Sajith Chathuranga", "lyrics": "නිහඩ ගමනේ මේ තරම් දුර ඇවිද අපි එක වාගේ මිහිරි මතකේ සැරිසරා ඔබ නවාතැන් ගෙන දෑසේ බඹර නාදේ ඇසෙන මානේ රැදෙනු මාගේ සුවද වාගේ ප්‍රාර්ථනා තවරා ආදරේ ඉන්න ඉඩදෙන්න තුරුලේ හිනෙහෙනා කල්පනා ඔබ නිසයි ජිවිතේ ඇගිලිතුඩු තදකර මගේ නලලේ සිදුන සියුමැලි නුබේ දෙතොලත අතරේ ගැබුරු හද කැලබුව ඔය කදුලේ රහස නොහෑගේ මගේම ලදුනේ දෑත් විදා ලමැදේ ආදරේ එන්න විදගන්න රිසිසේ නිම නොවේ කිසිදිනේ පෙම් පැතුම් මා හදේ ලබන හැම ආත්මයම ඔබගේ ලගම ඉන්නයි මම නම් පැතුවේ පණට පණ දී ඉමු දිවි කතරේ නොයමි රහසේ රකිමි පණ සේ නිහඩ ගමනේ"},
{"title": "චන්න කින්නරාවී", "artist": "භාචි සුසාන්", "author": "Unknown", "lyrics": "ශ්වේත මීදුම් ඉරා - දෙනෙත් මඟ ඇහිරූ ජීවිතේ සීත සෘතුවේ - ගිරි දුර්ග අතරින් මා එක්ක එනවාදෝ චන්න කින්නරාවී මා එක්ක එනවාදෝ චන්න කින්නරාවී රළු පොලව මතින් බිදෙනා - විඩාබර දිගු ගමනේ මෘදු සිනිදු දෙපා රිදෙනා - වේදනා සුසුම් අතරේ ආදරේ ශේෂ වේවිදෝ - චන්න කින්නරාවී මා එක්ක එනවාදෝ - චන්න කින්නරාවී ශ්වේත මීදුම් ඉරා - දෙනෙත් මඟ ඇහිරූ ජීවිතේ සීත සෘතුවේ - ගිරි දුර්ග අතරින් මා එක්ක එනවාදෝ චන්න කින්නරාවී මා එක්ක එනවාදෝ චන්න කින්නරාවී සඳ නිවී ගිය රාත්‍රියේ - තාරකා ගොළුව ඝන අදුරේ ලය මතින් වැතිරී - සොදුරු හීනයට ඉඩදී හිනැහෙන්න පුළුවන්දෝ - චන්න කින්නරාවී හිනැහෙන්න පුළුවන්දෝ - චන්න කින්නරාවී හිනැහෙන්න පුළුවන්දෝ - චන්න කින්නරාවී හිනැහෙන්න පුළුවන්දෝ - චන්න කින්නරාවී"},
{"title": "සඳ හිරු තාරකා", "artist": "ආත්මා ලියනගේ", "author": "Unknown", "lyrics": "සසලව ඇත ඔබෙ සිත බියවී මගෙ සිත‍ වෙනතක දෝ සිතා සිතන්න සැක බිය හැරදා ලදේ සඳ හිරු තාරකා පායනා ලෙසින් සඳ හිරු තාරකා පායනා ලෙසින් ඔබේ හද තුල පායයි මගෙ ආදරේ එපා සිතන්න හිත රිදෙනා දේවල් ‍එපා පතන්න අප වෙන්වන පැතුමන් එපා කියන්න සිත රිදෙනා දේවල් එපා බලන්න දුක හිතෙනා බැල්මන් සඳ හිරු තාරකා සිතා සිතුවත් හිත රිදෙනා දේවල් පතා පැතුවත් අප වෙන්වන පැතුමන් ‍හඬා කීවත් සිත‍ රිදෙනා දේවල් එපා බලන්න දුක හිතෙනා බැල්මන් සඳ හිරු තාරකා"},
{"title": "පෙනෙන නොපෙනෙන", "artist": "ආත්මා ලියනගේ", "author": "Unknown", "lyrics": "පෙනෙන නොපෙනෙන දුරක ඉදන් නුඹ ඇවිත් හිත ලඟට හොරෙන් ආවාට නොකියාම ජීවිතෙන් නවතින්න හිතුවාද ආයෙමත් ආදරෙන් දකින හිමිවන හීනයේ - නුඹ කොතැන හිටියා මතක සැමරුම් අතරේ - ජීවිතය තිබුනා හඩන හිනැහෙන නෙත් නුඹේ - උරහිසේ තිබුනා ඇත්තමයි නුඹ අහසක් - වගේමයි හිතුනා නුහුරු නුපුරුදු හීන අරන් ලඟට ඇවිදින් තුරුළු වෙමින් ආවාට නොකියාම ජීවිතෙන් නවතින්න හිතුවාද ආයෙමත් ආදරෙන් මිරිඟුවක හිත තියලා - නුඹ දුරක ඇදුනා රංචු ගැහෙනා රෑනේ - තනිකමක් දැනුනා ඇසිල්ලක දුටු හීනෙන් - හිත හුඟක් රිදුනා අරුත නොදකින සෙනෙහේ - ඔය නමත් රැඳුනා පෙනෙන නොපෙනෙන"},
{"title": "රෑ අඳුරේ", "artist": "ආත්මා ලියනගේ", "author": "Unknown", "lyrics": "රෑ අඳුරේ සයුරේ පාවී ඈත යාවී ඈත යාවී ඔඔ ඕඔ ඕ ඕ දෑතේ සවී හබලේ රැඳී පාවෙන්නේ රෑ යාමයේ දෙවියනි ඔබේ සරණය ලැබී පිරවෙන්නේ මඩියයි අපේ රෑ අඳුරේ වෙරළේ පැලේ සොඳුරිය මගේ අයදින්නේ පිහිටයි ඔබේ දෙවියනි ඔබේ සරණය ලැබී රැකදෙන්නෙ ජීවේ අපේ රෑ අඳුරේ සුළගේ සෙනේ රුදුරුයි වගේ ඔරුවේ රුවල් බිඳ වැටේ දෙවියනි ඔබේ සරණය ලැබී ගෙනයන්න ගොඩබිම වෙතේ රෑ අඳුරේ සයුරේ ජලේ සැමදා මෙසේ දියවේදො අප ජීවිතේ දෙවියනි ඔබේ සරණය ලැබේ කිසිදාක සැකයක් නැතේ රෑ අඳුරේ"},
{"title": "මොරසූරණ වැසි", "artist": "ආත්මා ලියනගේ", "author": "Unknown", "lyrics": "මොරසූරණ වැසි ඇදගෙන හැළුනා මට මතකයි සමුගත් දිනයේ මා සිතුවේ නැ ලොව ‍හැර යන්නට අවිහිංසක නුඹ සිතයි කියා නිමල ආදරේ අවිහිංසක බව ලෝකය නැ දැනගෙන උන්නේ මාරුතයක් ඇවිදින් ඒ සුළඟේ ඔබ අරගෙන ඈතට යනවා මොරසූරණ වැසි තරු නෙතු සඟවා ඔබ සැතපෙනවා හැඬූ නමුදු ඉන් නොමැත පලේ වද මල සිඹලා මම සමුගන්නෙමි හෙට හමුවෙමු අපි අපේ ලොවේ මොරසූරණ වැසි"},
{"title": "මට ආසයි හිනැහෙන්න", "artist": "ඇන්ජලින් ගුණතිලක", "author": "Unknown", "lyrics": "මට ආසයි හිනැහෙන්න මුළු ජීවිතේ හිනැහෙන්න මා එක්ක මේ ජීවිතේ හැමදාම එකවාගෙ නැති ජීවිතේ මල් පාට මල් හීනයක් ජීවිතේ තව හිනැහෙන්නම් දැන් කවුද මට ආදරේ තව හිනැහෙන්නම් දැන් කවුද මට ආදරේ දියමන්තියක් සේම පාටින් දිලේ එය මිහිරි හැඟුමක් මවයි මා සිතේ තව හිනැහෙන්නම් දැන් කවුද මට ආදරේ තව හිනැහෙන්නම් දැන් කවුද මට ආදරේ මට ආසයි හිනැහෙන්න"},
{"title": "අපි කවුරුද", "artist": "වායෝ", "author": "Senaka Batagoda", "lyrics": "සී සී කඩ විසිරුනු සිතිවිලි, දිය බුබුලේ නලියන පෙනකැටි වාගේ නැතිවැ හුදකලාවෙ තනිවී සිටියාම, සිහින ආකරේක වැටුනා වගේ නිමක් නෑ මෙහොතින් මොහොතට ගෙවනා කාලය දැනෙනවා කාටත් එක විදිහට ගිනියම් ඉර, සඳ සිසිලස, අතරේ හොයනවා හොයනවා මේ, අපි කවුරුද ගීයකි ලොව, සිතුවම් කර, අතරේ අහනවා බලනවා මේ, අපි කවුරුද ඉර බැසයන ගොම්මන් යාමේ, තරු එක දෙක දිලිසෙන කළු ආකාසේ ගලා හැලෙන රිද්මේ නැහැවි, ඇදී යන්නෙ ඈතින් ඈතට පාවි සුලඟ සේ මොහොතින් මොහොතට ගිනියම් ඉර"},
{"title": "හද විමන් දොරින්", "artist": "ඇන්ජලින් ගුණතිලක සමග ජෝතිපාල H.R.", "author": "Karunarathna Abeysekara", "lyrics": "හද විමන් දොරින් එන පැතුම් පවන් විහිද යයි හමා පියඹනා කල්පනා රසේ දේයි අමා මල් උයන් තුලින් විල් ගඟුල් මැදින් සුගන්දය ගලා එකතු වී කිති කැවී රැඳී එක්වෙලා සාගරයේ සිසිල් රැල් නැගි නැගී බිඳේ ආදරයේ සුපෙම් කැන් දිලි දිලී සැලේ ආකාසේ සඳේ ලප නැත මැකී ගියේ ආදරයේ පුරාණේ හිත ඇදී ගියේ උදා වූ වසන්තේ සදාකල් රැඳේවා හද විමන් දොරින් මී වදයේ ගුම් නදින් මත් වෙලා ඉමී ගී තනුවේ වදන් වැල් ලෙස ඇදී එමී ලෝ තලයේ අලුත් පෙම් කතාවක් ලියා පා කරමූ සුනිල්වන් වලාවක් සොයා උදා වූ වසන්තේ සදාකල් රැඳේවා හද විමන් දොරින් මල් උයන් තුලින්"},
{"title": "දිනෙක ඔබ", "artist": "ඇන්ජලින් ගුණතිලක", "author": "Premakeerthi De Alwis", "lyrics": "දිනෙක ඔබ සඳ වාගේ හැඩයි නැවත ඔබ ඉර වාගේ සැඩයි මේ වෙනස්කම නැති උනත් නිම දි‍නෙන් දිනෙන් ආදරේ වඩයි හිනස්සන විට සිනාසෙමි අඬන්නට බෑ බලා ඉමි හිනස්සන විට සිනාසෙමි අඬන්නට බෑ බලා ඉමි ගඟක් වැනි ඔබ සමැත් පැවතුම් ඔබේ ළඟ ඉද පතා ඉමි දිනෙක ඔබ සඳ වාගේ හැඩයි උදේ මල් විල මනෝහරයි සැඳෑ කල එය විඩාබරයි උදේ මල් විල මනෝහරයි සැඳෑ කල එය විඩාබරයි ලොවෙහි දියදම වෙනස් වීමය ඔබත් එය පැහැදිලි කරයි දිනෙක ඔබ සඳ වාගේ හැඩයි විලේ දිය ගඟුලෙදී බොරයි ගඟේ දිය සයුරෙදී සැරයි විලේ දිය ගඟුලෙදී බොරයි ගඟේ දිය සයුරෙදී සැරයි ඔබේ සෙවණෙද මෙසේ ඉඳ හිට විවිධ හැඟුමන් උදාකරයි දිනෙක ඔබ සඳ වාගේ හැඩයි"},
{"title": "සල්ලි දීල ගවුම මැහුවෙ (මිනි ගවුම)", "artist": "ඇන්ටන් ජෝන්ස්", "author": "Unknown", "lyrics": "සල්ලි දීල ගවුම මැහුවෙ ඇඳගෙන යන්න අල්ලි දෙකක් වත් දුර බැහැ අඩිය තියන්න ඇඟට හිරට මහල කොටට ඇඳල බලන්න අඳින්න මිනි ගවුම අඳින්න අඳින්න මිනි ගවුම අඳින්න ලීලී මාගෙ නෝන එයා මෙහෙම කියන්නෙ දැන් රටේ තොටේ කවුරුත් මිනි ගවුම් අඳින්නෙ මම කොහොමද සාරි ඇඳන් මහ මග යන්නෙ මටත් ගවුමක් ඔනෙ ඔව් මිනි ගවුමක් ඕනෙ මිනි ගවුමක් මොටද දැන්ම ඔයා සොයන්නෙ ඇයිද ලිලී මගෙ පපුවට ගින්දර දෙන්නෙ මිනි ගවුම් අඳින්නේ මැරුණට පසුනෙ දෙවියනේ මෙහෙම කිවුව ගමන් නෝනා මගෙ ඇඟට ගොඩවුනේ සල්ලි දීල ගවුම මැහුවෙ ඇඳගෙන යන්න අපේ නෝනගෙ වැඩ පුදුමයි මට දැන් සිහිවෙනවා මැරුණෙ නැතුවම නෝන මිනි ගවුම් සොයනව බෑ කියන්නටත් ලෝබයි අඬ අඬ ඉල්ලනවා මිනි පෙට්ටි කඩෙන් මිනි ගවුමක් මෙ මං ඉල්ලුවා මිනි ගවුමක් සමග මිනි පෙට්ටියකුත් දුන්නා කාර් එකකුත් ලැබුණා ඒකෙම මමත් ගොඩ උනා ගේ ළඟටම එන්නා වට පිට සෙනග පිරෙන්නා එය දුටු මගෙ නෝනා මරහඬ දීගෙන පැන්නා සල්ලි දීල ගවුම මැහුවෙ ඇඳගෙන යන්න මොකද දෙවියනේ ඔයාට වෙලා තියෙන්නේ මිනි පෙට්ටි මොටද ඇයි අද අපෙ කවුරුද මැරුණෙ එය ඇසුණු මගේ ඇඟේ මාලු ග‍ඟේ නටන්නෙ අපේ නෝනට මම මේ විදියට උත්තර දුන්නෙ මිනිගවුමක් දෙන්නෙ මිනි පෙට්ටියක් ගත්තම ගත්ත නිසයි ලිලී මම ගෙනාව දෙකම මිනි ගවුම කිව්වෙ කොට්ට උරය වගෙ කොට ගවුම නෝන කිව්ව එහෙම මට තේරුණ කරපු ගොන්කම සල්ලි දීල ගවුම මැහුවෙ ඇඳගෙන යන්න අල්ලි දෙකක් වත් දුර බැහැ අඩිය තියන්න ඇඟට හිරට මහල කොටට ඇඳල බලන්න අඳින්න මිනි ගවුම අඳින්න අඳින්න මිනි ගවුම අඳින්න අඳින්න මිනි ගවුම අඳින්න"},
{"title": "සිහින පැතුම් විමනේ", "artist": "ඇනස්ලි  මාලේවන", "author": "Clarence Wijewardena", "lyrics": "සිහින පැතුම් විමනේ රස මිහිර ‍ගෙනා පුතුනේ නැලවී නැලවී හිනැහී හිනැහී නිදියන් පොඩි පුතුනේ දෑසයි කුඩා ඔබගේ ලපටි දෙතොල් පුතුනේ කාගෙයි කියා සිතුවේ මුහුණයි රුවයි ඔබගේ පැහැයයි හැඩයි පුතුනේ මාගෙන් නොවෑ ලැබුණේ සිහින පැතුම් විමනේ මා මෙන් ඔබත් පුතුනේ මිනිසෙක් වෙලා දෙරණේ රට දැය කෙරේ බැඳිලා මව්බිම ඔබෙයි සිතලා පණ මෙන් ඔබේ රැකලා දිරිගත යුතුයි පුතුනේ සිහින පැතුම් විමනේ"},
{"title": "ලියතඹරා", "artist": "ආත්මා ලියනගේ", "author": "Unknown", "lyrics": "ලියතඹරා මෘදු කුසුමකි ඈ තවුසන්ගේ දැහැනේ සම බිඳිනා නෑ ලෝකෙ ජීවේ ඇයයි මායාව මායාව ‍ලොව රවටනා සිහිනයකි සිහිනයකි අඳුරෙ පාවෙනා වීණාව තත් අතර මෘදු ස්වරෙ ඇයමයි මා හදට රස ගෙනෙන මදුවිත ඇයයි ලියතඹරා මිරිඟුවකි මිරිඟුවකි අප රවටනා දුර ඈත සිතිජයකි ඉම නොපෙනෙනා නිල් නයන බිගුකැලකි නෙත් සරය සුමුදුයි මගෙ ජීවෙ වැලි කතරෙ දිය බිඳ ඇයයි ලියතඹරා"},
{"title": "ආසයි බයයි", "artist": "ඇන්ටන් ජෝන්ස්", "author": "Edirisinghe D.b.t.", "lyrics": "සයුර බලා බඳ ලෙලවා ඉවුරු තලා ගලා ගියා මාතර ගං කොමලි නිල්වලා මෙතර සිටිය අය කැඳවා මරු තුරුලට අරං ගියා මුළු සිරිලක දුකෙහි ගිල්වලා වෙසක් සිරි නරඹන්නට මාතර පුරවරය වෙතට නොයෙක් දෙසින් සෙනග පැමිනුනා නිල්වලා ගඟ ඔස්සේ බෝට්ටුවට නැගි සතොසේ  ‍ සමහරෙකුට යන්නට හිතුනා ආසයි බයයි ඒ බෝට්ටුවේ නමයි යළි නොම එන්නට ගිය ගමනයි දිය රකුසයි ගඟ මැද මරුවයි ජීවිත ගණනක් බිලි ගත්තයි බෝට්ටුවට ගොඩ වන්නේ සතුටින් ඉපිලෙන්නේ වේගයෙන් දියඹට ඇදුනේ අත්තක බෝට්ටුව හැපුනේ නොදැනිම ජලයේ ගිලුනේ ඉරණම සැමගේම විසඳුනේ වෙසක් සඳ නැග එද්දි මළ කඳන් පාවෙද්දි නෑදෑ හිතවතුන් වැළපුනේ හද සෝකෙන් ලත වෙද්දි නෙත් කදුලින් බර වෙද්දි මළ මිනි ගොඩට ගෙනෙන්නේ ආසයි බයයි ඒ බෝට්ටුවේ නමයි යළි නොම එන්නට ගිය ගමනයි දිය රකුසයි ගඟ මැද මරුවයි ජීවිත ගණනක් බිලි ගත්තයි පිහිනන්නට බැරුව නියා පෙම්වතා ගිලි ගියා පෙම්වතී ලොවේ තනිවුනා කරුමය මෙලෙස කියා අන්තිම ගමන ගියා මව්පියො හිතවතුන් වැළපුනා ඒ සිදුවු විපත අසා රුහුණම දු‍කෙන් වසා දින ගණනක් දුක පල කෙරුවා අහසට දෑතම ඔසවා දෙවියන් යැද කීවා මෙවැනි විපත් යලි නොමවේවා ආසයි බයයි ඒ බෝට්ටුවේ නමයි"},
{"title": "කදුපාමුල සිට", "artist": "ආත්මා ලියනගේ", "author": "Unknown", "lyrics": "කදුපාමුල සිට දැහැනට සම වැද මා ගයනා ගී ඔබට ඇසෙනවද කදු මුදුනේ සිට දිවැස් හෙලනු මැන ආල වඩන සඳ කිඳුරු ලියේ මිටියාවත් කදු ශිඛර සිසාරා සඳ බැස යන තුරු ‍අවර වනපෙතේ ඔබ කී රහසින් මා සැළුනේ නැත ඔබ අන්සතු බව මම දැන සිටියේ ඇල දොල ගංගා සයුර සිසාරා ඉර නැග එන විට පෙරඹර අහසේ ඔය නෙතු කැල්මෙන් මා සැළුනේ නැත ඔබ අන්සතු බව මම දැන සිටියේ කදුපාමුල සිට"},
{"title": "හිත දුර හන්දා", "artist": "ආත්මා ලියනගේ", "author": "Unknown", "lyrics": "හිත දුර හන්දා නෙතු ලග හංගා සිහින ගණින හින්දා තනිකම හංගා ඈතක රන්දා මතක හිත වින්දා අරුත කියන සෙනෙහේ නුඔම වේද මන්දා ඈත අතීතෙක අමතක සෙනෙහේ හිතවත් කරනා සිහින පොතේ කවි දහසක් අතරේ නුඹමයි හිදිනා නොමැකෙන සේ හදවතේ ඉන්න නුඔ අලුතෙන් පතනා හිත දුර හන්දා අහස වගෙයි නුඹ සිතුව අතීතේ මතකෙට නැගෙනා හැඩවෙන හිත ලග තනියට ඉන්නේ නුඹමයි කියනා ඉස්සර දවසක තහහම් හීනේ අයෙත් දකීනා"},
{"title": "එපා කඳුලැල් සලා", "artist": "ආත්මා ලියනගේ", "author": "Unknown", "lyrics": "එපා කඳුලැල් සලා හඬන්නට ඔබේ නෙත මල් සුවඳ ගලා සිප ගනී ඔබේ මුව එපා සුසුමන් හලා රිදවන්න ඔබේ හද සියොත් කැල ගී ගයා සතපවයි ඔබේ සිත ආදර හැඟුමන් සලා‍ මිරිඟුවක වෙලෙන් එපා ඔබේ හද පුදසුනේ හිමි කුමරු එන තුරා"},
{"title": "සෙනෙහසකට අරුතක්", "artist": "අසංක ප්‍රියමන්ත", "author": "Unknown", "lyrics": "සෙනෙහසකට අරුතක් පුරවන්නට අහසේ තරු ගැන්නා වෙරලේ රළ මැන්නා සීමාවක් මායිමක් නැතැයි කී සෙනෙහස ඇයි දෙතැනක තනිවී කැකුළක් සිදුනින් හදවත පිපුණූ කඳුලෙත් අතුමත විස තිබුණා බිඳුනොත් බඳුනක පිළියම් කරනට බැරි කැළලක් මතුවී පෙනෙනා සෙනෙහසකට අරුතක් පවකින් පෙර අත් භවයක සිදුවූ සිතකින් සිතකට දුක පිරුණා මගෙ අත දිගු කළ හැකි හැම තැනදී ඔබ අත මා දුරකින් තිබුණා සෙනෙහසකට අරුතක්"},
{"title": "සඳ සේ නිලම්බරේ", "artist": "අසංක ප්‍රියමන්ත", "author": "Unknown", "lyrics": "සඳ සේ නිලම්බරේ පායා ආ පාවී ඔබ ආවෙ නැති දවසම පාළුයි තරහක් නෑ මං ආයේ හිත රිදවන්නෙපා ආදරේ සඳ සේ නිලම්බරේ අප යන එන තැන මල් උයනේ හිඳි පාරාදීසේ පෙම්වත්තු ඇස නොම දුටු දා උන් විමසනවා නුම කොහිදෝ හිත අරගත්තු නපුරු වෙලා හිත නම් පට බැන්දට අමනාපෙන්වත්දෝ හිත රිදවන්නෙපා ආදරේ සඳ සේ නිලම්බරේ ඉස්සර පෙම් හිත කවි ගී උල්පත ඔබ ළඟ නැතිවත් තව එහෙමයි පෙම් කල හදවත වාවන්නේ නෑ ප්‍රේමයෙ සැමරුම් හිත රිදවයි කඳුළු කතාවට පර මල් උයනට වසන්තයක් වේදෝ හිත රිදවන්නෙපා ආදරේ සඳ සේ නිලම්බරේ පායා ආ පාවී ඔබ ආවෙ නැති දවසම පාළුයි තරහක් නෑ මං ආයේ හිත රිදවන්නෙපා ආදරේ සඳ සේ නිලම්බරේ සඳ සේ නිලම්බරේ"},
{"title": "පැහැසර අරුණක", "artist": "අසංක ප්‍රියමන්ත", "author": "Unknown", "lyrics": "පැහැසර අරුණක ඉරමල පිපුනාවේ යුගදුරු යුගදුම සැනකින් නිවුනාවේ හිමිදිරියේසීතල හීනෙක දැවටීවත් පරවි පියාපත් ඇසුනාවේ සිත සිරකොට බැදි දඬු වැට බිදුනාවේ සිත සිත යා කර සෙනෙහස හැමුවාවේ සිත සිරකොට බැදි දඬු වැට බිදුනාවේ සිත සිත යා කර සෙනෙහස හැමුවාවේ පැහැසර අරුණක ලියවැල් ඇහැරී යලි මල් පිපුනාවේ දෑලම යා කල ඉදු සැව් ඇදුනාවේ ලියවැල් ඇහැරී යලි මල් පිපුනාවේ දෑලම යා කල ඉදු සැව් ඇදුනාවේ පැහැසර අරුණක"},
{"title": "ලෑබුනත් නෙත් යුග", "artist": "අසංක ප්‍රියමන්ත", "author": "Unknown", "lyrics": "ලෑබුනත් නෙත් යුග දහසක උරුමේ මදි මට මුලු සන්සාර යුගේ ඔබව බලා ගන්නට අම්මෙ ඉර හද පතුරන එලියට වෑඩියෙන් ඔබ මට එලියයි අම්මේ දහසක් නෙත් මට මදි අම්මේ දහසක් නෙත් මට මදි අම්මේ ලේ කිරි කරලා අම්මාත් මා දුක් පෙව්වද නෑත්තම් ඊට වඩා ඉහ හද දරු සෙනෙහසට යටත් කොට දිය කර පෙව්වද සේද වලා දසමාසේ කුසෙහි මා දරලා ඉසිලූ බර තව ඔබට මදි දරු සෙනෙහස මතු බුදු කරවන්නට මව් පදවිය ඔබ ලබන ලදී"},
{"title": "හිරු විකසිත වී", "artist": "අසංක ප්‍රියමන්ත", "author": "Unknown", "lyrics": "හිරු විකසිත වී මියයන පොළවේ එළිය අඳුර සම සමව බෙදයි ගත පණ නළ වන් රුධිරය මවුගේ කිරට හැරී කුසගිනි දුරලයි සමුදු වදන් සවනත පාවේ බිළිඳු ඔබේ තුරුලේ සැතපේ ලෝකය බිහිකල මවුනේ මගේ නුඹේ නමට මුළු ලොවම වඳී හිරු විකසිත වී හදමඬලේ සෙනෙහස් කඳුලින් සුදු බුදු රැස් විහිදුනි අහසේ එවන් මහිමයක් ලොවට උදාකල මවුනි ඔබට මුළු ලොවම ගැතියි හිරු විකසිත වී"},
{"title": "ගීතයක් සේ", "artist": "අසංක ප්‍රියමන්ත", "author": "Unknown", "lyrics": "ගීතයක් සේ මතුවෙයන් නොසිතූ වෙලාවක හීනයක් සේ පෑදියන් තනිවූ විරාමෙක මා හැරදමා ගිය මියුලැසී හෙට දිනක් පෙර මඟක් අරමුණක් නැති ගෙවෙන දිවියේඉසිඹුවක් ලෙස හෝ ගෙවුනු රස බර මතක මතුකර හිනැහියන් මා හැර දමා ගිය මියුලැසී ගීතයක් සේ හිනැහෙමින් වැලපෙමින් තුටු සිතින් පෙම් පිරූ සමයේ සලකුණක් ලෙස හෝ පුරුදු ඉමිහිරි සිහින සමඟින් දැවටියන් මා හැරදමා ගිය මියුලැසී ගීතයක් සේ"},
{"title": "දීපාවලී දාට", "artist": "අසංක ප්‍රියමන්ත", "author": "Unknown", "lyrics": "දීපාවලී දාට දීපාවලී සඳ අරන් මාතර ගෙදර එන්න යාපා පටුන පහුකරන් සිංහල හාලෙ බතට ආසම මාළු පිණි උයන් ගමේම නෑයො එක්ක අපි ඉන්නවා මග බලන් වෙඩි සද්දයට බයේ දරු කැක්කුමත් හිත දරන් මහ ගෙදරටම වෙලා අපි හිටියේම හරි දුකෙන් දැන් ගිනි අඩුවෙලා ගිහින් පුතුනේ ගෙදර එන්න පොඩි පැටවු අරන් කෝවිල ළඟදි දැකපු දේවී ගැනම හිත ගිහින් නොකියා ගියේ නුඹයි අපෙ අවසරය නැතිකමින් දැන් තරහා නිවී ගිහින් තල් පැදුරකුත් වියන් එන්න යාපනෙන් දීපාවලී දාට දීපාවලී සඳ අරන්"},
{"title": "ගැලූ දිය කඳ", "artist": "අසංක ප්‍රියමන්ත", "author": "Unknown", "lyrics": "ගැලූ දිය කඳ හැපී බිඳුනා තිසා වැව් බැම්මේ ඉතින් නුඹ නෑ මමත් හෙට නෑ තිසා වැව් ඉවුරේ එදා සාලිය අසෝකාවන් වගේ අපි දෙන්නා මඟුල් උයනේ කෙරූ සක්මන් අදින් පසුනම් නෑ රන් පියුම නැති දා විල් තලය හැඩ නෑ ගැලූ දිය කඳ පැතලි රුවසේ එකට ඉන්නට අපිට පිං නැති දා ඉසුරුමුණියේ කිසිම අගයක් ඉතින් දැන්නම් නෑ පව් කෙරුව හින්දා වෙන්ව යන් නොහඬා ගැලූ දිය කඳ"},
{"title": "ආදරෙයි මං", "artist": "අසංක ප්‍රියමන්ත", "author": "Aradhana Ekanayaka", "lyrics": "ආදරෙයි මං ඔය හිතට තාමත් සිහිනයකවත් ඔයා දැන් නාවත් වෙන්වෙලා අපි දුරින් ඉමු කීවත් මතක් වෙන්නේ ඔයාවයි තාමත් ආදරෙයි මං ඔය හිතට තාමත් සිහිනයකවත් ඔයා දැන් නාවත් ආදරෙන් මට හීන ගෙනත් දුන්න ඇස් දෙකෙන් කඳුළු දීලා හිත පුරා රැඳුන ආදරෙත් රැගෙන ඔබ ගියා නේද වෙන්වෙලා ඔබ දුන්නු දුක දැනිලා දෑස හඬයි තනිවෙලා ආදරෙයි මං ඔය හිතට වේදනාවෙන්ම මියදුනත් දිනෙක මතකයෙන් යන්නේ නෑ ඔයා නෙතු තෙමා බලන කඳුළු බිංඳු වල දුක දන්නේ නැත්තේ ඇයි ඔයා ඔබ ලගින් නෑති හින්දා දෑස හඬයි තනිවෙලා ආදරෙයි මං ඔය හිතට"},
{"title": "සඳ එබෙන් එපා", "artist": "අතුල අධිකාරී සමග සමිතා මුදුන්කොටුව", "author": "Unknown", "lyrics": "සඳ එබෙන් එපා තරු සිදුරු වසා අඳුරු නෙතු තාරකා හඬවා සත්සියක් සියපත් මතින් මුදු සුවඳ හමනා මතක සුව ගෙනෙනා ඔබ ලඟ නිසා පින් සිත පුරා මල් මාලතී පිපුණා සමසුන් අරා සිත් විල වසා කුමුදුත් කොඳක් පිපුණා සඳ එබෙන් එපා ඔබ දුර නිසා ගගනත පුරා අසෙනි වැසි වැටුණා සිත දුක් දරා සුසුමින් වසා කදුළුත් හඳක් හැඬුවා සඳ එබෙන් එපා"},
{"title": "රන් පලසේ වැතිරී", "artist": "අතුල අධිකාරී", "author": "Unknown", "lyrics": "රන් පලසේ වැතිරී ඔබ හමුවූදා ආදරේට ආදරේ ලැබුවා පෙම් පියසේ අපි තනිවුනු මොහොතේදි ජීවිතේම සිහිනෙකැයි සිතුනා ආදරයේ ඒ කුටියේ රන් පහනේ එලියේ මා දුටුවේ රන් දහරේ දෙවු අඟනයි කුමරී රන් පලසේ වැතිරී කුමරියේ ඔබෙ හදවත ලඟ ඇත සිත මගේ රැඳිලා කුසුමියේ ඔබේ රොන් පිරි සුවඳට සිත බිඟුන් බැඳිලා අද රෑට පායනා සඳුන් මගේ රොන් බිඟුන් ඇදෙන්නපා මෙහේ රන් පලසේ වැතිරී"},
{"title": "මගේ කියා ඈත් වෙලා", "artist": "අතුල අධිකාරී", "author": "Aradhana Ekanayaka", "lyrics": "මගේ කියා ඈත් වෙලා වේදනා දුන්න හිත ළග පෙම් සිහින වල හිදින්නේ ඔබමය ඇස් දෙක ආයේ ඔබේ ඉතින් හිමිවෙන් නැතිවාට කදුළු මතක අපේ සිහින කර අඩන්නෙ තනිව අඩන්නේ තනිව දුර ‍රැදිලා කදුළු දරන් මට හිදින්න බෑ මා තනිවම විදිනවා දුක ඔයා දන්නෙ නෑ නාඳුනනා ලෙස සැමදා මට ඉන්නට බෑ කවදාවත් මට ඔයාව යලි හිමිවෙන්නෙ නෑ යලි හිමිවෙන්නෙ නෑ හිත දවනා මතක තියන් මට හිදින්න බෑ රෑ තනිවම හැඩුව තරම් ඔයා දන්නෙ නෑ මේ දෑසට යලි කිසිදා ඔබ හමුවන්නේ නෑ කවදාවත් මට ඔයාව යලි හිමිවෙන්නෙ නෑ යලි හිමිවෙන්නෙ නෑ මගේ කියා"},
{"title": "මා දෑසේ ආදරේ", "artist": "අතුල අධිකාරී", "author": "Unknown", "lyrics": "මා දෑසේ ආදරේ හැඟුම් ලියා තියා ඈ කවුදෝ මා හදේ හැගුම් වශී කලා පාරාදීසේ මා දමා පාළුවේ ඈ ගියා මා දෑසේ ආදරේ හැඟුම් ලියා තියා වේදනාවකී ඇගේ සෙනේ මා පැතූව ලෝකයේ වාසනාව පා වුනේ කොහේ මට වේදනා තිලිණේ පුදා හසරැල් සලා ඈ මිදීලා යාවී මා දමා ජීවිතේ පුරා ඔබේ සෙනේ ලැබේවිදෝ ළඳේ ඔබේ ආදරේ ලැබේවිදෝ ළදේ සෙනෙහේ පුදා සසරේ පුරා පැතුමන් දරා ඈ මෙ මාව ඒවිදෝ සොයා මා දෑසේ ආදරේ හැඟුම් ලියා තියා"},
{"title": "මධුර වසන්තේ", "artist": "අතුල අධිකාරී සමග සමිතා මුදුන්කොටුව", "author": "Unknown", "lyrics": "මධුර වසන්තේ මල් ලියකම් බබලා සතර දිගන්තේ ඔබෙ පිළිරූ පිපිලා කුමරියනේ වසන්ත සමයේ මලින් මලේ ලලිත ලතා මධුර වසන්තේ මල් ලියකම් පිපෙනා සතර දිගන්තේ පෙම් පණිවුඩ ඇසෙනා කුමරුවනේ මා ඒ වසන්තයයි වසත් සමේ ඔබෙ ළඟමයි මධුර වසන්තේ මල් ලියකම් බබලා දේදුණු පාටැති මල් සිඹ සමනළ සේනා උයන සරාලා මලකින් මලකට හෙමිහිට මුණු මුණු ගානා මුව කොඳුරාලා මොනවාදෝ උන් මුමුණන්නේ මධුර වසන්තේ මල් ලියකම් බබලා කියඹු ලතා මැද චන්දන තිලකය ඔබගේ දිලි දිලි දිලිහේ මා දෙතොලින් බොඳ වේවිද පෙම් කුමරියනේ සුන්දර උදයේ සැරසරමු අපි පෙම් නගරේ මධුර වසන්තේ මල් ලියකම් බබලා මධුර වසන්තේ මල් ලියකම් බබලා මධුර වසන්තේ මල් ලියකම් පිපෙනා සතර දිගන්තේ ඔබෙ පිළිරූ පිපිලා සතර දිගන්තේ පෙම් පණිවුඩ ඇසෙනා"},
{"title": "හිත අස්සට හීන ගොඩක්", "artist": "අතුල අධිකාරී", "author": "Unknown", "lyrics": "හිත අස්සට හීන ගොඩක් ගෙනල්ල දුන්න ඹය ඇස් දෙක අමතක කර හිඳින්නෙ කොහොම සුළඟ වගෙ මා අතහැර දුරක යන්නට වරද මගේ රත්තරනේ කියලා දෙන්න කඳුලක් කඳුලක් ගානේ පෙම දියකරලා සුසුමක් ගානේ හදවත දුක් ගිනි අවුලා අමතක කර ලන්නට බැහැ මටනම් කිසිදා ආදරේ කියාදුන්නු ආදරී ඔයා තැවුනත් දැවුනත් මියගිය පෙම සිහිකරලා සුවඳක්වත් නැහැ මතකයේ අදනම් රැඳිලා අමතක කර ලන්නට බැහැ මටනම් කිසිදා ජීවිතේ කියා දුන්නු ආදරී ඔයා හිත අස්සට හීන"},
{"title": "ඉවසයිද මන්දා", "artist": "අතුල අධිකාරී සමග සමිතා මුදුන්කොටුව", "author": "Unknown", "lyrics": "ඉවසයිද මන්දා මා දුන් රිදුම් වෙන්වීලා ආ දා වෙනතක් බලන් උන්නාට මා රහසේ තුරුලක හෙමින් මට ඉන්න බෑනේ මතකෙට හොරෙන් තනියෙන්ම වින්දා දුන් දුක් සුසුම් තව කදුළු නැනේ දෙනෙතේ ඉතින් ගියදාම ඔබ ඔහු හා ඉගිල්ලී හොරෙන් මට මාද නැතිවුනා සත්තයි හෙමින් ගොළුවෙච්ච තරු දෑසේ කදුලැල් උනන්නේ දරාගන්න බෑනේ මතකේ විලාපේ ආදරේ ඔබෙන් තරම් ලැබුනෙ නැ කාගෙන්වත් රැකගන්න බැරි වුනේ සංසාර ආදරේ ගියදාම ඔබ ඔහු හා ඉගිල්ලී හොරෙන් මට මා ද නැතිවුනා සත්තයි හෙමින් මේ පාළු දුක් සිහිනේ අතර මංවෙලා බොහොසේ අයේ ගන්න බෑ සෙනෙහස ඔබේ ජීවිතය වැටුනු තරම් නැගිටගන්න බෑආයේ මැරී මැරී උපදී මේ සංසාර ආදරේ උන්නාට මා රහසේ තුරුලක හෙමින් මට ඉන්න බෑනේ මතකෙට හොරෙන් ඉවසයිද මන්දා"},
{"title": "හිත අස්සට හීන ගොඩක්", "artist": "අතුල අධිකාරී", "author": "Unknown", "lyrics": "හිත අස්සට හීන ගොඩක් ගෙනල්ලා දුන්නු ඔය ඇස් දෙක අමතක කර හිඳින්නෙ කොහොම සුළඟ වගෙ මා අතහැර දුරක යන්නට වරද මගෙ රත්තරනෙ කියලා දෙන්න කඳුලක් කඳුලක් ගානෙ පෙම දියකරලා සුසුමක් ගානෙ හදවත දුක් ගිනි අවුලා අමතක කරලන්නට බෑ මට නම් කිසිදා ආදරේ කියා දුන්න ආදරි ඔයා දැවුණත් දැවුණත් මියගිය පෙම සිහිකරලා සුවඳක්වත් නෑ මතකයෙ අදනම් රැඳිලා අමතක කරලන්නට බෑ මටනම් කිසිදා ජීවිතේ කියා දුන්නු ආදරී ඔයා හිත අස්සට හීන ගොඩක් ගෙනල්ලා දුන්නු"},
{"title": "එක දවසක් හැන්දෑවක", "artist": "අතුල අධිකාරී", "author": "Unknown", "lyrics": "එක දවසක් හැන්දෑවක කණාමැදිරි එළි පාරක මං හෙව්වා තරු කැටයක් මං හෙව්වා තරු කැටයක් නිල් පාටින් පායා දිලෙන නිල් පාටින් පායා දිලෙන සිහිනයක ගිලී මා සිටියා කවුරුදෝ විත් දොර බිදිනා විට සුළං පොදක් වත් ඇරුණු දොර පියනින් ආවා නම් සිහිනයේ සුව අරං නන්නාදුනා දෑසක් නිවී නිවී දිළිසුනා මොහොතක් සුහද ආරාධනාවක් අරන් ඈ ඇවිත් දොරකඩට පවන් පොදකටවත් ඉඩක් නෑ නොවෙද අවකාශයම වසාගෙන ඈ සිටිනා විට මා අසළ ඈ සිටිනා විට මා අසළ එක දවසක් හැන්දෑවක මා අසළ ලැගුම් ගනු පෙරතුව මා තුලට මොහොතකට එබුනා නම් පැහැදිලිව දකින්නට තිබුණා මා තුලම මා නොවන පිටස්තරයෙකු සිටිනා වග ඔබේ පෙම  මා හටද මා නොවන ඒ අමුත්තා වෙතද ඔබේ පෙම මා හටද මා නොවන ඒ අමුත්තා වෙතද"},
{"title": "ආලෙන් වෙලා ගන්න", "artist": "අතුල අධිකාරී සමග සමිතා මුදුන්කොටුව", "author": "Unknown", "lyrics": "ආලෙන් වෙලා ගන්න කෝලම් කලා හිත ආලෙන් මුදා ගන්න මායම් කලා මම හීනෙන් අපේ ලෝකෙ සායම් කලා ඔබ සායම් මකාලන්න වෑයම් කලා මම දෑසෙන් කලා ඔබට පෙම් යෝජනා ඔබ කලා යෝජනා වලට, චෝදනා මම මෑතින් හිදන්වුන් ලගින් වේදනා ඇයි ඔයා බැලුවෙ ඇස් දිහා මගේ නාඬනා පෙම් වසන්තේ ඇවිත් නැද්ද තාමත් ඔහේ පාළුයි මගේ නැද්ද තාමත් හිතේ වසන්තේ ඇවිත් බොහෝම කාලයක් මෙහේ අපේ ආදරේ භාවනාවක් වගේ ආලෙන් වෙලා ගන්න"},
{"title": "ලෙන්ගතුකම නෙතග තියා", "artist": "චාමර වීරසිංහ", "author": "Unknown", "lyrics": "ලෙන්ගතුකම නෙතග තියා බලනා විට ඔබ සගවාගෙන ඉන්නට බැ මගේ ආදර හිත මිතුරිය සේ ඔබ උන්නත් මගේ හදවත ලග සොදුරිය කර ගන්නයි මා සිතුවෙ සැම දින ඇස අද්දර හමු නොවුනත් ඔබ එක දවසක් සිතට ඔබව දකිනාතුරැ නෑ ඉවසිල්ලක් සද තරමට අවිහිංසක සොදුරැ හදවතක් බලා හීදී ඔබෙ හිතේ දෙන්න මට ඉඩක් ලෙන්ගතුකම මිතුරැ කමට එහා ගියපු ලෙන්ගතු ඇසුරක් ඔබෙන් පතා ගෙවී ගියා කල්ප කාලයක් කදුළු පිරැණු තනිකඩ වු පාලු හදවතක් බලා හිදීමි ඔබෙ හිතේ දෙන්න මට ඉඩක් ලෙන්ගතුකම"},
{"title": "ගුරුගෙදරට", "artist": "චාමර වීරසිංහ", "author": "Unknown", "lyrics": "ගුරුගෙදරට හැමදා එන මවුපියෝ අතරේ කවදාවත් මගේ පියා නෑ මම දුටුවේ උප්පැන්නේ පියාගෙ නම ලියන තිරුවේ පියාගේ නම ඉරක්‌ උනේ කොහොමද අම්මේ උදේ හවස මගේ හිතින් අපේ බිත්තියේ හැමදාමකම තනියෙන් මම සිතුවම් ඇන්දේ පියෙකුගේ රූපයක්‌ නැතත් දැකපු ජීවිතේ හැඩරුව වත් කියාදෙන්න මගේ පියාගේ මගේ වයස අපේ එවුන් මගේ පන්තියේ අවජාතක නමකින් මට නම් පට බැන්දේ හරියට තේරුමක්‌ නැතත් කියපු කාරනේ"},
{"title": "කුරුඳු සුවදැති සුළඟම", "artist": "චාමර වීරසිංහ", "author": "Chamara Weerasinghe", "lyrics": "කුරුඳු සුවදැති සුළඟම නැඹුරු වී මගෙ සුසුමට අඬගසන තුරු ප්‍රථම ප්‍රේමය සදා තරුණයි ජීවිතේ හද සිදුරු කළ ප්‍රථම ප්‍රේමය සොඳුරු පුවතයි ජීවිතේ සදා තරුණයි ජීවිතේ වෙනදා වගේම පුරහඳ පුරවරයට පා එනවිට දැනෙන දුක නිදුකක් බව ගැඹුරු ලෙස දැනෙනව මට කුරුඳු සුවදැති සුළඟම නපුර වපුරන අදුරද පිදුරු අවුලයි මතකෙට කදුරු පුපුරයි හද තුළ ඒත් මිහිරී එය මට කුරුඳු සුවදැති සුළඟම"},
{"title": "ගාඩි කෙල්ලෙ", "artist": "චාමර වීරසිංහ", "author": "Unknown", "lyrics": "ගාඩි කෙල්ලෙ නුඹ තැන තැන යන්න එපා බැද්දේ කොනිත්තන්න රොඩී කොල්ලො මඟ බලාන ඇත්තේ ගාඩි වුණත් වංසෙ මොටද කබල් ගගා ඉන්නේ යන තැනකට හිත දීපන් දැන් හරි බං කාලේ ගෝම ගැන ගැන හිටියට අරන් යන්න කෙනෙක් නැතේ ගෙවල් ගානෙ කුළු හදාන ගියාට නෑ ගන්නේ පින් කඳ කීවට කවුරුත් පින් කඳලා නෑනේ ඔහෝම ඉදලා රෑහෙන් පට බහදීපන් කෙල්ලේ"},
{"title": "බුදුන් දැක නිවන් දකින්න", "artist": "චාමර වීරසිංහ", "author": "Unknown", "lyrics": "බුදුන් දැක නිවන් දකින්න මේ සංසාරේ අපි ඇසු බණ මදි වුනාද මේ ධම් දීපේ සිල් ගත්තා පින් කෙරුවා දිවා රෑ දෙකේ අතරමං වුනේ කොහොමද අපේ ජීවිතේ අපේ ජීවිතේ සාදුකාර දී ගිය ගිය පන්සල් ගානේ පැතුවා හැමදා පේවී අපි නිර්වාණේ දැහැමි සිතින් පහන් තියා මහ බෝ සෙවණේ වැඳ වැටුනා ගාථා කියා අපි තුන් සරණේ භාර හාර වී වැඳ වැඳ අටමස්ථාන කරුණා කෙරුවා පේවී මුණි සිරි පාදේ සැදැහැ සිතින් නිවන් පතා දළදා මැදුරේ මල් පිදුවා ගාථා කියා අපි තුන් සරණේ"},
{"title": "බුදු පදවි පතාගෙන", "artist": "චාමර වීරසිංහ", "author": "Unknown", "lyrics": "බුදු පදවි පතාගෙන දරුවන් රකිනා අම්මා තවමත් ගිනිහල් ගේ ගිනි අතරේ මහළු මඩමකට විවරණ පිනිස ගියාදෝ උඩුමහන්තලාවේ රතු පලසේ වැජඹෙනදා ඇගේ දරුවෝ බුදුපදවි පිනිස දූ පුතුන්ට හිත දන්දුන් අම්මා තවමත් ගිනි උහුලනවා මේ සසරේ තවමත් ගිනි උහුලනවා අම්මා කතරේ"},
{"title": "බැද්දට සඳ වගේ", "artist": "චාමර වීරසිංහ", "author": "Unknown", "lyrics": "බැද්දට සඳ වගේ ගෝමරි මල් මද කැකුළියේ රන්දාපාමිනේ නැතියේ රන්කඳ වී මගේ මං බැද්දේ ගොහින් බමර කොටක් ගෙනැල්ලා දෙන්නම් ගම් බැද්දෙ ගොහින් ගෝතම් පොජ්ජක් ගෙනැල්ල දෙන්නම් මහ හූරෝ සහේට ගන්නට හැදුවට යන්ට එපා උඹ යන්ට එපා හිත්ලෑව මේ ඇත්තෝ අහක දමා හිත්ලෑව මේ ඇත්තෝ අහක දමා මහ බල ඇති කළු බණ්ඩාර දෙවියන්ට යදිනවා මං යදිනවා මගෙ ගෑනි සහේට ගන්ට හිතා මගෙ ගෑනි සහේට ගන්ට හිතා"},
{"title": "ඈතින් ඈතට", "artist": "චාමර වීරසිංහ", "author": "Unknown", "lyrics": "ඈතින් ඈතට ඈතින් ඈතට ඈතින් ඈතට ගියා මා ලඟ තිවු සිත අරන් ගියා සුවඳ වත් මා ලග‍ නොතියා අමතක කරලන්නම් කියා ගියා අමතක කරලන්නම් කියා ගියා ඔය ඇස් අමතක වෙන්න නම් මගේ ඇස් පිය වෙන්න වෙයි සීතල වැහි බිංදු සේම කදුළු කඩා හැලෙනවා නිමක් නොවේ පොළව ඉහිලුවත් ඒ වැහි බිංදු කදුළු ගලන්නට ඉඩ මදිලු ඔය ඇස් අමතක වෙන්න නම් මගේ ඇස් පිය වෙන්න වෙයි ජීවිතයේ මඟ ම‍ට හරි නුහුරු ඉර බටු තරුවයි මග පෑදූ ඈතක ගිය තරුවක මා දැවටි පැතුම් පතා වී මග තනිවී ඔය ඇස් අමතක වෙන්න නම් මගේ ඇස් පිය වෙන්න වෙයි"},
{"title": "තනි රැක්ක තනි රෝස", "artist": "සෙන්ටිග්‍රේට්ස්", "author": "Unknown", "lyrics": "තනි රැක්ක තනි රෝස මල් කල්පනා විහිදෙන්න පොපියද්දී සුවඳක් වෙලා නෙත් එක්ක හුවමාරු කල දුක් කතා සිත දෙකක හැප්පෙද්දී එක හිතක් වෙලා කන්තාරුවක රිද්මේ රැඳී ගී පිරිතක් විඳී ජීවිතේ නිල් සඳ මඩලේ පලසේ එබේ ඔබෙ ආදරය පින්තාරු වේ කන්තාරුවක රිද්මේ රැඳී ගී පිරිතක් විඳී ජීවිතේ ඔබෙ ආදරය පින්තාරු වේ ඔබ නිදනා තුරු පපුතුරේ සුවඳ එබෙයි සුසුමට මගේ කඳුලෙන් කඳුලට ජීවිතේ හුස්ම වැටෙයි පරමාදරේ"},
{"title": "සුසුමන් සලයි", "artist": "සෙන්ටිග්‍රේට්ස්", "author": "Unknown", "lyrics": "සුසුමන් සලයි නෙතු පියන් ඇරෙයි උණු කඳුලු වැටී උණුහුම සිසිලයි තත්පරයක් හෝරාවක් කප් සුවහස් කල් ඔබෙ රුව ඔබෙ රුව ඔබෙ රුව අඳුර හාදු දෙන සිතුවිලි ගොන්නේ තරු කඩා වැටෙයි සඳ අමාවකයි ඉකි බිඳ ඉකි බිඳ සිතුවිලි සිරකර හිත හඬා වැටෙයි ගත මිලාන වෙයි රළ බිඳෙන තරම් සැඩ සුළන් සරින් මතකය පමණයි සෙනෙහස සසලයි මිහිකත නැවතී ලොවම එපාවී මට ඔබ පමණයි ඔබෙ රුව පමණය සුසුමන් සලයි"},
{"title": "තාරකාවෝ මැදින්", "artist": "සෙන්ටිග්‍රේට්ස්", "author": "Unknown", "lyrics": "තාරකාවෝ මැදින් අහසේ පොලොව වෙත ආ සීත පිනි මෙන් දයාබර ලෙස සිනාසී බලා සිටියත් අහිමි වී මා සොයාවිත් මගේ සුරතේ නුඹ වෙලෙනු දැකුමට සිනාසී පැතුම් පිරුවත් අහිමි වී ඔබ අහිමි වී නෙක ලතාවන් තුරු සොයාවී වෙලී පැටලී සිනාසී පැතුම් පිරුවත් අහිමි වී ඔබ අහිමි වී මා සොයාවිත්"},
{"title": "සිත සැලුනා", "artist": "සෙන්ටිග්‍රේට්ස්", "author": "Unknown", "lyrics": "ඇය හද ගැස්මේ සඟවා සිහිනයකට පෙම් කරලා දුක විතරක් තුරුලු කරන් ඔහු යනවා ඈ සොයලා නුඹ වේ මා හිමි කාරියේ නුඹ වේ මා පැතු ලෝකයේ නුඹ වේ මා දුටු සිහිනයේ නුඹ වේ මගෙ මුලු ජීවිතේ සිත සැලුනා නුඹ හින්දා නෙතු හැඬුවා දුක හින්දා ඔය දෙතොල ආදරෙන් සිප ගන්න දැවටෙන්න පැහැදුල් නුවන් සඟලේමට ඉන්න ඉඩ දෙන්න සියපතක පෙති අතරේ දැනෙන සුව විඳ ගන්න කවදාද ඔබ එන්නේ මගෙ හිතට සැනහෙන්න සිත සැලුනා නුඹ හින්දා නෙතු හැඬුවා දුක හින්දා"},
{"title": "සිරියාවී", "artist": "සෙන්ටිග්‍රේට්ස්", "author": "Unknown", "lyrics": "මන් මත් නුවන් අගින් රොන් ගෙන යන්නයි හිතෙන්නෙ ඉතින් ළං වී තුරුල් වෙමින් කියන්න රහසින් සුසුම්ලමින් ආදරේ කරන්නේ හැඟුම් මතින් රැඳී සිටින්නේ නුඹේ නමින් මගේ සිරියාවී දඟකාරී මා වෙන්ව හැරලා රෑ තුන් යාමේ නිදි යහනේ මට නින්ද කුමටා තරුමල් මොන තරම් අහසේ දිදුළනා සඳු නැතිදා තරු මොටද වැලපෙන්නේ හඬලා [RAP] මන් මත් නුවන් මගේ සිරියාවී දඟකාරී"},
{"title": "සඳවතියේ", "artist": "සෙන්ටිග්‍රේට්ස්", "author": "Unknown", "lyrics": "සඳවතියේ ඔබ මුදු දෑතේ වළලු හඬින් මා සිත පිබිදේ ඔමරි ලතා මා හද දැවටේ පායන සඳ මෙන් ඔබ මා සිත බැබලේ හැන්දෑවේ සඳ කන අතරේ මා සෙනෙහෙ ඔබ ළඟ රැඳුනේ රෑ අහසේ රන්තරු දිලිසේ තනිකම ආවේ තනියට මාගේ ඔය දෙතොලේ සිනහව දැකලා රන් ගොයමේ මල් පීදී නැමිලා දෙවට දිගේ තුරු වැල් සැලෙනා මන බැන්දලූ ඔබේ රුව දැකලා"},
{"title": "රෑ අහසේ තරු ගානට", "artist": "සෙන්ටිග්‍රේට්ස්", "author": "Unknown", "lyrics": "රෑ අහසේ තරු ගානට දුර විහිදෙන අනන්තයට සංසාරේ පතා ආපු මගේ ආදරෙ මදි උනාද ඉඟ නෙරියේ රැළි හදාපු සවන් පතට තෝඩු දාපු ඔය දෙතොළට හාදු දීපු මගෙ ආදරෙ මදි උනාද නුඹෙ උකුලේ හිස තියාන සුරතලියේ හිත පුරාම සඳ එළියේ පෙම් පුරාපු මගෙ ආදරෙ මදි උනාද මගෙ හිස නුඹ අත තියාන මං දිවුරා නුඹ කියාපු ඒ ආදරෙ නැති වුනාම මං ජීවත් වී හිඳීද නුඹෙ උකුලේ හිස තියාන"},
{"title": "ඔබට නොහැත (මල් දෙවට)", "artist": "සෙන්ටිග්‍රේට්ස්", "author": "Unknown", "lyrics": "ඔබට නොහැක මගේ සෙවනට එන්නට මටද නොහැක මල් විමන් තනන්නට නමුදු සොඳුරේ මේ සුවිසල් අහස යට අපේ සුසුමන් හමුවේලා මුමුණනු ඇත අතැඟිලි නොබැඳෙන හිත බැඳි සෙනෙහස සසර පුරා ලඟ ඉන්න ඇතී ඒ අත් භවයෙත් මේ වාගේම අපි හමුවී වෙන්වී යන්න ඇති හමුවී වෙන්වෙමූ සසර පුරැද්දට එකම සඳේ සඳ එළිය දකිනකොට ඉසුරැ මුණිය පෙම් යුවල නොවේ අප හිනැහෙමු කඳුලැලි සඟවා හිත යට"},
{"title": "හීන අතරින්", "artist": "සෙන්ටිග්‍රේට්ස්", "author": "Unknown", "lyrics": "මගෙ ජීවිතේ ඔබයි සිත පාරමී පුරයි ඔබ හිමිවනා තුරා හිඳිම් ඔය සිනහවෙන් දිදුලනා රුව දකින්නම් ඒ සිනහවෙන් රෑ දිවා මා සැනසෙන්නම් හීන අතරින් මා එන්නම් සෑමදා මා ඒ හීනයේ රැඳෙන්නම් ඔබේ තුරුලේ රැඳී ඉන්නම් හාදු වැස්සක් දී වැටෙන්නම් ඔබ මා වේ නම් සිත පාරමී පුරයි මා ලඟට වී හිඳීවී ඒ සිහිනයේ රැඳේවී ඔය සිනහවෙන් රෑ දිවා මා සැනසෙන්නම් ඔබේ තුරුලේ රැඳී ඉන්නම් හීන අතරින් මා එන්නම් සාමදා මා ඒ හීනයේ රැඳෙන්නම් ඔබේ තුරුලේ මා රැඳී ඉන්නම් හාදු වැස්සක් දී වටේ නම්"},
{"title": "සරා සිහින රහසේ", "artist": "භාතිය සන්තුෂ්", "author": "Unknown", "lyrics": "සරා සිහින රහසේ දිවුරා කියා සිතේ කඳුලු පහසේ මැව්නා සිනා ඔහේ ඇවිද හා මා හද සිතුවිලි විල කලඹා හැරදා මා ඔබ ගියදා උන් තැන තාමත් ‍රැඳිලා සිත කඳුලැල්ලෙහි තවරා කලුවර රසකර වින්දා සඳ සෙවනැල්ලක් හැංගී මගේ ඇස් තනිකර තෙමුනා එසේ කඳුලු ගැලූ ඒ හීනේ තවමත් ඔබයි ආදරේ සරා සිහින රහසේ දිවුරා කියා තනි අතකින් හඬ දෙදරා හරි ආදරයක් හින්ඳා යලි කවදාවත් නොවෙනා මහ සාගරයක හැඬුවා එසේ කඳුලු ගැලූ ඒ හීනේ තවමත් ඔබයි ආදරේ සරා සිහින රහසේ දිවුරා කියා"},
{"title": "හදාගන්න මේ හිත මා", "artist": "සෙන්ටිග්‍රේට්ස්", "author": "Unknown", "lyrics": "හදාගන්න මේ හිත මාගේ - හිනාවෙන්න මා රවටා දමායන්න දෝ ලංවූයේ - කියාදෙන්න වරද සොයා එදාදුන්න ආදර ලෝකේ - හදේ ගැස්ම දෝර ගලා හමා යන්න මාරුත ගින්නේ - සදාකල්ම අතැර දමා ඔය තුරුලේ මෘදු දෙතොලේ සුව යහනේ හාදු තියා නෙතු නොනිදා ඔබම සිතා සැනසුනදා නැ ආයේ එන්නේ මේ දෑසේ ඔබ හා මා - උන් කාලේ සිහිවූවා පායා ආ තරු සිඳුනා - සංතාපේ මා වෙලුනා නැ මා නම් හැඩවූයේ - සංසාරෙ රිදවූයේ ජීවිතයේ සැනසූයේ - ආදරයේ අරුමෙද මේ ලා ලා ලාල ලා ලලලා ලා ලා ලාල ලා ලලලා නැ මා නම් හැඩවූයේ - සංසාරෙ රිදවූයේ ජීවිතයේ සැනසූයේ - ආදරයේ අරුමෙද මේ ඔය තුරුලේ මෘදු දෙතොලේ සුව යහනේ හාදුතියා නෙතු නොනිදා ඔබම සිතා සැනසුනදා නැ ආයේ එන්නේ"},
{"title": "රැස් විහිදෙන සමනලියකගෙන්", "artist": "භාතිය සන්තුෂ්", "author": "Unknown", "lyrics": "රැස් විහිදෙන සමනලියකගෙන් ඉගියක් ලැබුනාම රැක ගන්නම් දුර අවකාශේ ඉගිලී යන දාට පාවී ගොස් උඩු යටිකුරු වී නෙත් තෙමුනාම දිරි දෙන්නම් මුළු හද පත්ලෙන් මහමෙර සේම සියැසින් දුටු සිහිනයකින් රහසක් ගෙන එන්නම් හැබැහින් විද ගන්න රහසින් ගෑ මුදු සුවදින් හුස්මක් පුරවන්නම් ළමැදේ බිහි වෙන්න සුසුමින් හුන්මිටි තබමින් තනියෙන් ඉන්නවනම් ඉන්නම් දුක ගන්න ගලනා දා බිදු පිසිමින් වත්සුනු තවරන්නම් ඉරණම පෙරලන්න"},
{"title": "රෑ පුරා", "artist": "භාතිය සන්තුෂ්", "author": "Unknown", "lyrics": "රෑ පුරා පායනා තාරුකා පහන් සේ දිදුලනා දෑස පා මා දිහා හිනැහුනා බල බලා ලංවෙලා ඔබ එදා තරු නෙත් දෙකින් ඉගිකලා මා හදට ලංවෙලා ඔබ ආවා මා සොයලා සීත රෑ ඒ ලෙසේ කාටදැයි මල් සිනා මගෙ ලොවේ හීනේ බිද දමා ඔබ ගියේ හැගුමන් සිතින් පියඹලා එනවා ඔබ සොයා තනි වීලා පාළුවේ මා අද ඔබේ යහනතේ හීනයක් මෙන් සිතා තැවුනා මගෙ ලොවේ හීනේ බිද දමා ඔබ ගියේ"},
{"title": "පායා එන සඳවත මනරම්", "artist": "භාතිය සන්තුෂ්", "author": "Unknown", "lyrics": "පායා එන සඳවත මනරම් තනිකමත් බෝම සීතයි වාවාගෙන මහමෙරක තරම් උණුසුමකින් තුරුළු වෙමි දිවිය පුරා ලඟ හිඳ මා හා සංසාරේ වෙළෙනා පිනි බිඳක් සේම පායයි උණුසුමකින් තුරුළු වෙමි සසර පුරා ලඟ ඉඳිමි නොහඩනා දිනක් නොතිබුනාද මන්දා ඔබ පෙම් හසුනක ලියනා පෙම් කවි කීවෙමි මුමුණා මඟ බලා හිදී නම් පායා එන සඳවතක තරම් තනිකමත් බෝම සීතයි වාවාගෙන මහමෙරක් තරම් උණුසුමකින් තුරුළු වෙමි දිවිය පුරා ලඟ හිඳ මා හා සංසාරේ වෙළෙනා පිනි බිඳක් සේම පායයි උණුසුමකින් තුරුළු වෙමි සසර පුරා ලඟ ඉඳිමි නොසැලෙනා සිතින් නෙලාගන්න තිබෙනා නෙතු අද්දර මල් පිපෙනා හැර යන්නට සිත නෙදෙනා අපි අපේම වේ නම් පායා එන සඳ සිසිල අරන් මා හා ඉඳ ගං ඉවුර ලඟින් උණුසුමකින් තුරුළු වෙමි දිවිය පුරා ලඟ හිඳ මා හා සංසාරේ වෙළෙනා පිනි බිඳක් සේම පායයි උණුසුමකින් තුරුළු වෙමි සසර පුරා ලඟ ඉඳිමි"},
{"title": "මීදුමෙන් වැසී", "artist": "භාතිය සන්තුෂ්", "author": "Unknown", "lyrics": "මීදුමෙන් වැසී කදුයාය සලිත වී ඔය වාගෙ සීතලෙන් නලියාවි කිති කැවී නීල නිම්නයේ රතු රෝස මල් පිපී අපි වාගෙ ආදරෙන් හිනැහේවි ලං වෙවී ලා හිරුගේ සෙවනේ විඩා නිවා ඒ සුවයේ නැළවෙන්න නෙත් පියා සේද නිල්ලේ මල් යායේ ඇවිද යන්නයි හිත් මානේ ඔබය මාගේ රජ දහනේ කිරුල හිමි වූ මනමාලී ඔබය හීනය සන්තානේ වැතිර ඉන්නම් මේ හීනේ සිහින විමනේ සිහිලැල්ලේ ඉගිල යාදෙන් මැවු හීනේ මුහුදු වෙරළේ රළ වාගේ ඇවිත් කොදුරන් රන් ආලේ හමන නළ සේ හැන්දෑවේ තුරුළු වී ඉගිලෙමි ආයේ මීදුමෙන් වැසී කදුයාය සලිත වී…"},
{"title": "මගෙ සිහිනේ ඔබයි", "artist": "භාතිය සන්තුෂ්", "author": "Unknown", "lyrics": "මගෙ සිහිනේ ඔබයි මගෙ සිහිනේ ඔබයි තනි යහනේ නොවෙයි ආදරයේ හද උණුසුම ඔබයි ඔබෙ සෙනෙහේ මගෙයි ඔබෙ සෙනෙහේ මගෙයි තනි යහනේ නොවෙයි ආදරයේ ඔබ මුතුලැල් වටී මල් පැන් පොදක් කිනිත්තක් අගින් ඉසින්නා වගෙයි මට ඔබේ ආදරේ නෙළුමක් නෙළුමක් අරං ඔබගෙන් තවත් ලැබූ පෙම් වදන් ඉතිං ආදරෙයි නම් බෝමයි හැගුම් අහසක් අහසක් තරම්"},
{"title": "චාන්දනී පායලා", "artist": "භාතිය සන්තුෂ්", "author": "Unknown", "lyrics": "චාදනී පායලා සීත සැළුවා මේ රාත්‍රියේ ජීවිතේ අවපසයි මං තවම සීතල කළුවරේ මේ කුළු මතින් ඇදී ඔබ එන්න මා කේරේ ඔබ වේද මතුදාක මා ලබන රම්බරී චාදනී පායලා සීත සැළුවා මේ රාත්‍රියේ ජීවිතේ හිස්කමින් තුන් යාමයේ හිත් පෑරුනේ සත්තකින් ඔබය හද රැන්දු සුරඹුන් ඒ හැගුම් කොයි ලෙසින් සිත්සේ පවසම්ද සොදුරේ පෙම් හැගුම් මතකයේ රංචු ගැහුනා යටි හිතේ පොපියමින් හීන මැවුනා සන්සුන් සුසුම්ද කැළඹී ඇයිද මොකදැයි ඇහුවා රාගයේ චණ්ඩ හැගුමන් රණ්ඩු කෙරුවා මං කෙසේ කොයි ලෙසේ මුමුණම් මේ ශෝක ගීතේ කවුරුවත් දන්නෙනෑ දැන් මේ මං ඉන්න හිරගේ සෝතාප ගින්දරින් ඇවිලේවි ජීවිතේ රෑ සීත වරුසාව ඔබ වේද මාරුතේ යන්තමින් නුවනගින් කදුළු එබිලා දෙකොපුල් හෙමි හෙමින් සීත ගැලුවා දිවිගිම් නිවෙන්න පැතුවේ මධුර ස්වරයයි ඔබගේ ආදරේ හීනයක් දෝ හැබෑ නොවෙනා මං කෙසේ දැවි දැවී ඉන්නේ මේ වේදනාවෙන් ඇස් අගින් ඔබ ලියූ කවි ගී මුමුණන්න මුවගින් ඔය මන්දහාසයෙන් සැනසේවි ජීවිතේ සෝතාප සගවන්න ඔබ එන්න ආදරෙන්"},
{"title": "හිත වාවන්නේම නෑ", "artist": "භාතිය සන්තුෂ්", "author": "Unknown", "lyrics": "හිත වාවන්නේම නෑ, ඔබ අයෙත් එන්නෙ නෑ මම තාම දන්නෙ මා ඔබේ කියා හිරි කෝඩු මැදියම් රෑ, දුන් හීන එලිවෙන් නෑ ඔබ තාම දන්නෙ ඔබ මගේ කියා මම තාම දන්නෙ මා ඔබේ කියා සුසුමන් කියා නොදුන්නු, ජීවිතේ සුපෙම් කතාව කියා දුන්නෙ ඔබමයි ලදේ දෑසත් පියාන උන්නෙ, බැරිද තාම අවදිවෙන්න බලා ඉන්න බෑ මට තවත් සීතලෙන් මා වෙලී, දෙනුවන් පහන් නිවි ඔබ යන්නෙ ඇයි ආදරි හිත වාවන්නේම නෑ උකුලේ නිදාන උන්නු කාලෙ ආයෙ එන්නෙ නෑ නේ තනිවෙන්න බෑ මට ඉතින් කෙහෙරෙල්ලෙ ගෑවි ගෑවි සුවද සෙව්ව මා එදා ලන් වෙලා ඉන්න බෑ ඉතින් ආදරේ නෑ ඔයා, පාඩුවේ මා හෙලා ඔබ යන්නෙ ඇයි ආදරී හිත වාවන්නේ නෑ"},
{"title": "කවිකාරියේ", "artist": "භාතිය සන්තුෂ්", "author": "Unknown", "lyrics": "උණුහුම විඳ විඳ සියො ලඟ දැනුනේ මායා සත්තයි ලඳුනේ ආවේ සඳවත පායා සරාගී නුවන් චායා හදේ දැල්විලා මා ඔබයි මාගේ පෙම් වස්සානේ කවිකාරියේ (කවිකාරියේ) මට හාදු දී (මට හාදු දී) ඔබෙ දෑස මානේ හීන වස්සානේ මායම් කථා (මායම් කථා) මුළු රෑම වෑහී (මුළු රෑම වෑහී) ඔබෙ කෝල දෑසේ පැටලි මා ඉන්නේ අපෙ ආදරේ දැන් කවි පෙළක් වාගේ අපෙ ආදරේ දැන් කවි පෙළක් උණුහුම විඳ විඳ දෙතොලේ හැඟුමන් පාලා දෑඟිලි දිව්වේ කොපුලේ රුඟුමක් දීලා නුරාගී බැලුම් සේයා දසුන් මත් කළා මා ඇවිත් නේද පෙම් වස්සානේ කවිකාරිය"},
{"title": "චාදනී පායලා", "artist": "භාතිය සන්තුෂ්", "author": "Unknown", "lyrics": "චාදනී පායලා සීත සැළුවා මේ රාත්‍රියේ ජීවිතේ අවපසයි මං තවම සීතල කළුවරේ මේ කුළු මතින් ඇදී ඔබ එන්න මා කේරේ ඔබ වේද මතුදාක මා ලබන රම්බරී චාදනී පායලා සීත සැළුවා මේ රාත්‍රියේ ජීවිතේ හිස්කමින් තුන් යාමයේ හිත් පෑරුනේ සත්තකින් ඔබය හද රැන්දු සුරඹුන් ඒ හැගුම් කොයි ලෙසින් සිත්සේ පවසම්ද සොදුරේ පෙම් හැගුම් මතකයේ රංචු ගැහුනා යටි හිතේ පොපියමින් හීන මැවුනා සන්සුන් සුසුම්ද කැළඹී ඇයිද මොකදැයි ඇහුවා රාගයේ චණ්ඩ හැගුමන් රණ්ඩු කෙරුවා මං කෙසේ කොයි ලෙසේ මුමුණම් මේ ශෝක ගීතේ කවුරුවත් දන්නෙනෑ දැන් මේ මං ඉන්න හිරගේ සෝතාප ගින්දරින් ඇවිලේවි ජීවිතේ රෑ සීත වරුසාව ඔබ වේද මාරුතේ යන්තමින් නුවනගින් කදුළු එබිලා දෙකොපුල් හෙමි හෙමින් සීත ගැලුවා දිවිගිම් නිවෙන්න පැතුවේ මධුර ස්වරයයි ඔබගේ ආදරේ හීනයක් දෝ හැබෑ නොවෙනා මං කෙසේ දැවි දැවී ඉන්නේ මේ වේදනාවෙන් ඇස් අගින් ඔබ ලියූ කවි ගී මුමුණන්න මුවගින් ඔය මන්දහාසයෙන් සැනසේවි ජීවිතේ සෝතාප සගවන්න ඔබ එන්න ආදරෙන්"},
{"title": "කොහේ යන්නෙද", "artist": "බණ්ඩාර අතාවුද", "author": "Unknown", "lyrics": "කොහේ යන්නෙද කොහේ ඉන්නෙද ඔබත් ඇසුවා මගෙන් මමත් ඇසුවා ඔබෙන් මං මුලාවී ජීවිතේ අපි ළංවෙලා ඉමු මේ ලෙසින් තවත් පෙම්වතියන්පෙම්වතුන් එනතුරා මේ මාවතේ ගමන් මග විමසා අපෙන් මේ ලෙසින් සසරේ පුරා අපි ළංවෙලා සිටියේ හදින් හෙටත් අද වාගේබලා හිදිමු සිත් සතන් නැති ලෝකයා පෙම් සුවේ දකිනාතුරා කොහේ යන්නෙද කොහේ ඉන්නෙද ඔබත් ඇසුවා මගෙන් මමත් ඇසුවා ඔබෙන්"},
{"title": "අාශාවේ මල්", "artist": "බණ්ඩාර අතාවුද", "author": "Unknown", "lyrics": "අාශාවේ මල් වැටෙන් එබී නිලුපුල් දෑසින් මදෙස බැලූ නයන කළු නුඹ මගේ කළු නයන කළු නුඹ මගේ කළු රෑ නිල් අහසේ නිදන සදවතී රෑ නිල් අහසේ නිදන සදවතී අදින සළු මිදුලෙ එලූ අදින සළු මිදුලෙ එලූ සුන්දර නින්දේ මා සිහිවෙනවද කියනු කළු මට කියනු කළු අාශාවේ මල් පායන සඳ සේ රුසිරු හසරැලි පායන සඳ සේ රුසිරු හසරැලි දෙතොල වෙළු නයන කළු දෙතොල වෙළු නයන කළු සුන්දර මොහොතේ මා සිහිවෙනවද කියනු කළු මට කියනු කළු ආශාවේ මල්"},
{"title": "වෙන්වී දැන්", "artist": "චාමික සිරිමාන්න", "author": "Unknown", "lyrics": "වෙන්වී දැන් යන්න ඉතින් - වෙන්වී යන්නම ඕනේ නම් කීරිගැහී හඩන සුසුම් - ඉවසුම් නෑ මේ පපුවට දැන් මා වෙනුවෙන් මැවුව සෙනේ - රහසේම කාටද පුදා වෙන්වී දැන් යන්න ඉතින් - වෙන්වී යන්නම ඕනේනම් මගෙ සිහිනේ ඉඩඉල්ලා - පෙරදා ඔබමයි පියමැන්නේ පෙම් පහසේ වෙලී ඉදලා - කෙලෙසද අද මා හැර යන්නේ සෙනෙහසින් පෙර එදා - මගෙ වෙලා උන් ඔයා අද මෙසේ වෙන්වෙලා - මා දමා යයි ඔයා පෙම් සිහිනේ දුක රන්දා - ගියාට කම් නැ සතුට සොයා මගෙ සෙනෙහේ සිහිවේ නම් - කවදා හෝ යලි එන්න සොයා සෙනෙහසින් පෙර එදා - මගෙ වෙලා උන් ඔයා අද මෙසේ වෙන්වෙලා - මා දමා යයි ඔයා වෙන්වී දැන් යන්න ඉතින්"},
{"title": "හිත හදාගන්න බෑ", "artist": "චාමික සිරිමාන්න", "author": "Unknown", "lyrics": "හිත හදාගන්න බෑ - ඔබෙන් ලද දුක දරා ගන්න බෑ ඔබ මගේ වෙන්නෙ නෑ - ඉතින් යලි අපි අපේ වෙන්නෙ නෑ මා හැර හිතකට පෙම් කරලා - ආදරෙ හැර දමලා මා සදා හඩනවා - මාරුතේ දුක දරා හිත හදාගන්න බැ - ඔබෙන් ලද දුක දරා ගන්න බෑ ආදරය වී - ජීවිතය දී - මාගෙ ලග උන්නු වේලේ කීව හැම දේ  - තාම සිහිවේ - පාලුවුනු ලෝකෙ මාගේ හීන කදුලින් තෙමා - ඈත සැගවී ඔයා මාව අදුරේ හෙලා - දෑස ලඟ අද නෑ මාගේ මා සදා හඬනවා - මාරුතේ දුක දරා හීන වියැකී - දෑස නොපෙනී - කාටදෝ ඔබව හිමිවී මාව තනිවී - දෑස බොදවී - කාට පවසම්ද මේ දේ ජීවිතය පාවෙලා - ආදරය නෑ කියා මාව හැරදා සදා - ඈත යනවද මේ යාමේ මා සදා හඬනවා - මාරුතේ දුක දරා හිත හදාගන්න බෑ"},
{"title": "රෑ අහසේ (සැමදා ම‍ගේමයි)", "artist": "බිලී ෆර්නෑන්ඩෝ", "author": "Unknown", "lyrics": "සැමදා මගේමයි කීවේ ඔයාමයි ඔය දෑස අද ඇයි ඉවත බලා සිහිනේ සදාකල් සැදුවේ ඔයාමයි අද මම මෙහේ තනි වෙලා රෑ අහසේ සඳ පායන්නේ නෑ මේ අන්ධකා‍රේ මට පුරුදු නෑ ළඟ උන්නු කාලේ අමතක වෙන්නෙ නෑ ඔබ ළඟ නැති දා අඳුරේ ඉන්න බෑ ආදර වදන් වැල් ඔබ මට කියා දුන් පෙර සේම අදටත් ඇහෙනවා වෙන්වී ගියේ ඇයි සිහිනේ ඔයාමයි හිත මගේ හඬා වැටෙනවා රෑ අහසේ සඳ පායන්නේ නෑ මේ අන්ධකා‍රේ මට පුරුදු නෑ ළඟ උන්නු කාලේ අමතක වෙන්නෙ නෑ ඔබ ළඟ නැති දා අඳුරේ ඉන්න බෑ රෑ අහසේ තරු පායන්නේ නෑ මේ අන්ධකා‍රේ මට පුරුදු නෑ ළඟ උන්නු කාලේ අමතක වෙන්නෙ නෑ ඔබ ළඟ නැති දා අඳුරේ ඉන්න බෑ රෑ අහසේ සඳ පායන්නේ නෑ මේ අන්ධකා‍රේ මට පුරුදු නෑ ළඟ උන්නු කාලේ අමතක වෙන්නෙ නෑ ඔබ ළඟ නැති දා අඳුරේ ඉන්න බෑ"},
{"title": "සූරා පප්පා රැජිනට කේක් එක", "artist": "කාටූන් සින්දු", "author": "Unknown", "lyrics": "දෙන්නම් මම අද පප්පලට රැජිනට යවනව කේක් එක ලස්සන පාටට තියෙන්නට සායම් දානවා බේසමට (එකක් මදි දෙකක් දානවා) මී පැණි බෝතලයක් දාලා වයින් ටිකක් කලවම් කරලා පොඩි කජුමද ටිකකුත් තියලා ගම්මිරිසුත් යහමින් දාලා නෑ ආහ් නැද්ද? පාසානම් ටිකකුත් දාලා සීනි කිලෝ දහයක් දාලා නයි බිත්තර දෙකකුත් දාලා හදනවා පදමට හැදි ගාලා (එක්කො බිත්තර තුනක්ම දානවා) රැජිනට යවනවා කේක එක ලස්සන පාටට තියෙන්නට සායම් දානවා බේසමට"},
{"title": "ඔබ කැමති නම් මට කියන්න", "artist": "බිලී ෆර්නෑන්ඩෝ", "author": "Unknown", "lyrics": "ඔබ කැමති නම් මට කියන්න මගෙ දුක ටිකක් හරි නිමෙන්න ඔබ ඇයි ගියේ කියලා හදවත මගේ බිඳලා ඔබම තමයි පෙරදා මා වෙත ආවේ ඔබම තමයි ආදරේ ගැන මට කීවේ ඔබම තමයි මගෙ ජීවිතේ දිය කලේ ඔබම තමයි අද මගේ ලොව අඳුරු කලේ ලඟ ඉන්නම් සැමදා ඔබමයි කීවේ පෙම් ගී වැල් ගොතලා ඔබමයි ගැයුවේ මගෙ තුරුලේ උණුසුම ඔබමයි පැතුවේ අද යන්න ගියේ මට නොකියම ඇයි කෙල්ලේ"},
{"title": "සඳ හාදු දිදී", "artist": "චන්දන ලියනආරච්චි", "author": "Unknown", "lyrics": "සඳ හාදු දිදී වළාකුලට සේද යහනතේ නිල් තාරකා කුමාරියන්ගෙ ප්‍රේම විජිතයේ නුඹ තාම නිදිද නුඹ තාම නිදිද කඩුපුල් මල් දේවතාවියේ මල් මාලතී ලතා මඩුල්ල නෙතු පියා හිඳී මුදු මල් ගැබේ යහන් තුරුල්ල භෘංගයින්ට දී කට කොනින්වත් හිනා නොවීම දේවතා නිදී සඳ හාදු දිදී වළාකුලට සේද යහනතේ විල් තලේ රිදී රැල් නැගේවි රංගනේ යෙදී මුදු මන්දහාස දී පිපේවි සොඳුරු කෞමදී මට තනියි මගේ හිත පාළුයි නුඹ තවම නිදී සඳ හාදු දිදී වළාකුලට සේද යහනතේ"},
{"title": "පොල්රුප්පාවේ", "artist": "චන්දන ලියනආරච්චි", "author": "Unknown", "lyrics": "පොල්රුප්පාවේ දඟකල සෙල්ලම් ‍ සුළ‍‍ඟේ පාවී සිතට දැනේ පිටගම් යනදා එය සිහිවෙනවා හීන්සැරේ ඔබ මා අමතක කරදා මායාවක් දෝ බැදුණු සිතුම් ගිණිදැල් වේ හද සෙනෙහෙ පැතුම් රෑ රැහැයි හ‍‍ඬේ දුක් ගීත රාවයේ සවනේවැකුනේගොළුවූ හඬක් ලෙසින් මායාවක් දෝ බැදුණු සිතුම් ගිණිදැල්වේ හද සෙනෙහෙ පැතුම් ඈත ගුරු පාරේ පියමන් සලා යන්නේ කඳුලින්පිරිලාදෙනුවන් වැසී යාදෝ මායාවක් දෝ බැදුණු සිතුම් ගිණිදැල් වේ හද සෙනෙහෙ පැතුම් පොල්රුප්පාවේ"},
{"title": "පමා වැඩියි ඔබ පමා වැඩී", "artist": "චන්දන ලියනආරච්චි", "author": "Unknown", "lyrics": "පමා වැඩියි ඔබ පමා වැඩී මට මුණ ගැසුනේ ඔබ පසුවී පෙර හමුවීනම් ඇය නොපතා මා ඔබටම සිත පුදමීඔබටම සිත පුදමී ඔබ සිනාසිසී එන වසන්තෙකී ඇය මුලාවකී ගිම්හානයකී සිත නිරතුරු පසු තැවෙනා ඔබ සුවඳකි මන බඳිනා ඇය අමාවකේ රළු අහස මෙනී සොමි සදන නිතී ඔබ තාරපතී ඇය නියඟෙකි හිත දවන ඔබ නිල්මිණ සේ දිලෙනා"},
{"title": "නිල්වන ලන්දේ", "artist": "චන්දන ලියනආරච්චි", "author": "Unknown", "lyrics": "නිල්වන ලන්දේ වෙල් ඉපනැල්ලේ සුවඳ ආදරයේ මිලින වී සැඟවේ වස්සානය ආයෙත් එන්නෑ කවදාවත් අප හමුවෙනෑ මගේ කැලෑ මලේ තනි යහනේ නෙත නිදි නොයෙන්නා මල් පිපිලා සුවඳක් දැනෙන්නෑ කවියක්සේ සුළඟට ගියාදෝ වස්සානය ආයෙත් එන්නෑ කවදාවත් අප හමුවෙනෑ මගේ කැලෑ මලේ නිල්වන ලන්දේ තහනම් දෝ ප්‍රේමය නපුරු දෝ මං මුලාවී පිං මග පෙනෙන්නෑ කුරුල්ලනේ මගෙ දුක ඇසේදෝ වස්සානය ආයෙත් එන්නෑ කවදාවත් අප හමුවෙනෑ මගේ කැලෑ මලේ නිල්වන ලන්දේ"},
{"title": "මියයයිදෝ මන්දා", "artist": "චන්දන ලියනආරච්චි", "author": "Unknown", "lyrics": "මියයයිදෝ මන්දා ඔබට ආදරේ හින්දා හදවත දෙදරා ගියෝතින් නුඹ හැරදා සුරඟනක රුව මැවුනී හදවත කඩා වැටුනී ආදරේ දැණුනී උමතුවට හැරුනී මිය යයිදෝ මන්දා දින සති මාස ගෙවුනී ආදරේ දෝර ගැලුනී සැම මුවග රුඳුනී නුඹ නැතිව හැඬුනී මිය යයිදෝ මන්දා"},
{"title": "කවි සීපද ඇහෙන ඈත", "artist": "චන්දන ලියනආරච්චි", "author": "Unknown", "lyrics": "කවි සීපද ඇහෙන ඈත කුරහන් මල් පිපෙන රෑට සරා සඳ ‍පෙමාතුර ගී ගයාවි වළා පෙළ අඳුර ලඟ ඉකි බිදිවි මල් පිපුණට පාට පාට අසරණ වූ මගේ දෑස නිදි යහනට මල් සුවඳක් නොවේවි හිතේ දුකට නෙතු කඳුලැල් සැලේවි පහන් සිළෙන් නොදුටුව රුව ඇල දොළ ලඟ සිරියාවට හිරු කුමරුට අතවනන්න හදනවා එපා නගෝ තරහ වෙන්න හිතෙනවා අද රෑ වස්දඬු රාවය කියයි හිතේ ඇති ආලය තරු මල් සිපගෙන එන පෙම් සිහිනයේ නැළවීයන් සංකා හැර ප්‍රේමියේ කවි සීපද ඇහෙන ඈත කුරහන් මල් පිපෙන රෑට සරා සඳ ‍පෙමාතුර ගී ගයාවි වළා පෙළ අඳුර ලඟ ඉකි බිදිවි මල් පිපුණට පාට පාට අසරණ වූ මගේ දෑස නිදි යහනට මල් සුවඳක් නොවේවි හිතේ දුකට නෙතු කඳුලැල් සැලේවි"},
{"title": "හදවත ගැහෙනා", "artist": "විරාජ් පෙරේරා", "author": "Sathsara Kasun  Pathirana", "lyrics": "දෑසේ ඔය රුව මැවිලා නෑ ලඟ සැනසුම රැදිලා කාලය හෙමිහිට ගෙවිලා යයි තව අපි දුර ඇදිලා හදවත ගැහෙනාගැහෙනා මොහතක් පාසා මතකෙට එන්නේ ඔය ඇස් දෙකමයි සැමදා ජීවත් වෙන්නේ කොහොමද ඔබගෙන් මිදිලා මේ සංසාරේ ඔබ සතුටයි මට ඕනා රෑ අහසේ තරු නෑ දැන් හිනැහෙන්නේ ඔබ කොහෙදෝ මා හැරදා අද ඉන්නේ මගෙ ලෝකේ ඔබ පමණයි මට උන්නේ ඔබ ගියදා දුක විතරයි මට ලැබුණේ පාළුවේ තනිවෙලා මා ඉන්නවා ඔබ ලඟින් උන්නු කාලයේ දුන් ආදරේම ජීවිතේ වෙලා හදවත ගැහෙනා මා දන්නා කවුරුත් නැහැ ඔබ වාගේ දුක දන්නේ කවුරුද මගෙ ඇස්වාගේ සැනසෙන්නම් උන්නා නම් නෙතු මානේ මියැදෙන්නම් ලඟටම වී ඔය තුරුලේ පාළුවේ තනිවෙලා මා ඉන්නවා ඔබ ලඟින් උන්නු කාලයේ දුන් ආදරේම ජීවිතේ වෙලා හදවත ගැහෙනා"},
{"title": "එපා තවත් ඔබ", "artist": "වසන්තා  තිලකාංගනී", "author": "Bandula Nanayakarawasam", "lyrics": "එපා තවත් ඔබ මා රවටන්නට ඇගේ සෙවන මුදු මල් යහනාවක් නම් ඒ මල් යහනේ ඔබ සැතපෙනු මැනවී අඳුරු මතකයෙන් මට සමුදෙනු මැනවී තව මොහොතක් හෝ මේ පෙම් රංගනයේ නිලියක වනු පල නෑ ප්‍රේමය කිමදැයි ඔබෙන් උගත මුත් එහි මහරුත ඔබ තව වටහාගෙන නෑ එපා තවත් ඔබ මා මිරිඟු දිය සොයා මුවැත්තියක විලසේ තවදිව යනු රිසි නෑ අවසන් පෙම් කඳුලක් පුද දුන් පසු ඔබට පුදන්නට මා ලඟ සෙනෙහස නෑ එපා තවත් ඔබ මා"},
{"title": "දෛවයෝගයකින් නොවේදෝ", "artist": "වික්ටර් රත්නායක", "author": "Unknown", "lyrics": "දෛවයෝගයකින් නොවේදෝ හමුවුණේ අප හමු වුණේ දෛවයේ සරදම් ලබන්නට කිම මෙසේ අප හමුවුණේ ඇදුරුතුමියයි ප්‍රේමයේ ඔබ ඇදුරුතුමියයි යෞවනේ ශෝකයේ රුදු වේදනාවේ කඳුළු සයුරේ උල්පතයි දෛවයෝගයකින් නඳුන් උයනයි ස්නේහයේ ඔබ සඳුන් සිලිලයි ජීවිතේ සොම්නසේ ආනන්දයේ හසරැල් තරංගේ උල්පතයි දෛවයෝගයකින්"},
{"title": "පායනා ඉර පාන කාගේ", "artist": "උරේෂා රවිහාරි", "author": "Unknown", "lyrics": "පායනා ඉර පාන කාගේ පීදෙනා මල් යාය කාගේ හසරැලි මවෙත ගෙනා පායනා දස සේ ගලා ඒ වෑහෙනා නදියේ රැදි ඒ නෙත දිලි කදුළු දොවා සිත මදනල ඈත කදු සිප මෑත මා සොයනා මේ ගග දියරැලි වාගේ පිබිදේ සිතුවිලි මාගේ දිදුලනාතරු නෙලා වන තීරයේ සරා හිනැහෙමි සැනසෙමි සොයනෙමි ඔබ දිව රෑ සෝදුක නෑ හිත මානේ මේ ඉර රෑ හද මාගේ පියඹනාසිත සදා මගෙ හීනයේ වෙලා හිනැහෙමි සැනසෙමි සොයනෙමි ඔබ දිව රෑ පායනා ඉර"},
{"title": "වස්සානයට අත වනලා", "artist": "උමාරා  සිංහවංශ", "author": "S. Madhawa", "lyrics": "වස්සානයට අත වනලා ඉමු මග බලන් උද්‍යානයක කෙළවරට වී ඔබ ඈතින් ඉඳන් ඉන්නවද රත්තරන් මං ගාවින්ම උණුහුම නොදී හාදු දෙන වැස්සේ දේදුන්න අස්සේ අපි පාවෙමුද තුරුලටම වී ඔබේ ඇස් අස්සේ මං මාව දැක්කේ සංසාරයම මම නුඹගෙ වී තව ඈතින් ඉඳන් ඉන්නවද රත්තරන් සංසාරයම මෙය මට නොදී වස්සානයට අත වනලා වැට කඩුලු අස්සේ මල් පිපුණු බිස්සේ අපි හැංගෙමුද උණුහුමට වී සමනල්ලු පස්සේ දුව පැනපු කාලේ දැන් මට දෙන්න නුඹ මගේම වී ඇයි ඈතින් ඉඳන් ඔය තරම් රත්තරං මං ආවොත්ද නුඹ මට හිමි වස්සානයට අත වනලා ඉමු මග බලන් උද්‍යානයක කෙළවරට වී ඔබ ඈතින් ඉඳන් ඉන්නවද රත්තරන් මං ගාවින්ම උණුහුම නොදී වස්සානයට අත වනලා ඉමු මග බලන් උද්‍යානයක කෙළවරට වී ඔබ ඈතින් ඉඳන් ඉන්නෙ ඇයි රත්තරන් මං ගාවින්ම උණුහුම නොදී"},
{"title": "නිලට නිලේ නිල් කැටේට", "artist": "කසුන් කල්හාර සමග උරේෂා රවිහාරි", "author": "Unknown", "lyrics": "නිලට නිලේ නිල් කැටේට කඩා හැලෙන ජල කඳකට සීත සදන උල්පත ඔබය ඒ නිල් ජලකඳ මතුපිට අත්ලතබා හෙමි හෙමිහිට තාල නඟන රළ පෙල ඔබය නොසිදෙන පෙම් උල්පත ඔබය බිඳෙනා පෙම් රළ පෙල ඔබය රතට රතේ පිපී වැනෙන නෙළාගන්න කියා කියන පුදුම හිතෙන හිත් මල ඔබය ඒ හිත්මල සිඹ සනසන නටුමත කටු ඇති බව දැන සුවඳ විදින බඹරිදු ඔබය පුදුම හිතෙන සිත්මල ඔබය සුවඳ විදින බඹරිදු ඔබය ගිරා නිලට පැසී දිලෙන නෙලා ගන්න කියා කියන නුරා ගොයම් යායම ඔබය ඒ නව ගොයමේ කිමිදෙන ළය නියරේ නිති ඇවිදින සරා සුවඳ මදනල ඔබය නුරා ගොයම් යායම ඔබය සරා සුවඳ මදනල ඔබය නිලට නිලේ නිල් කැටේට"},
{"title": "නොදැක ඉන්න බැ", "artist": "උරේෂා රවිහාරි", "author": "Unknown", "lyrics": "නොදැක ඉන්න බැ තවමත් අපේ ආදරේ නොපතා ඉන්න බෑ තවනම් ඔබේ ජිවිතේ නොහඬ ඉන්න බෑ මොහොතක් ඔබ නැති ලොවේ නොනිද ඉන්න බෑ ඔය හදවතේ නොදැක ඉන්න බැ තවමත් අපේ ආදරේ හද පාමුලේ නැවතී ඔබේ මතකේ අපේ අදටත් මැවේ පෙර පෑ සිනා සේදි ගියා කඳුලක් නිසා මම දන්නවා පෙර මං බලා ඔබ ඇති කියා හැමදාම මා ඔබගේ තමා සතුටක් හිතේ නැතිවත් මගේ පැතුමක් ළයේ තවමත් තිබේ හැමදේ දමා පියාඹා ඔබේ තුරැළට වෙලා සතපා හොවා උකුලේ තියා සෙනෙහස දොවා නුදුරේම මා එනවා සොයා නොදැක ඉන්න බෑ"},
{"title": "ඉරට අඩියක් ඉහලින්", "artist": "නදීක ගුරුගේ සමග තුෂාර ගල්ලැස්සගේ", "author": "Thushara Gallessage", "lyrics": "ඉරට අඩියක් ඉහලින් හේමන්තය ඇවිදින් ඉර කඩාගෙන වැටිලා කඳුලු මත පාවෙනවා ඉරට අඩියක් ඉහලින් හේමන්තය ඇවිදින් ඉර කඩාගෙන වැටිලා කඳුලු මත පාවෙනවා වල්ගා තරුවක් කඩා වැටෙනවා මම නුඹේ කොපුල් මත පෙම දියකෙරුවා ප්‍රර්ථනා නෑ අහසට ඇස් පියන් ඉල්ලන්න ප්‍රර්ථනා නෑ අහසට ඇස් පියන් ඉල්ලන්න උඩු ගුවනට සරුංඟලයක් පා කෙරුවා සරුංඟලේ ලඟ මම තනි රැක්කා හේමන්තය ලඟ මම ඇඩුවා ඔබට දැනුනා ජීවන හුස්මක් ජීවන හුස්මක් ඉරට අඩියක් ඉහලින් හේමන්තය ඇවිදින් ඉර කඩාගෙන වැටිලා කඳුලු මත පාවෙනවා අපි අයෙත් අහසට ඉර ගිහින් දැම්මා කඳුලු ගින්දර කරලා හේමන්තයට ඉහලින් ඉර අයෙමත් තිබ්බා අපි අයෙමත් අහසට ඉර ගිහින් දැම්මා ඉර ගිහින් දැම්මා"},
{"title": "කඳුළු පිරිලා", "artist": "උදය ශ්‍රී වික්‍රමසිංහ", "author": "Unknown", "lyrics": "කඳුළු පිරිලා, දෙනෙත තෙමිලා, සිනිදු හිත පෑරිලා ඔබම සොයලා, රැයම ගෙවිලා, සිහින අවතැන්වෙලා හමුවන්න බෑ ඔයා සැඟවී මෙදා තනිවන්න බෑ මගේ හුස්මත් ඔයා රතුපාට වෙරළේ, පා පොඩි තියා පපුවේ තුරුල්ලේ, සෙනෙහස උරා හැබැහින්ද කිව්වේ, ඔබ මගේ තමා තාමත් අතීතේ, මා නැවතිලා කඳුළු පිරිලා, දෙනෙත තෙමිලා යළි නොඑන සෙනෙහේ, මග හමුවෙලා මට ගැයුව ගීතේ, ඔහු හා ගයා හිතකින්ද යන්නේ, ඔබ හිනැහිලා තාමත් අතීතේ, මා නැවතිලා කඳුළු පිරිලා, දෙනෙත තෙමිලා"},
{"title": "බිඳුනු අතීතය සිහිකරලා", "artist": "තුෂාර  සුභසිංහ", "author": "Kasun Premal", "lyrics": "බිඳුනු අතීතය සිහිකරලා කඳුළු පුරෝගෙන හඬන්නෙපා පමාවෙලා අපි හමුවීලා මා යලි පතන්නෙපා මට ද මා හිමි නැති හින්දා කඳුළු සලා ඉකිබිඳලා ඔය නිල් ඇස්දෙක රතුකරලා සිහිල සොයා අපි සමුගත්තා නොදැනිම දස වසරක් ගෙවිලා යලි එක තැන හමුවීලා මට නම් වෙන්න එපා මට ද මා හිමි නැති හින්දා බිඳුනු අතීතය සිහිකරලා සිහින පුරා ඔබ එනවා නින්දක් නෑ මුළු රැයගෙවිලා ආයෙත් එන්නට බෑ පියඹා ඇයට මගේ හිත දුන් හින්දා කඳුලට නැවතුම තියලා අමතක කරන්න මා මට ද මා හිමි නැති හින්දා බිඳුනු අතීතය සිහිකරලා"},
{"title": "සායම් කිරිල්ලී", "artist": "තීක්ෂණ අනුරාධ", "author": "Unknown", "lyrics": "සායම් කිරිල්ලී කොහේ ගිහින් දෝ මාදම් කැලෑවේ මුවා උනා දෝ මල් දම් බදින්නම් පෙම් ගී ගයන්නම් ආදරෙයි ආදරෙයි මං හුරතල් විදින්නම් තුරුළේ නිදන්නම් ආදරෙයි ආදරෙයි මං තරහා වෙලා කඳුළැල් සලා වරුවක් ගෙවීලා ගියා නොදනී ඔයා කොහිදැයි කියා මං සීතලේ තනි වෙලා මල් දම් බදින්නම් පෙම් ගී ගයන්නම් ආදරෙයි ආදරෙයි මං හුරතල් විදින්නම් තුරුළේ නිදන්නම් ආදරෙයි ආදරෙයි මං කෝලම් කළේ බොරුවක් කියා නොදනීද තරහා වෙලා හිනැහී බලා සනසන්න මා තව ඉන්න බෑ තනි වෙලා මල් දම් බදින්නම් පෙම් ගී ගයන්නම් ආදරෙයි ආදරෙයි මං හුරතල් විදින්නම් තුරුළේ නිදන්නම් ආදරෙයි ආදරෙයි මං"},
{"title": "ඔබ දන්නෙ නෑ", "artist": "තරිඳු මිතිල", "author": "Tharindu N Mithila", "lyrics": "කෙසේ කියන්නද මගෙ ආදරෙ කියාගන්න මට බෑනෙ, හදෙ වදන් හ නෙතේ කැළුම් මට කියාදෙවි ආදරේ, ඔබ දන්නෙ නෑ පෙරදා ඔබ හමුවු දිනේ සිත ආලයෙන් බැදුනේ, ඔබගෙ නෙතු දුටු විගසිනෙ මසිත බැදුනා සෙනේ, නොදකිනු බෑ මාගේ සිතේ විලාපයන් ඇසේ, ඔබ ඉන්නේ ඇයි මේ තරම් මගෙ හීනයන් අතරේ කෙසේ කියන්නද කොහේ කොතැන හිටියාත් ඉන්නෙ ඔබමයි මාගෙ දෑසේ, ඔබ ඉදිරියේ මා ගොළුයි හිමි නැති බව දනිමි සිත මගෙ නුඹට පෙම් කර‍යි, එතරම් මගේ සිත මුරන්ඩුයි ඔබ සෑමදා මගෙ, මතු භවයෙදී පවා, සැමදා රකින්නම් මා, හිදින්නකො ප්‍රියේ නොදකිනු බෑ මාගේ සිතේ විලාපයන් ඇසේ, ඔබ ඉන්නෙ ඇයි මේ තරම් මගෙ හීනයන් අතරේ කෙසේ කියන්නද"},
{"title": "මල් මල් වාරම්", "artist": "සුනිල්  ශාන්ත", "author": "Kalistas Jayasinghe", "lyrics": "මල් මල් වාරම් හරිමැ උදාරම් ගයවා ගයවා ගුවනේ ලංකා නම වෙනුයෙන් පුරසාරම් කියවා කියවා මෙදිනේ හෙළ මල් රඟ දී පිපී නටනවා තිසා වැවේ ඉවුරේ රතඹල රදලිය රජලිය වෙනවා සීගිරි ගිරි මැදුරේ සමනොල කන්දේ උඩවැඩියා මල සීතලයෙන් පිපිරේ මිහින්තලාවේ ගල මලින් පිරීලා සේදේ සිල් මිහිරේ මල් මල් වාරම් හරිමැ උදාරම් ගයවා ගයවා ගුවනේ ලංකා නම වෙනුයෙන් පුරසාරම් කියවා කියවා මෙදිනේ බඹරා බඹරී නුරා නුරාගය ඉබේ බිඳී යනවා මී මී පැණි පැණි වද වද රොද රොද ඉබේ බැඳී යනවා මුළු ලොව සත්නගෙ විඩා කඩා හැර කුසුමින් නැහැවෙනවා කවියෙන් ගීයෙන් විරිතින් තනුයෙන් අළුත්වැ පණ එනවා මල් මල් වාරම් හරිමැ උදාරම් ගයවා ගයවා ගුවනේ ලංකා නම වෙනුයෙන් පුරසාරම් කියවා කියවා මෙදිනේ හිරු රැස් නාමින් නෙළුම් පිපීලා පොකුණු හිනා වෙනවා මැයි ගස නන් සිරි පින් සිරි රුසිරින් මනමාලිය වෙනවා බඳු වද කිණිහිරි ඉද්ද සමන් මල් තරඟෙට පිබිදෙනවා මල් මල් මල් මල් දෙගොඩ තලා මල් ගඟක් ගලා එනවා මල් මල් වාරම් හරිමැ උදාරම් ගයවා ගයවා ගුවනේ ලංකා නම වෙනුයෙන් පුරසාරම් කියවා කියවා මෙදිනේ"},
{"title": "චන්ද්‍ර මණ්ඩලේ", "artist": "සුනිල් එදිරිසිංහ", "author": "Unknown", "lyrics": "චන්ද්‍ර මණ්ඩලේ සැතපුණ පුංචි සාවියේ මන්ද කියාපන් නොකියා හැංගිලා ගියේ පාන නිවුන සේ පාළුයි ලැයිම් කාමරේ මන්ද නුඹ ගියේ කියපන් පුංචි සාවියේ ලාබ රත්තරන් දිලිසෙන පාළු වීදියේ ගෑනු ළමයි පියාඹලා ඉස්සරත් ගියේ උන්ට සෙයිලමේ මඟතොට පාර වැරදුණේ අන්න ඒ නිසයි මට දුක රත්තරන් දුවේ මාල බැඳන් සුදු යකඩෙන් රෝස මල් වනේ මාල ගිරව් ගේ දොරකඩ සිංදු කිව් වෙලේ හීනෙනුත් හිතුනෙ නෑ මට මොකද කාරණේ පාර මතක නං තාමත් ගේ ලඟයි දුවේ"},
{"title": "චන්ද්‍ර මඬල", "artist": "සුනිල් එදිරිසිංහ", "author": "Kumaradhasa Saputhanthree", "lyrics": "චන්ද්‍ර මඬල බැද්ද වටින් මෝදු වෙලා කළු නැන්දගෙ දුව යන්ට ගියා බැල්ම හෙලා බැල්ම හෙලා පාළු පැලේ අඳුර පිරේ මගෙ පැලට වරෙන් හනික සෝඩි නගේ දුරුතු හඳේ සිහිල වගේ තනි හිතට මගේ පාළු දැනෙයි නගේ"},
{"title": "පොඩි දුවගේ සිනා වැලයි", "artist": "සෝමතිලක ජයමහ", "author": "Unknown", "lyrics": "පොඩි දුවගේ සිනා වැලයි පොඩි පුතුගේ කතා පෙලයි ප්‍රිය බිරිදගෙ සෙනේ විලයි මගේ නිවන මගේ පැල්පතයි කටු මැටි ගැ බිත්ති පුරා පළිඟු මැණික් එළිය දිලේ ගොම මැටි ගෑ ගෙබිම මගේ පියවිලි බුමුතුරු ව‍‍ගේ… පොඩි දුවගේ… ලබන නමුත් දුක් පීඩා කූඩු වුනොත් පුංචි පැලේ අඹුදරුවන් අතර තුරේ මට නිම්නැති සුවය දැනේ… පොඩි දුවගේ…"},
{"title": "සඳ මඩලට හිනැහෙන්නට", "artist": "සෝමතිලක ජයමහ", "author": "Unknown", "lyrics": "සඳ මඩලට හිනැහෙන්නට එපා කියන්න වසන්තයට යලි එන්නට එපා කියන්න මගේ පාළුව විදගන්නට මට ඉඩ දෙන්න ඔබ ඈතින් ඉන්න මතකෙට නෑවිත් ඉන්න ඔබ ඈතින් ඉන්න මතකෙට නෑවිත් ඉන්න ගං ඉවුරට මුමුණන්නට එපා කියන්න තරු යායට ඉඟිලන්නට එපා කියන්න මං කෙලෙසක ඒ විසිතුරු බලා හිදිම්ද ඔබ ඈතින් ඉන්න මතකෙට නෑවිත් ඉන්න ඔබ ඈතින් ඉන්න මතකෙට නෑවිත් ඉන්න සඳ මඩලට හිනැහෙන්නට මද පවනට දැවටෙන්නට එපා කියන්න මල් සුවඳට ලං වෙන්නට එපා කියන්න මං කෙලෙසක ඒ සිහිලැල් දරා හිදිම්ද ඔබ ඈතින් ඉන්න මතකෙට නෑවිත් ඉන්න ඔබ ඈතින් ඉන්න මතකෙට නෑවිත් ඉන්න සඳ මඩලට හිනැහෙන්නට"},
{"title": "ඔබ මලක් වෙලා", "artist": "සෝමතිලක ජයමහ", "author": "Unknown", "lyrics": "ඔබ මලක් වෙලා වන අරනේ පිපේවී මා සුළං රැලක් වී ඔබ පිස හමාවී… පුර සඳක් වෙලා ඔබ අහසේ දිලේවී මා ගඟක් වෙලා සඳ එළියේ ගලාවී… සුළඟ වෙසින් මා එන කල ඔබේ සුවඳ සෑහේ මට මල් මුව රද ඔබ සමඟයි මලේ සුවඳ මා අසලයි… ඔබ මලක් වෙලා… ගඟක් වෙලා මා යන කල ඔබේ එළිය සෑහේ මට පුර හද නිළඹර සමඟයි සඳේ එළිය මා අසලයි ඔබ මලක් වෙලා…"},
{"title": "නුග සෙවණක් සේ", "artist": "සෝමතිලක ජයමහ", "author": "Unknown", "lyrics": "නුග සෙවණක් සේ ඔබට සෙවණ සදන්නම් ළඳුනි මද පවනක් සේ ඔබට සිසිල සදන්නම් ළඳුනි… ගංගාවකි මා සුනිමල් පවසට ඉන් පැන් ලබන්න… මල් සුවඳකි මා වනකල් ඒ සුවඳින් සුවඳ වන්න නුග සෙවණක් සේ… සද පහනකි මා නිකැලැල් අඳුරට ඉන් එලිය ගන්න… ඔරුවක් වෙමි මම සැමකල් දිවි සයුරෙන් එතෙර වන්න නුග සෙවනක් සේ…"},
{"title": "නවදැලි හේනක", "artist": "සෝමතිලක ජයමහ", "author": "Unknown", "lyrics": "නවදැලි හේනක පෑව වැදිරි රුව ලෙස උවමින් දෙනුවන් රවටා මා පෙම් කල ජනපද කල්‍යාණිට හිමියනි මට කල නොහැක නිගා ‍සුරඟන රූසිරු දුටිමි හැදින්නෙමි සිත්ලෙස දෙනුවන් බවුන් නුරා මා හදුනන මගෙ හදගන් කලණිය මට නුදුරුයි සුරඟනට වඩා නවදැලි හේනක මා සිත සුවපත් කරලනු නොහැකිය සෝ ලතැවුල් දෙයි රැයද දිවා නෙත දුටු සුරගන රූසිරු කුමටද හද දුටු ජනපද කලණ නිසා නවදැලි හේනක"},
{"title": "මහ වරුසාවට පසුව නැගෙන සඳ", "artist": "සෝමතිලක ජයමහ", "author": "Unknown", "lyrics": "මහ වරුසාවට පසුව නැගෙන සඳ වෙනදාටත් වැඩියෙන් එළියයි නෝක්කාඩුවට පසුව ඔබේ වත ඒ එළියට වැඩියෙන් එළියයි… ඇලදොල පාමුල ගොළුවුන ගීයකි අප හදවත් බැඳි සොදුරු සෙනේ… අද නොදකින ඔබ හෙට දකිනා තුරු මඟ බලමින් මා සිත ලතැවේ… මහ වරුසාවට… ඔබ මට හමුවුන මල්බර මාවත වෙනදාටත් වැඩියෙන් සුවදයි… විටකදි නැගුනත් සැක බිය ශෝකය පිවිතුරු සෙනෙහස අද උතුරයි… මහ වරුසාවට…"},
{"title": "හැමදාමත් යාළුවේ", "artist": "සෝමතිලක ජයමහ", "author": "Unknown", "lyrics": "හැමදාමත් යාළුවේ මම ඉන්නෙමි පාළුවේ ම‍ගේ පාළු පැලට එන්න කවුරුත් නැ යාළුවේ… පිපි කු‍සුමෙහි රන් මුවරද නිති පිනවින් සේමා නිතිගෙ කිරණ වැද රඟදුන් පැණි සමනල සේනා සපැමින ඔබ වෙණ වැයූ මා අභියස ගී ගැයූ… හැමදාමත් යාළුවේ… සව්සිරි සැම මා අතහැර අද වෙනතක රැදිලා මින් මතු තනිකම තනියට මගෙ පැලතුල රැදිලා බිතු සිතුවම් රූ වැනි ඔබ කොතැන ද මිතු‍රනි… හැමදාමත් යාළුවේ…"},
{"title": "දස බිම්බර මාර සෙනග", "artist": "සෝමතිලක ජයමහ", "author": "Unknown", "lyrics": "දස බිම්බර මාර සෙනග තණ්හා රති රගා සමග පළවා හල වීතරාගි බුදුන් වඩිනවා හද වෙත බුදුන් වඩිනවා සංසාරේ තෙර දකින්න බලාපොරොත්තුවෙ ඔරුවෙන් ගමන් වැඩිය අන්ගීරස බුදුන් වඩිනවා හද වෙත බුදුන් වඩිනවා සවණක් බුදු රැස් විහිදා කරුණාවේ මුදු බැල්මෙන් මුළු දියතෙහි සිසිල මවා බුදුන් වඩිනවා හද වෙත බුදුන් වඩිනවා මෙත් ගඟුලේ සෙනෙහෙ ගඟේ බුදු ගුණ ගී තරඟ නැගේ සාදු සාදු සාදු සාදු බුදුන් වඩිනවා හද වෙත බුදුන් වඩිනවා දස බිම්බර මාර සෙනග තණ්හා රති රගා සමග පළවා හල වීතරාගි බුදුන් වඩිනවා හද වෙත බුදුන් වඩිනවා"},
{"title": "දමා යන්නට නොහැකි මිහිමත", "artist": "සෝමතිලක ජයමහ", "author": "Unknown", "lyrics": "දමා යන්නට නොහැකි මිහිමත එකම සම්පත ඔබම පමණයි මිදී ‍යන්නට නොහැකි මේ ලොව එකම බැඳුමද ඔබම පමණයි බැදී දුක සැප දෙකෙහි නිතියෙන් හදේ තනි නොතනියට වැඩ වුන් ලබැදි සිත් මල් පරව යනවිට පසක් වෙයි අනියත ලොවේ ජීවිතය යනු සිහිනයක් මය සසර මඟ දකිනා දමා යන්නට බැදුනු සෙනෙහස නොවන නිම් හිම් ඇතද පන නල සමඟ රැකෙමින් අපේ අත්වැල ලිහී ගිලිහෙන මොහොත එයි කවදාක හෝ යායුතුය ඒ ‍නියත නික්මන සියළු බැමි සිදිනා දමා යන්නට"},
{"title": "ආදරයේ උණුසුම ළඟ", "artist": "සෝමතිලක ජයමහ", "author": "Unknown", "lyrics": "ආදරයේ උණුසුම ළඟ දුක දැනෙන්නෙ නෑ දුක් කරදර නැති දවසට දුර පෙනෙන්නෙ නෑ ජීවිතයේ හැමදාමත් සැප රැඳෙන්නෙ නෑ සිනහවෙවී සිනහවෙවී කල් ගෙවන්න බෑ තොල් අග මදහස දල්වා ප්‍රාර්ථනා මල් පිබිදෙයි ලෝකය උඩු යටිකුරු වී ප්‍රාර්ථනාවන් වැළලෙයි සැමදා දුක සැමදා සැප නොමැති ලෝකයේ සිනහ නැගෙයි කඳුල නැගෙයි එයයි ජීවිතේ ආදරයේ උණුසුම ළඟ ‍දිවා රැයේ දකින සිහින පවන් සලා ගිමන් නිවයි සිහින ලොවම ගරා වැටී තැවුලෙන් හදවත් ඇවිලෙයි ගීත හඬින් සුසුම් හඬින් පිරුණු ලෝකයේ සිනහ නැගෙයි කඳුල නැගෙයි එයයි ජීවිතේ ආදරයේ උණුසුම ළඟ"},
{"title": "පිණි පොද වැටෙනා", "artist": "ශිහාන් මිහිරංග", "author": "Unknown", "lyrics": "පිණි පොද වැටෙනා අරුනැල්ලේ පිණි ඉහිරුනු නුඹෙ ඒ සුදු ගවුමේ මුතු කැට යට හිනැහුනු සුදු කෙල්ලේ මට දෙනවද නුඹෙ හිත සුදු මැණිකේ ආදරයෙන් පෑ සිනහා මා හිත යට තවමත් ඇත ඇඳිලා සෙනෙහස පවසාලා ළංවීලා මා තුරුලේ නැළවෙනවද මැණිකා රුහි කියා අමතා මා මෙසේ හිත් කොනේ තිබුනු ඒ ආදරේ තනිවන විට මා මගෙ ජීවිතේ නුඹ මගෙනම් තනියක් නෑ හදේ ළපටි දෙතොල් පොපියා මට නොකියා හීන්සැරේ සිපගන්නට හිතුනා හොරැහින් නොබලා මා දෙස බලලා තුරුල්වෙලා ඉඳපන්කෝ මැණිකා රුහි කියා අමතා මා මෙසේ හිත් කොනේ තිබුනු ඒ ආදරේ තනිවන විට මා මගෙ ජීවිතේ නුඹ මගෙනම් තනියක් නෑ හදේ"},
{"title": "පෙරදා මැවු සිනා", "artist": "ශිහාන් මිහිරංග", "author": "Unknown", "lyrics": "පෙරදා මැවු සිනා සැගවී කොහේ ගියදෝ ඔබ ලගින් උන්නු කාලේ සුන්දරයි ජීවිතේ…… මේ සීත පවනැල්ලේ සිත සීතලෙන් ගැහෙන්නේ මල් නොපිපෙනා වසන්තේ උනුසුම් හැගුම් සිරවී ඔබගේ සෙනේ මවෙතින් මිදී ලතවෙවි නම් මේ ජීවිතේ නොපිපෙන්න හිරු අයේ කිසිදා මෙසේ… පෙරදා මැවු සිනා සැගවී කොහේ ගියදෝ ඔබ ලගින් උන්නු කාලේ සුන්දරයි ජීවිතේ…… මේ නීල තරු ගොල්ලේ සඳ පාලුවෙන් සරන්නේ රෑ කලුවරේ ගිලෙන්නේ සිහිනෙ දසුන් බොද වී ඔබගේ රුවින් ස්වරයෙන් මිදී ගොලුවෙවි නම් මේ ආදරේ නොපිපෙන්න හිරු අයේ කිසිදා මෙසේ… පෙරදා මැවු සිනා සැගවී කොහේ ගියදෝ ඔබ ලගින් උන්නු කාලේ සුන්දරයි ජීවිතේ……"},
{"title": "මේ ඇස් දිහා බලන්", "artist": "ශිහාන් මිහිරංග", "author": "Unknown", "lyrics": "මේ ඇස් දිහා බලන් දැන්වත් කියන්න මගේ රත්තරන් ඔබ මගේද… ම ඔබේද… අපි අපේද කියලා… දැන්වත් කියන්න මගේ රත්තරන්… පැහැදු නුවන් දල්වා මා දෙසට පා කරලා හද ගැස්ම මග නවතා දෙහදක් ගොළුව උන්නා… ඔබේ සෙනෙහෙ මග රැදුනේ ඇයි සංසාරයේ… මේ බවයේ මා වෙනුවෙන් ඔබ මැවුවේ… දැන්වත් කියන්න මගේ රත්තරන්… කදුලැල් නෙතින් පලවා පැතුමන් සිතේ තනිකරවා සිල් ගත්ත සිත නවතා ඔබ දෑත වෙත ඇත පෑවා… ඔබේ සෙනෙහෙ මග රැදුනේ ඇයි සංසාරයේ… මේ බවයේ මා වෙනුවෙන් ඔබ මැවුවේ… දැන්වත් කියන්න මගේ රත්තරන්…"},
{"title": "මගේ වෙලා ළඟ උන්නු ඔයා", "artist": "ශිහාන් මිහිරංග", "author": "Sathsara Kasun  Pathirana", "lyrics": "මගේ වෙලා ලඟ උන්නු ඔයා මටත් හොරෙන් වෙනකෙකුගෙ වෙලා හිත අඬනවා තුන්යම නොනිදා මගෙ පන තාමත් ඔයා නිසා හුස්මෙ පවා ඉන්නෙ ඔයා නිතරම මට සිහිවෙනවා මැව්වෙ ඔයා මටම කියා හදවත තව පවසනවා සිතු පැතුමන් පොඩිකර දමලා යන්නට ගියාට ඈත්වෙලා හිතකින් ද මුළු ජීවිතේ මා ලඟම ඔබ සැනසුනේ පාළුවේ මා තනිවී ජීවිතේ විදවනවා වෙනසක් නෑ මගෙ ආදරේ ඔබෙ නමටයි මුළු ජීවිතේ හද ගැඹුරේ වේදනා ඇති මට විතරක් දුක උරුම ඇති බොරුවෙන් ද මගෙ ජීවිතේ ලං ලංව ඔබ රැවටුවේ පාළුවේ මා තනිවී ජීවිතේ විදවනවා වෙනසක් නෑ මගෙ ආදරේ ඔබෙ නමටයි මුළු ජීවිතේ මගේ වෙලා ලඟ…"},
{"title": "හතර කේන්දරේ", "artist": "ශිහාන් මිහිරංග", "author": "Unknown", "lyrics": "හතර කේන්දරේ පාලු කියලා නුඹ ළඟදී දැනුනේ නෑ මට නම් පාලූ ග්‍රහයෝ නතුවාලු නුඹගේ නිසි පරිදී මට නම් නෑ ඔබේ අඩු පාළු මේ දුරු ගමනේ මගෙ දෑතේ වෙලිලා භවයේ සැරිසරා එක්වෙලා පෙම් දිවි සටනේ නොයමී පැරදිලා මම නුඹ ගත්තෙමි දිවුරා දුර අහසේ තාරකා ඇයිදෝ නුඹව තනි කරලා මල් වැල් ගොතා ඔබේ දෙවුරේ හොවා රැක ගන්නේ මගේ ප්‍රාණයෙන් ග්‍රහදොස් මකා මා ප්‍රේමයේ දොවා නුඹ ඉන්නේ සදා මා ලඟින් හතර කේන්දරේ පාලුයි කියලා පින් පෙත් පුරණා සදනා ලෝකයක් දැක්කා නුඹගේ දෑසේ මා එක්වී ගෙවනා හැම මොහොතක් පාසා නුඹගේ තුරුලේ හිඳීමී මා"},
{"title": "ඇස ගැටෙනා", "artist": "ශිහාන් මිහිරංග", "author": "Unknown", "lyrics": "ඇස ගැටෙනා දස දහසක් නෙතු මත ඔබෙ දෑසම මා සෙවු තරම්… ඒ නෙතු කිසි දින මා සතු නොව බව දැන දැන මා පෙම් කෙරූ තරම්… ඔබ නොදනී මුලු ලොවම දනී… ඔබෙ දෑස් මතින් මා පැතු පැතුම් ඔබ නෙතු මගෙමයි පිරු පෙරුම් ඒ පැතු පැතුමන් ඒ පිරු පෙරුමන් කඳුලැල්ලක් වී ගැලු තරම් ඔබ නොදනී මුලු ලොවම දනී ඔය නෙතු දැහැනේ සම වැදී මෙමා ඔය නෙතු තුල මා සිතු සිතුම්… බොඳ වු සිතුවම් බිඳුනු හසරැල් සොවින් මා ඒ හෙලු සුසුම් ඔබ නොදනී මුලු ලොවම දනී…"},
{"title": "අද තනියෙන් මා", "artist": "ශිහාන් මිහිරංග", "author": "Unknown", "lyrics": "අද තනියෙන් මා හඬන්නේ නෑ මා මා දමා ඈ ගියා කියා මා දමා සිත දුක් දෙන් නෑ අද මට තනි නෑ ඔබ නෑ කියා මා ලඟින් මා සිතින් ඔබ ගියා කියා පලුව වී අද මගේ හඩවන් නෑ ජීවිතේ ඔබ දන්නෑ අද මා ඔබේ නමින් තනි වෙන්නෑ අද තනියෙන් මා සිත හැඟුමන් වේදනා මට නොකියා පවුනා ඔබ නෑතිදා මා ලඟින් මා සිතින් ඔබ ගියා කියා අද තනියෙන් මා තරු නෙතු කී ඒ කතා අද රහසේ සැඟවිලා ඔබ ගිය දා මා හඬවා මට නොකියා මා දමා"},
{"title": "ඒ සොඳුරු සමනල් වියේ", "artist": "ශිහාන් මිහිරංග", "author": "Unknown", "lyrics": "ඒ සොඳුරු සමනල් වියේ පිය නැගුව ඒ මාවතේ සුවඳයි ඔබේ ආදර හිනැහෙන්න සෙව්වන්දියේ කියන්න ඔබ  ඇයි  මා හැර යන්නේ මට දරන්න බෑ නුඹ ඇයි මා හඬවන්නේ ඔය නිල් නෙතු ඇයි අද මා දෙස නොබලන්නේ සුදු රෝස දවටා අද මනාලියක් වී ඔබ හරි ලස්සනයි මගෙ නෙතු ළග කිසිදා නොරැදුණු කඳුලක් අද ඔබ දැක මගේ හිත පාරයි හිනැහෙන්න සෙව්වන්දියේ කියන්න ඔබ  ඇයි  මා හැර යන්නේ මට දරන්න බෑ නුඹ ඇයි මා හඬවන්නේ ඔය නිල් නෙතු ඇයි අද මා දෙස නොබලන්නේ මළ හිරු බැස යන යාමේ සමුදෙන්නද ඔබ මේ සැරසෙන්නේ ඔබේ සෙනේ කිසිදා මා අත් හරිනා බව සිත නෑ පිළිගන්නේ හිනැහෙන්න සෙව්වන්දියේ ඒ සොඳුරු සමනල් වියේ"},
{"title": "ආනන්ද මේ රෑ", "artist": "හරූන්  ලන්ත්‍රා සමග සුජාතා අත්තනායක", "author": "Siril  Silawimala", "lyrics": "ආනන්ද මේ රෑ හරි හැඩයිනේ කවුද පාවෙන මලක් වගෙයිනේ ලෝකේ ඔයා සතු ලොකු වස්තුවක් වෙයි මමනෙ සුහදේ ඒ පෙම් කුමාරී ආනන්ද මේ රෑ හරි හැඩයිනේ මාගේ සෙනේහේ මල් පිපුණෙ අදනේ නෑනේ නිවෙන්නේ ආශාව මාගේ නගරේ සියල්ලෝ නිදියාවි සුවසේ ඒ මුත් සෙනේහේ නිදන්නෙ නැහැනේ නගරේ සියල්ලෝ නිදියාවි සුවසේ ඒ වාගේ ජීවිත බැඳේවි රහසේ ආනන්ද මේ රෑ හරී හැඩයිනේ කියන්න වාගේ අහන්න හැකි දේ කියාවි දෙනෙතින් ඔයාගෙ මිහිරේ ඔබෙ සිතුම පැතුමයි මා සිතුවෙ පැතුවේ ඔබ මාගෙ පිනටයි උපන්නෙ මෙලොවේ ආලෝකෙ නගරේ ආලේට අපගේ ආලෝකෙ දෙන්නේ සුබ මංගලම් වේ ආනන්ද මේ රෑ හරී හැඩයිනේ"},
{"title": "ඇයි මස්සිනේ පෙම් කලේ අපි එක මලට", "artist": "එඩ්වඩ් ජයකොඩි සමග සුනිල් එදිරිසිංහ", "author": "Unknown", "lyrics": "පලංචියේ ලී ඉරුවේ අපි එකට මල් පැන් පොදක් රහ බැලුවේ අපි ‍එකට එක වාඩියේ කල් ඇරියෙත් හිත හොදට ඇයි මස්සිනේ පෙම් කලේ අපි එක මලට විරසක වී රුපුන් ලෙස යුද වදින්නද කුළුදුල් පෙම මෙයයි ඉන් අත් ‍මිදෙන්නද පෙම්දම් නිසා මිතුදම් සිඳ දමන්නද හොදහිත නු‍ඹෙ තරම් ලොවකින් ලබන්නද පලංචියේ දොඩමලු කතා නැහැ අද වාඩිය හෙවනේ නිදිනැති රැය පුරා නුඹෙ සුසුමයි ඇසුනේ හොර රහසින්ම එක සුවඳක් පැතු පවනේ නුඹවත් නැතිවේද හෙට මට සකි සඳුනේ පලංචියේ"},
{"title": "අවපස අහසක", "artist": "සුනිල් එදිරිසිංහ", "author": "Unknown", "lyrics": "අවපස අහසක තරු ලකුණක් සේ අපමණ සයුරක තුරු දසුනක් සේ දිගු දිවි ගමනේඉම ඔබ රැඳුණේ මාවත අවහිර නිමවා දළ රළ පෙල සැතපෙනවා සැළමුතු සෙනෙහස මඳ පවනක් වී ගැඹරේ නිම මුමුණනවා අවපස අහසක දෝතක අසෙනිය ගවසා ඔබ පෙරමඟ හිනැහෙනවා විකසිත සිහිනේ සුබ කවියක් වී දෙනෙතේ සිත ලියැවෙනවා අවපස අහසක"},
{"title": "ඇසුවේද කවුරුන්", "artist": "සුනිල් එදිරිසිංහ", "author": "Unknown", "lyrics": "ඇසුවේද කවුරුන් හෝ ඔබෙන් හැඬුවේ ඇයිද ප්‍රේමේ නමින් විමසා නැතිද කිසිදා ඔබත් කඳුලින් තුරන් වූ ප්‍රේමයක් සතුටේ උපත කඳුලයි සදා හද වේදනා දෝතින් ගෙනා පවනේ සිසිල සුසුමයි සිතේ පෙම් ප්‍රාර්ථනා විඳදා ගෙනා ඇසුවේද කවුරුන් හෝ … පිපි මල් මතින් පියමං කලෝ දිනුවේද කවදා ප්‍රේමයෙන් විඳි වේදනා සතුටින් දරා පැරදී ගියේ කවුදෝ එයින් ඇසුවේද කවුරුන් හෝ …"},
{"title": "අනේ යාල් දේවී", "artist": "සුනිල් එදිරිසිංහ", "author": "Unknown", "lyrics": "අනේ යාල් දේවී නෑ ගමන් ගියේ නෑ බෝ කලෙකින් හිස පලඳනාවේ තිබුනා ලියලා කන්කසන්තුරේ කියලා අනේ යාල් දේවී පොර කුකුලන් රඟනා දෙමංසලේ අපි ආගිය මඟතොට වල් වැදිලා කටු පඳුරු වැටෙන් දුර ඈත ඉමේ මුතු පවුර ගිලී මුහුදටම ගිහින් අනේ යාල් දේවී කොට්ට කෙලෙංගුයි තල් හකුරුයි හරි මාත්තුවට ගෙන රස බලනා නුඹෙ සංගුව වදිනා තුරු ඉන්නේ අපි හැබෑවටම නෑගම් එනකම් අනේ යාල් දේවී"},
{"title": "අළුත් වැස්සක්", "artist": "සුනිල් එදිරිසිංහ", "author": "Unknown", "lyrics": "අළුත් වැස්සක් වහින්නට සැරසේ පුරුදු ආකාසේ දිගු කාලයක් නිහඬ වී සිටි නුඹ වාගේ අළුත් වැස්සක් වහින්නට සැරසේ අහස වැසි වසිනා නමුත් කවදාද ඒ වැහි වහින්නේ නොදනිම් නියං කල සැමදා නැතත් කවදාද නියඟය ගෙවෙන්නේ නොදනිම් දුකක් වින්දොත් සැපත් ලඟමයි දිය දහම ඒ විලසයි වළාකුළු අහසට ඇවිත් මොනවාද මේ හැටි කරන්නේ සරදම් ඇහේ තෙරපෙන දුක නිවා කවදාද වැහි බිඳු ගෙනෙන්නේ සැනසුම් දුකක් වින්දොත් සැපත් ලඟමයි දිය දහම ඒ විලසයි"},
{"title": "අහසයි ඔබ මට", "artist": "සුනිල් එදිරිසිංහ", "author": "Unknown", "lyrics": "අහසයි ඔබ මට නිම් හිම් නොපෙනෙන ඉණිමං බඳිනු බැරී පොළොවයි ඔබ මට තරුවක් විලසට රෑ කල පතිත වෙමි ගඟේ වතුර නෑ ඉහලට ගලා ගියේ අසිනි හඬින් නෑ කඳු බිම් සසල උනේ ගඟ කවදා හෝ මුව දොර හමු වෙනවා ලොව කැලඹුණු දා කඳු බිම් හැකිලෙනවා අහසයි ඔබ මට අනාත සයුරට වැහි දිය දෝත ඔබයි අගාධ අඳුරක දුල රන් සිළුව ඔබයි ඔබ මට ලඟ බව ඉඳුරා මම දනිමී ඔබ වට කහවනු පවුරට මහ දුරකී අහසයි ඔබ මට"},
{"title": "අහස පොළව", "artist": "සුනිල් එදිරිසිංහ", "author": "Unknown", "lyrics": "අහස පොළව වටපිටාව හරිම හිස්තැනක් ගහක් කොලක් දියක් නොමැති කාන්තාරයක් ඇදී එන්න ඒ මොහොතේ හඬා වැටෙන හද මඬලට ඔබයි මමයි ඉන්නා තැන කොහෙද තනිකමක් නැහැනෙ තනිකමක් කණක මිණක තරුවක රුව නොපෙණුනි ඔබ දකින තුරා ලොවක සිරිය නොදුටිමි මා ඔබෙ සෙනෙහස ලබන තුරා අහස පොළව විලක දොලක සුව නොලදිමි ඔබ මා හා රැඳෙන තුරා මලක සුවඳ ඇත මසිතේ ඔබ මා ලඟ සිටින තුරා අහස පොළව"},
{"title": "අද දීගෙක", "artist": "සුනිල් එදිරිසිංහ", "author": "Unknown", "lyrics": "අද දීගෙක ගිය නුඹ මට බුලත් අතක් දීලා යන්න පිටත් වූ මොහොතේ මගේ දෙපා වැඳලා එතෙක් සිනහවෙන් සිටි මා කොහෙදෝ තනි වීලා නෙතේ කඳුළු සිරකර ගෙන සිටියෙමි ඉවසාලා පුංචි නංගියේ, මගේ පුංචි නංගියේ මා සිටියත් ඉවසා ගෙන නෙතේ කඳුළු නොසලා අප දෙන්නා දිහා බලා උන් අම්මා දැකලා ඇගේ නෙතින් කඩා හැළුණු කඳුළු මතක් වීලා කවුරුත් නැති තැනකට වී හැඬුවෙමි තනි වීලා පුංචි නංගියේ, මගේ පුංචි නංගියේ අද දීගෙක"},
{"title": "පෙරදාක සුසුමක්", "artist": "තීක්ෂණ අනුරාධ", "author": "Unknown", "lyrics": "පෙරදාක සුසුමක් හිත රැදී සෙනෙහසින් පිදුවා මිහිරැති… සංසාර ගමනේ දුරඇතී… ගැඹුරුයිද ආදරේ මේ හැටි… ගැඹුරුයිද ආදරේ මේ හැටි… හුරුපුරුදු ජීවිතේ තව ඉගිලෙන්න හිතේනවානම් හෙවනැල්ලවී දිවියේ තුරුලේ රැදී… කුළුදුල්ම හීනයක් ඒ…මහමෙර වගේ උසනම් තවදන්නෙ නෑ නුබත් මගෙ ආදරේ තරම් පෙරදාක සුසුමක් හිත රැදී සෙනෙහසින් පිදුවා මිහිරැති… සංසාර ගමනේ දුරඇතී… ගැඹුරුයිද ආදරේ මේ හැටි… ගැඹුරුයිද ආදරේ මේ හැටි… තනිකඩ හිතේ නැවතිලා පෙම් අරඹුමේ වැහිඅරන් නොමැකෙන්න සේ සෙනෙහේ සිතුවම් ඇදී… දුර යනෙන ජීවිතේ දිගු හිමිකම නුබේ ලගනම් හිත පිරුනු ආදරේ උහුලන්න බැරි තරම්…… පෙරදාක සුසුමක් හිත රැදී සෙනෙහසින් පිදුවා මිහිරැති… සංසාර ගමනේ දුරඇතී… ගැඹුරුයිද ආදරේ මේ හැටි… ගැඹුරුයිද ආදරේ මේ හැටි…"},
{"title": "ඔබ තරම් පෙම් කල කිසිවෙක්", "artist": "තීක්ෂණ අනුරාධ", "author": "Unknown", "lyrics": "ඔබ තරම් පෙම් කල කිසිවෙක් නැති තරම් මේ ලෝකයෙ කොහෙවත් ඔබට මං ආදරෙ බව මෙතරම් වැටහුනේ ඔබ වෙන්වි ගිය දා ඔය නෙතු හැඬ වූ තරම් ඔබ පෙම් කෙරූ තරම් අදහන්නත් බෑ කොහෙ තිබුණාදැයි මේ තරම් ආදරේ… රැය පුරා ඉකිගසා රතට හැරී දෙනුවන් පුර මල් සිනා මැවෙනවා ගිලන්වී හද පාරලා ආයෙත් ඔබ මට හිමිවෙයි නම් ආත්මයෙන් ඔබ අදහන්නම් තවකෙකු හට හිත දී ඇත්නම් සුභ පතලා ඈතට වෙන්නම් තනිවෙලා මා ලොවේ හිරු නොනගිනා මේ වසන්තේ දිවිතුරා විඳවමි අහිමි කරන් මගෙ ආදරේ ආයෙත් ඔබ මට හිමිවෙයි නම් ආත්මයෙන් ඔබ අදහන්නම් තවකෙකු හට හිත දී ඇත්නම් සුභ පතලා ඈතට වෙන්නම්"},
{"title": "ආයෙත් හඬන්න", "artist": "තීක්ෂණ අනුරාධ", "author": "Unknown", "lyrics": "ආයෙත් හඬන්න, කඳුලක් උනන්න, ඇයි අපි මේ හමුවන්නේ හිමි නැති ඔයාව, හිත යට තියාන, දුක් විදලයි හිත හැදුනේ ඔබ හිනැහෙන්න ඔබෙ රජ දහනේ, මං තාමත් මගේ තනි හීනේ දුප්පත් කමට නෑ හිමි ප්‍රේමේ, ඒකයි මං ඔබෙන් වෙන් වෙන්නේ ආඩම්බර රුව දැකලා, සිත ආයෙත් උමතු වෙලා සඟවන්නට බැහැ කිසිදා, පුංචි පෙම්පත් කතා අපේම ලොවේදි, අපි මුනගැසේවි, සිතමින් පෙම්කරලා ඔබ දුර ඇදේවි, මං ඉකිබිදීවි, අපි ඈතයි සැමදා ආයෙත් හඬන්න සදාතනික පෙම පතලා, තනිකඩ සිත මුලාවෙලා ඇති නැති දුර දුරක තියා, සත්තමයි පෙම් කලා අපේම ලොවේදි, අපි මුනගැසේවි, සිතමින් පෙම්කරලා ඔබ දුර ඇදේවි, මං ඉකිබිදීවි, අපි ඈතයි සැමදා ආයෙත් හඬන්න"},
{"title": "සිතිජේ මායිමේ", "artist": "උදිත අනුපම  අල්විස්", "author": "Aruna Kithsiri", "lyrics": "සිතිජේ මායිමේ සිනාසී ආවද ප්‍රියාවී ආදරෙ කියාදී මා මගේ වූ දිනේමාගෙ වේ ආවදෝ ඈ සදා වේවිදෝමගේ මානුඹෙවේසද පාන යාවී මැකී ඝන රෑම ඒවී යලීඅප සැමදා වේඅපේ තුරු හිසේරෑන් ගී ගයනාකුරුල්ලෝඈත මෑත ඇදී රගනවාප්‍රේමගී ගයලාහිදිමිමා සැමදා තුටුවී ඈමාගෙ වෙවිදමේ යාමේ මා ඈගෙ වේවි සදාකාලේ… මා සිතේආදරේ සිහිනේ නිමවුනා ඈමගේවෙලාලියැවුනාප්‍රේමගීලයෙහි ගයමි මාසැමදාඒගී ඈ මාගෙ ජීවෙ සදා කලේ මාඈගෙ වේවිමෙදා වාගේ"},
{"title": "දූ හිඳින්නේ පෝරුවේ", "artist": "උරේෂා රවිහාරි", "author": "Unknown", "lyrics": "දූ හිඳින්නේ පෝරුවේ පියාණනේ ඔබේ සුභ දිනේ පියා නැතේ ඔබ කොහේ ගියා කියා දන්නේ නෑ දූ ඔබේ හඬයි තැවෙයි මෙසේ ජීවිතේම මං පරාද වූ ලෙසින් සිතේ මට පිය සෙනේ නැතේ දූ කියාලා සනසවන්න රත්තරන් වදන් නැතේ මගේ ලොවේ රත්තරන් පියාණනේ පෝරුවේහී ඇසෙනවා සිනෝ ගී වේදනාව ගයනවා වියෝ ගී තාත්තාගේ සුවඳ අද කොහේදෝ පව් කලාද මේ තරම් ඔබේ දූ දූ හිඳින්නේ මෑණියන්ට වඳින සුභ වෙලාවේ තාත්තාට හදවතින් වඳින්නේ අවාසනාවන්ත දූ හඬන්නේ කව්ද දූට අවසරයි කියන්නේ දූ හිඳින්නේ"},
{"title": "ආලකමන්දා", "artist": "සුරේන්ද්‍ර  පෙරේරා සමග උරේෂා රවිහාරි", "author": "Unknown", "lyrics": "ආලකමන්දා මාලක පන්නා මෝහන දෑසින් පාලා නුරා පා නුරා පාලා නුරා පා නුරා මා කැඳවනවද සුරතලියේ දහසක් නොනිදා සිටියත් මුර ලා සැඟවී එනවද කාටත් හොරා හොරා කාටත් හොරා හොරා මා හා යන්නට හඳ පානේ ඇසුවෙම් වරුණා දැකුමට ආවා බෝ දුර ගෙවා දුර ගෙවා බෝ දුර ගෙවා දුර ගෙවා කෝ මට මොනවද දෙන්නේ ඇසු දුටු පමණට සිහි මොළ සිඳුණද සීගිරි පුරේ ගිරි පුරේ සීගිරි පුරේ ගිරි පුරේ ලියවිලි බිය හඳුණන්නේ ආලකමන්දා මාලක පන්නා මෝහන දෑසින් පාලා නුරා පා නුරා පාලා නුරා පා නුරා මා කැඳවනවද සුරතලියේ මින් පෙර නොදුටුව නූතන නගරෙට හා හා පුරා හා පුරා හා හා පුරා හා පුරා කැන්දන් යන්නම් ළඳුණේ පබ නොබඳිනු මැන අහසට මාළිග මා නම් නොවේ මා නොවේ මා නම් නොවේ මා නොවේ නිරිඳුට පිටුපා යන්නේ ආලකමන්දා මාලක පන්නා මෝහන දෑසින් පාලා නුරා පා නුරා පාලා නුරා පා නුරා මා කැඳවනවද සුරතලියේ දහසක් නොනිදා සිටියත් මුර ලා සැඟවී එනවද කාටත් හොරා හොරා කාටත් හොරා හොරා මා හා යන්නට හඳ පානේ"},
{"title": "අරුණළු පැතිරෙන", "artist": "වික්ටර් රත්නායක", "author": "Unknown", "lyrics": "අරුණළු පැතිරෙන‍ හිමිදිරි යාමේ සිතුවිලි පව්වේ පෙරදිග අහසේ හිමියනි මම බුදුරැස් දැක ගත්තෙමි හිමියනි මම බුදුරැස් දැක ගත්තෙමි කළුවර ගොමුකොට ගිමන් දවන මඟ ගමන් කලෙමි දුර සසර පුරා පස්කම් සම්පත් එක්තැන් කරගෙන ගමන්කලෙමි දුර සසර පුරා අරුණළු පැතිරෙන මහ කරුණාවේ සිහිල ගලා එන බුදු හිමියනි ඔබේ නෙත් දහරේ නැහැවෙමි සසරෙහි කෙලෙස් මුදා හැර බුදු හිමියනි ඔබේ නෙත් දහරේ අරුණළු පැතිරෙන"},
{"title": "අපි ඈතට ඈතට", "artist": "වික්ටර් රත්නායක", "author": "Unknown", "lyrics": "අපි ඈතට ඈතට පා නගලා ඝන වනන්තරේ අතරමං වෙමු වසන්ත මල් ගොමුවේ කාත් කවුරුවත් නෑ එන්නේ ඉඳුල් නොවේ රුදු මිනිස් ඇසින් අපේම පුංචි ලෝකයේ අපි ඉන්නේ බඹරුන් විතරයි තනියට ළඟ ඉන්නේ අපි ඈතට කෙසේද අත් බැඳ ඇවිදින්නේ වෙරළේ උයනේ තුරුළු වෙමින් නෑසිය මිතුරන් මඟතොට හමුවන්නේ උකුසු ඇසින් අප කෙලෙසද ගැලවෙන්නේ අපි ඈතට"},
{"title": "අපෙ හැඟුම්වලට ඉඩදී", "artist": "වික්ටර් රත්නායක", "author": "Unknown", "lyrics": "අපෙ හැඟුම්වලට ඉඩදී මොහොතක්, ඉඩ ලබා ගනිමු තරමින් වියතක්, හඳපානේ මද අඳුරේ අත් පටලා යමු ආයේ ඔබ ඔබෙ හෙවනැල්ලෙන් මිදී මම මගෙ හෙවනැල්ලෙන් මිදී අවුදින් හෙමින් රහසින් මුමුණා හඳපානේ මද අඳුරේ හඳපානේ මද අඳුරේ අත් පටලා යමු ආයේ හිරකර හසරැල්ලෙන් හැඬුම් අපි හිනැහෙමු සපුරා පැතුම් මතු ආත්මයේ හමුවන පැතුමින්, යමු වෙන්වී හිමිදිරියේ හඳපානේ මද අඳුරේ අත් පටලා යමු ආයේ"},
{"title": "අම්මා නැති මට", "artist": "වික්ටර් රත්නායක", "author": "Unknown", "lyrics": "අම්මා නැති මට කිරි අම්මා වී කළු‍වර ගෙදරට මිණි පහනක් වී දැනගත් දා සිට පෙරුම් පිරු‍වේ අක්කේ මං මතු සක්විති වෙයි සිතලා ලූ පිරුණු රටාවට පැදුරක් පිරී වැ‍ඩේ ඊට ලිප ලග කඩයප්පන් ගොඩවේ දෙකම්මුලින් වට මුතු වට්ටිය නුඹගේ පදමට දී මට නැණනෙත් පෑදූවේ අම්මා නැති මට මෝරා හද ගැබ පෙම්මල් නෑ පිපුනේ ලීලා බද වට ගෝමර ලතැවෙන්නේ බාල යොවුන් හද වැහැරී ගේ ඇතු‍ලේ මා ලද ශිල්ප නූඹ හා එක මුල්ලේ අම්මා නැති මට"},
{"title": "අමා දහර දිය", "artist": "වික්ටර් රත්නායක", "author": "Unknown", "lyrics": "අමා දහර දිය ගලා ගලා තුරු ලතා තුළින් මල් පියලි සලා සිය හඬින් ලොවට සිහ නද පතුරා ලෝ සත අතරින් ජනිත වුණා සැපෙහි කිමිදී දුකෙහි ගැලීලා මැදුම් පිළිවෙතින් අමා සුව ලබා දහම් සුවඳ මල් දසතම පතුරා සියල්ල කෙලෙස් මැඩ බුදුවූවා අමා දහර ජීවිතයේ ඇති නොනිමි අතිර බව ලොවට පැතිරූ කරුණාවේ දම ගැන සියළු සතුන් සදහම් රස වේ කරුණාබර නෙත නිවී ගියා"},
{"title": "අහිමි උනත් නුඹ ලදේ", "artist": "වික්ටර් රත්නායක", "author": "Unknown", "lyrics": "අහිමි උනත් නුඹ ලදේ …මට හඩන්න අවසර නෑ… විලෙන් එහා ඉද නුබේ සුවද වත එතී ආ සුලං මගෙ මුව සිම්බා නොපැතූ අතකට අතදුන් දවසේ හෙලු දුක් සුසුම් මගෙ මුව සිම්බා අහිමි උනත් … නුබ කැනදන් ගිය මංගල රිය නැගි දූලි වලාවන් මගෙ මුව සිම්බා… අහිමි උනත් කියාගන්න බැරි දුකක් නිමන්නට නෙත හෙලු කදුලක් මගෙ මුව සිම්බා අහිමි උනත්…"},
{"title": "අඳුර බිඳින්නට", "artist": "වික්ටර් රත්නායක", "author": "Unknown", "lyrics": "අඳුර බිඳින්නට රැයක් දවාලු ලන්තෑරුම් නිවලා තිමිරයෙ තිරකඩ අරුණෙහි බිඳහැර හිරු තව දවසක් ගෙනැවිල්ලා මතකය නම් වූ මළ පොත පෙරලා මළගිය ඊයේ සිහිපත් කළ මැන පැතූ පැතුම් අත් මිට මොලවා ගත් දෑතෙහි දසැඟිලි දිගහැරලුව මැන එහි මොනවද ඇත්තේ කිසිත් නැත හිස් බව කිව ඇත්තේ සමුදුර ගිරිහෙල් දෙරණ තලා මැද යෞවන විය පියවර තබනා සඳ හිස්වන හදවත සපුරා ලන්නට මියැසි විරාමය යළි පැමිණි ඇත අරුමෙකි පැවසෙන්නේ එපමණකි පිළිසරණය වන්නේ"},
{"title": "අඩවන් දෑසින්", "artist": "වික්ටර් රත්නායක", "author": "Unknown", "lyrics": "අඩවන් දෑසින් පවසනු රහසින් ජීවිතයේ රස මේ යැයි විගසින් පමා වෙවී ඉඳිනට නැත වේලා කාලය ඉගිලී යයි ඉගිලී යයි සුපුල් දෙතොල් රතු පැහැයෙන් තවරා මීවිත උතුරා යයි උතුරා යයි අඩවන් දෑසින් අවුල් දුහුල් වල සිහිල් පහස වැද නංවන රංගන නොනවත්වනු මැන ඒ ගී හඩ මුලු ජීවිතයම සතු රස බර සුළු මොහොතයි සුළු මොහොතයි රෑ සිහිනෙන් දිව ගා සැපතක් සේ හෙට දින එය මිය යයි මිය යයි අඩවන් දෑසින්"},
{"title": "ආදරයේ උල්පත වූ අම්මා..", "artist": "වික්ටර් රත්නායක", "author": "Unknown", "lyrics": "ආදරයේ උල්පත වූ අම්මා මා ඔබගේ පුතු වූ ඔබ මතු බුදුවන දවසේ මා රාහුල කුමරුන් සේ සෙවණ පතා අද මෙන් පැමිණෙන්නෙමි, සුළඟිල්ලේ එල්ලී සඳ දියකොට කිරි වතුරෙන්, ඒ දියරෙන් මුව දෝවා දිව මතුරක් වන් නැළැවිලි ගීයක, මතකයි මා නැළැවූවා ජීවිතයෙන් ජීවිතයක් ගෙනදී ඒ ජීවිතයට දිරි දී පණ දී මා දැඩි කල අම්මා තුරුලට ගෙන අත් පා හැඩ ගස්වා, නිදි ගන්වා යහන් ගැබේ සිහිනෙන් ගෑ මුදු සුවඳක් මෙන්, සිහිවෙයි ඒ කිරි සුවඳ ඔබේ දවසින් දවසට සෙනෙහස ලබැඳී ගෙනදී දිවියට නව පණ ලැබදී මා දැඩිකල අම්මා"},
{"title": "උපන් බිමට කිසිදා", "artist": "විජය  කුමාරතුංග සමග මාලනී  බුලත්සිංහල", "author": "Unknown", "lyrics": "උපන් බිමට කිසිදා ගරහන්න එපා උපන් බිමට කිසිදා ගරහන්න එපා දෙමාපියන් අමතක කරලන්න එපා සෙවන දුන් ගසේ අතු සිඳ ලන්න එපා ගස සිඳුවා හිස සිඳුවා ගන්න එපා වැදූ මවයි මිහිකතයි සමයි සිතාපන්නේ පියා නුඹේ නුඹ රටයි කියා සිතාපන්නේ ඉරේ සඳේ ගහ කොලේ උදාර වූ මහ කැලේ මිනිස් අපේ උපතේ මුලයි සිතාපන්නේ උපන් බිමට අහස් කුසට වැඩෙනා ගසක් බලාපන්නේ මවක් ලෙසට කරුණා ගුණය පතුරුවන්නේ පොරෝ තලේ ටැක්ටරේ යොමා බිම හෙලන්නේ මවක් ලෙසන් සැලකූ ගසයි සිතාපන්නේ උපන් බිමට"},
{"title": "ආදරයක හැඟුමක් සිතෙහි", "artist": "විජය  කුමාරතුංග සමග මාලනී  බුලත්සිංහල", "author": "Unknown", "lyrics": "ආදරයක හැඟුමක් සිතෙහි නොතිබුණු කාලෙක පෙර දිනෙහි මා හට ඔබ හමුවුණු විටදී මතකයි හද කිතිකැවුණු හැටි දෙමාපියන් සොහොයුරන් වෙතේ හද පිදි ආදරෙ ඉමක් නැති එහෙත් ඔයා මගෙ අනාගතේ මිහිර ගෙනේවිය හැඟුම් හිතේ ආදරයක හැඟුමක් සිතෙහි නොතිබුණු කාලෙක පෙර දිනෙහි මා හට ඔබ හමුවුණු විටදී මතකයි හද කිතිකැවුණු හැටි මදහස පා හිනැහෙන විටදී සුමුදු වදන් පවසන විටදී මා හද තුල මින් පෙර නොරැඳී ආදරයක හැඟුමක් උපදී ආදරයක හැඟුමක් සිතෙහි නොතිබුණු කාලෙක පෙර දිනෙහි මා හට ඔබ හමුවුණු විටදී මතකයි හද කිතිකැවුණු හැටි"},
{"title": "මතකයන්", "artist": "සෙනුරි  සමග ජීවන්ත හේවාබන්දු", "author": "Jeewantha Hewabandu", "lyrics": "කුමරාණනේ බිඳුවක් නැවතී අසන්න මතකයන් අමතකදෝ කියන්න මා සිහිනයේ තටු නැතේ පියඹන්ටා දෙතනක දැවී අප ලොවේ බැමි බිඳිලා සිත්මායිමේ සිතුවිලී විසිරෙන්නා මීවිත පුරා මඳු බඳුන් තොල ගාලා මාඒ අපේ ආදරේ සීතෙන්ම මිදිලා ඔහේ යාවී සුසුමන් පාවීලා ජීවිතේ දුක් විඳීදෝ ඔබ නැති නම් මේ සසරේ ආදරේ සිහිනයක්දෝ මට නම් මේ භවයේ මා සිහිනයේ තටු නැතේ පියඹන්ටා දෙතනක දැවී අප ලොවේ බැමි බිඳිලා සිත්මායිමේ සිතුවිලී විසිරෙන්නා මීවිත පුරා මඳු බඳුන් තොල ගාලා මාඒ ඔබ යාවී අප ආ මඟ වැලපේවී සිත් පැරී කඳුලින් අප නෙතු සේදී ඇවිලෙයි අප මතකේ ඔය නෙත් ගැටෙනා මොහොතේ සමුදෙන්නම් ඔබගේ සෙනෙහේ හිමි නැහැනේ මා සිහිනයේ තටු නැතේ පියඹන්ටා දෙතනක දැවී අප ලොවේ බැමි බිඳිලා සිත්මායිමේ සිතුවිලී විසිරෙන්නා මීවිත පුරා මඳු බඳුන් තොල ගාලා මාඒ"},
{"title": "ලොවේ වෙසෙන", "artist": "සේනානායක වෙරලියද්ද", "author": "Unknown", "lyrics": "ලොවේ වෙසෙන හැම සතුනටම බුද්ධං සරණේ සරණයි සරණයි ලොවේ වෙසෙන හැම සතුනටම ධම්මං සරණේ සරණයි සරණයි ලොවේ වෙසෙන හැම සතුනටම සංඝං සරණේ සරණයි සරණයි ලොවේ වෙසෙන හැම සතුනටම මේ තුන් සරණේ සරණයි සරණයි දොහොත් මුදුන් දී වැන්දා පසඟ පිහිටුවා වැන්දා පෙරළි පෙරළි අපි වැන්දා අපේ බුදුන් අපි වැන්දා සසර කතර අතරමංව හසර නොදැන සිටි සතුනට විතර නොමැති කරුණාවෙන්, යහ මග පෑවා ගුණෙන් පිරුන පිනෙන් පිරුන, මහා ගුණවතා මහා පින්වතා දොහොත් මුදුන් දී වැන්දා පසඟ පිහිටුවා වැන්දා පෙරළි පෙරළි අපි වැන්දා අපේ බුදුන් අපි වැන්දා දුකට පෑව දයා ගුණේ සැමට පෑව එක සම සේ දුකට පිහිට වී සැමගේ, සෙත සැලසූවා ගුණෙන් පිරුන පිනෙන් පිරුන, මහා ගුණවතා මහා පින්වතා දොහොත් මුදුන් දී වැන්දා පසඟ පිහිටුවා වැන්දා පෙරළි පෙරළි අපි වැන්දා අපේ බුදුන් අපි වැන්දා"},
{"title": "සැනසුම", "artist": "සේනක බටගොඩ", "author": "Senaka Batagoda", "lyrics": "සැනසුම හොයනව යන යන තැන සැනසුම දැනෙනව ඇති තැන ජීවිතය පුරාවට ලැබුනාත් මදි සැනසුම අපි ගැන දන්නවනාම් අපි සැම නුඹ ගැන දැනෙවි පරතෙරටම මට විෂ්වාසයි ඒ තැන උපදී සැනසුම සැලකුම් තැන් හඳුනාගෙන ජීවාත් වෙන ඔයා විඳිනවා, ලබනවා සැනසුම බැලුවම දැනෙනව හැම තැන ගැලවුම ලේසිම නැහැ ඇලුනම"},
{"title": "ඔබ මා හමුවුනදා", "artist": "සශිකා නිසංසලා", "author": "Shehan Galahitiyawa", "lyrics": "ඔබ මා හමුවුනදා දෑත් දරා පෙරභවයක බැදුනා - මෙන් බැදුනා සවනට රහසින් කීවා මට ආදරෙයි කියා මට ආදරෙයි කියා ඔබ ඇස්පිය නොහෙලා බැලුවා මගෙ දෑස් දිහා මා ඇස් පිය නොහෙලා බැලුවා ඔබෙ දෑස් දිහා සන්සුන් සිතින් සිතමි මුළු රෑ පුරා දැනෙනා හැඟුම් විදිමි සිහිනේ සරා දිගු රැය දිගේ - ඔබෙ රුව මැවේ පවසන්න ලංවෙලා - මේතරම් ආදරේ කොහෙන්දෝ කියා ඔබ ඇස්පිය නොහෙලා බැලුවා සිත්මල් දෙතොල් ලංවී සිතැඟි පුරා කොඳුරා වදන් රැදෙමි සඟවා නොයා සඳ දිය පිරේ - ඇසිපිය ඇරී පවසන්න ලංවෙලා - මේ තරම් ආදරේ කොහෙන්දෝ කියා ඔබ ඇස්පිය නොහෙලා බැලුවා…"},
{"title": "ඔබ හීනයක්‌", "artist": "සංඛ දිනෙත්", "author": "Unknown", "lyrics": "ඔබ හීනයක්‌ හීනයක්‌ වී හිඳින්න මාගේ නෙතු දැහැනේ මට ආදරේ ආදරේ කියන්න ආයෙත් හොර රහසේ ජීවිතේ වේදනා සුළඟේ පාවුණා ආදරේ කඳුළු ගංගා මල් වරුසාවක් වුනා ඔබ ආයේ ආයේ ආයේ ඇවිදින් සිහිනේ සැරසුවා සිහිනේ සැරසුවා ඔබ හීනයක්‌ රෑ අහසේ සඳ වීලා - ආවාද පායලා දෑතේ මාගේ දැවටීලා - ඉන්න ලඟම හිනැහිලා ඔබ වසන්තයක් සේ ඇවිදින් මා හද සනසලා මුදු සුගන්දයක් වී මාගේ සිත්පුරා ඉහිරිලා ඔබ හීනයක්‌ මල් යායේ හැන්ගීලා - නෙත් කොනින් බලා එදා ඒ කුමරි මගෙ වීලා - දැන් ඉතිං මගේ සදා ඔබ නොයන්න කිසිදා සොඳුරේ මා ළඟ දුක තියා ඔබ හිඳින්න හිඳින්න මාගේ තුරුලේම නැවතිලා ඔබ හීනයක්‌"},
{"title": "නුඹ ළඟ නැති දා", "artist": "සංඛ දිනෙත්", "author": "Unknown", "lyrics": "හිත රිදවනා සුසුමක් වගේ නෙත හඩවනා කදුලක් දිගේ හිත රිදවනා සුසුමක් වගේ නෙත හඩවනා කදුලක් දිගේ හැබැහින් නැතත්, හීනෙන් වගේ ඇයි දැයි කියන්නකෝ මා හැරගියේ නුඹ ලඟ නැති දා හිත දුවනවා හැමතැන මගේ හිත පිරෙනවා සුවදින් ඔබේ හිත දුවනවා හැමතැන මගේ හිත පිරෙනවා සුවදින් ඔබේ බැලු බැලු අතේ, ඔබෙ රුව වගේ ඇයි මේ පෙනෙන්නේ මට ඒ වගේ නුඹ ලඟ නැති දා හිත දවනවා මතකය ඔබේ දින ගෙවෙනවා හීනෙන් වගේ හිත දවනවා මතකය ඔබේ දින ගෙවෙනවා හීනෙන් වගේ දවසක ඇවිත්, ලඟටම මගේ මොහොතක් හිඳින්නකො ඉස්සර වගේ නුඹ ලඟ නැති දා"},
{"title": "මුළු ලොව මගෙන් අසාවී", "artist": "සනත් නන්දසිරි", "author": "Praneeth Abeysundara", "lyrics": "මුළු ලොව මගෙන් අසාවී ඔබ ගැන කුමක් කියම්දෝ මගෙ සිත මගෙන් අසාවී ඔබ ගැන කුමක් කියම්දෝ මට වේදනාව දුන් අයුරු කීවත් කුමක් කියයි දෝ ඔබ මට දුකක් නොවී යයි කීවත් කුමක් කියයි දෝ මා හද ලෙයින් ලියූවත් ලොව මට කුමක් කියයි දෝ මුළු ලොව මගෙන් අසාවී ඔබ ගැන කීවා නොකීවත් මිනිසුන් කතා නොවෙයිදෝ ඔබ නිවැරදි කියූවත් මිනිසුන් සිනානොවෙයිදෝ ඔබ යලි මගේම වූවොත් ලොව මට කුමක් කියයිදෝ මුළු ලොව මගෙන් අසාවී"},
{"title": "බුදුහාමුදුරුවො වැඩියා වාගෙයි", "artist": "සනත් නන්දසිරි", "author": "Unknown", "lyrics": "බුදුහාමුදුරුවො වැඩියා වාගෙයි පින්බර සුවාමිනේ දුක හිතිලද හිරගෙදරට වැඩියේ මාගේ මරණ දිනේ මගේ අම්මාවත් දොරටුව අද්දර හිටියද කියනු මැනේ මා ගෙල ලූ බව ඇයට කියනවද බුදුබව ලැබෙයි අනේ අනේ සුවාමිනි මා ගෙළ ලන්නට ඉඩ නම් දෙන්න එපා ගෙල වැලලූවොත් මගෙ මළකද අම්මට පෙන්නන්න එපා ඇතිදා ළග උන් මිතුරන් මතු සසරෙදි හමුවන්න එපා නැතිදා ළග උන් බුදු අම්මේ උඹ දුක් ගිනි ගන්න එපා බුදුහාමුදුරුවො වැඩියා වාගෙයි පින්බර සුවාමිනේ දුක හිතිලද හිරගෙදරට වැඩියේ මාගේ මරණ දිනේ නොදැන කෙරුවත් වරද වරදමයි නැත කිසිදිනෙක සමා මරණයෙ දොරකඩ සිට ඔබ පායුග වැද සමුගනිමි මෙමා කෙළිලොල් කම් කෙළි මා සතු දිවිමග දැන් දැන් වේවි නිමා මරණ බයක් නෑ අම්මා සිහිවෙයි බුදුහාමුදුරුවො වැඩියා වාගෙයි පින්බර සුවාමිනේ දුක හිතිලයි මා හිරගෙට ආවේ පුතුගේ මරණ දිනේ දුදනන් ඇසුරින් පරපණ නැසුවත් නුඹ මගේ පුතුය අනේ මතු උපදිනදා මාගෙම පුතුවෙයන් හොද මිනිසෙකු ලෙසිනේ"},
{"title": "සිහිනේ විලසේ", "artist": "අතුල අධිකාරී සමග සමිතා මුදුන්කොටුව", "author": "Unknown", "lyrics": "සිහිනේ විලසේ ගිලිහේවි ආදර කතා සිතු දේ පැතු දේ කඳුලේ පාවී ගියා දෑස පුරෝගෙන සීතල කඳුළැලි සිතුවේ ඔබ ගැනමයි ළඳුනේ පාළුව අතරේ මා ඔබ ඇසුරේ සිතුවම් මා සිත හඬවන්නේ කඳුලින් බොඳවී ආදර ලෝකේ නෑ හමුවන්නේ අප ආයේ සිහිනේ විලසේ නාඳුනනා ලෙස ඈතට වෙමු අපි සැඟවී ගිය පසු මල් සිහිනේ මා තනි අතරේ මේ ඝන අඳුරේ කොහි යම්දෝ නෑ වැටහෙන්නේ සිහිනෙන් සිහිනේ ආදර ලෝකේ නෑ හමුවන්නේ අප ආයේ සිහිනේ විලසේ"},
{"title": "සිත ඔබ ගැන අසනා", "artist": "සමිත්  සිරිමාන්න", "author": "Unknown", "lyrics": "සිත ඔබ ගැන අසනා මොහොතක් පාසා මතකෙට තුරුළු වෙලා ඔබ සමඟින් ගත කල දින සිහිකරලා තනියෙන් විදවමි මා මේ හිත මාගේ - සනසනු බෑනේ යලි පෙර වාගේ - ඔබ එන්නෑනේ හමුවන්නට ආයේ ගෙවෙනා දිනයක් පාසා ඔබමයි පැතුවේ සැමදා යලි නෑ එන්නේ ඔබ මා සොයා කිසිදා පෙර හැම දිනයේ ඔබ හමුවන්නට ඉවසුම් නැතිව ලදේ මඟ බලමින් සතුටින් සිටි තැන් අද කදුලින් තෙමෙයි මගේ නොබලා යන රුව නොනැසී කටහඬ මම අද ඉන්නේ කෙසේ ගෙවෙනා දිනයක් පාසා ඔය මුව තුරුලට ගත්විට මොහොතක නෙත් දෙස බලා මගේ මතු හැම බවයෙම මගේම වනබව මතකද ඔබ කීදේ මහමෙර වාගේ දැනුනා ඒ දේ මටනම් ඒ මොහොතේ ගෙවෙනා දිනයක් පාසා ඔබමයි පැතුවේ සමදා යලි නෑ එන්නේ ඔබ මා සොයා කිසිදා සිත ඔබ ගැන අසනා"},
{"title": "සීත මාරුතේ", "artist": "රුවන් හෙට්ටිආරච්චි", "author": "Unknown", "lyrics": "සීත මාරුතේ වෙලෙමින් ඇස් දිහා බලන් ඔබ මට ආදරේ කියූ මතකය හීනයක් වගේ ඈත මීදුමේ දිදුලන පුන් සඳක් වගේ එළියයි ඒ හැඟුම් හිතේ ඔබමයි ජීවිතේ මගේ දෑලේ ගඟුලැල්ලක් සේ මා සීතයි හිත බෝමා දෝරේ යයි සිතුවිලි සේනා ආදරයෙන් පෙඟිලා ජීවිතයේ සතුටයි මා දුටුවේ සාගරයේ ගැඹුරයි මේ හැඟුමේ සීත මාරුතේ යහනේ තනි යහනේ පේනා හීනෙන් ඉඟිපානා රෑ තුන්යම ඔය ඇස් මවනා මා මුසපත් කරනා ආදරයේ මිහිරෙන් මා නිවුණේ ඒ ඇසුරේ අලුතින් මා ඉපිදේ සීත මාරුතේ"},
{"title": "රැවටුන තරම්", "artist": "රුවන් හෙට්ටිආරච්චි", "author": "Unknown", "lyrics": "රැවටුන තරම් ඔබ හින්ද මං කවුරුත්ම දන්නෙ නෑ තවත් කඳුළක තරම් දැණුනා හොඳින් සමුගත්ත දා ඔයා මගෙන් වැරදි කරලා ඔයා හැමදා මට වැරදිකාරයා කියා වෙන් වී ගියත් රිදවා එදා අමනාප නෑ වුණේ කිසිදා හැමදාම ඔබ මාගෙ පවසා කඳුලේම උන් කාලෙ පෙරදා දැණුනේම නෑ ඔහුගෙ කියලා හිතුවේම ඔබෙ වෙන්න මතු දා පිළිගන්න අදිමදි කලා මගේ පණ ඈත යනු දැකලා වැරදි කරලා හිත කීරි ගැහිලාම රිදුණා ඔබ දන්නෙ නෑ නේද මේවා මට යන්න බෑ මතක හැරදා ඔය වාගෙ දුර ඈත පියඹා හිනැහෙන්න අමතක වුණා මතක් වෙන වාරයක් පාසා වැරදි කරලා රැවටුන තරම් ඔබ හින්ද මං වැරදි කරලා ඔයා හැමදා"},
{"title": "නිල් මිණි දෙනෙතේ", "artist": "රූකාන්ත ගුණතිලක සමග චන්ද්‍රලේකා පෙරේරා", "author": "Unknown", "lyrics": "නිල් මිණි දෙනෙතේ ආදර සිහිනේ හැබැහින් දකින්න ළංවී හිඳින්න මට සිතුණා මැණිකේ ලා තරු එළියේ පායන සඳ සේ සිසිලස බෙදන්න ඔබ ළඟ රැඳෙන්න ළං වෙනු මැන පෙර සේ නිල් මිණි දෙනෙතේ ආදර සිහිනේ මේ දිවි ගමන දුරයි සතුටයි නිරන්තරේ රන් මුතු වරුසා වැහැලා මිණි දෙහදේ ලොව කුළු නැගෙන්න අහසේ තරු පෙලගැහෙන්න රහසේ මගෙ හිත හඳුණාගෙන ආවා සුහදේ නිල් මිණි දෙනෙතේ ආදර සිහිනේ විශ්වය මනෝහරයි අපෙ ආදරෙ හැඟුම්බරයි ඉර හඳ දේදුණු දිලෙන්නෙ අපට තමයි සිසිලක් සදන්න දිවියේ ළංවී හිඳින්න සසරේ මගෙ දිවි ගමනේ සෙවණැල්ලත් ඔබමයි නිල් මිණි දෙනෙතේ නිල් මිණි දෙනෙතේ ආදර සිහිනේ හැබැහින් දකින්න ළංවී හිඳින්න මට සිතුණා මැණිකේ ලා තරු එළියේ පායන සඳ සේ නිල් මිණි දෙනෙතේ ආදර සිහිනේ"},
{"title": "නෞකා එලි නිවෙනා රෑ", "artist": "රූකාන්ත ගුණතිලක", "author": "Unknown", "lyrics": "නෞකා එලි නිවෙනා රෑ මුහුදේ රළ කැළඹෙන රෑ තනි වී ක්ෂිතිජය අඳුරේ හිඳිනා පිළිරුව මම දෝ සුසුමෙහි සුළඟට සැලි සැලි හිත වෙවුලා මම ඉකි බිඳිනෙමි ගිනිසිළු පද අවුලා සිවුසිය ගව් දුර ගොඩ බිම කොතැනක හෝ පෙම් සිරි යහනක ඔබ ඇත දනිමි අහෝ නැව් බඳ දෙදරා යලි යලි හැපෙන රළේ අසරණ නැවියෙකු වැලපී ඇසෙන නදේ ඔබ නැති ලොව මට කඳුලක ඉන්න කියා මැදියම් කළුවර සඳු අර යන්න ගියා"},
{"title": "මොනවද මුත්තේ මොකද කරන්නේ", "artist": "රෝහණ වීරසිංහ", "author": "Mahinda Himi S", "lyrics": "මොනවද මුත්තේ මොකද කරන්නේ මොකටද ඔබ ඔය බිම හාරන්නේ ඔබටත් ළමයෝ නොපෙනේ නොසිතමි අඹ ඇටයක් සිටුවන්නට හාරමි දුකසේ සිටුවා අඹ ඇටයක් අද එක අඹයක්වත් කන්න ලැබේවිද මම ළමයෝ මින් අඹයක් නොපතමි යුතුකම පමණක් ඉටුකොට තබනෙමි තමන්ට නොලැබෙන දේකින් ලෝකෙට කරන්ට හැකි දේ නොම තේරෙයි මට පුදුමයි ළමයෝ ඔබේ ඔය අදහස හැදුනොත් ඔහොමට ඔබටම වෙයි දොස පෙර උන් අය සිටවූ අඹ ගස්වල ඵලයෙන් අප කවුරුත් ලබනෙමු ඵල අපෙන් පසුව එන අයටත් එම ඵල ලැබෙන්ට සැලසුම අපගේ යුතුකම ඒ යුතුකම හොඳ හැටි දැනගත්තෙමි ආයුබොවන් මුත්තේ මම යන්නෙමි"},
{"title": "ඔබේ අත ගෙන", "artist": "රෝහණ  සිරිවර්ධන", "author": "Unknown", "lyrics": "ඔ‍බේ අත ගෙන පෙර සැදෑවක උයන් තෙර හිද ආදරේ ගැයූ කුළුදුල් ප්‍රේම ගීතය විරහ ගීයක් නොවේවා ඔබේ හදවත සැලෙන රාවය පවා මසිතට දැනුණ මොහොතක හදවතින් තෙපලූ කතා කිසිදු දිනයක ගොළු නොවේවා… ඔබේ සිහිලැල් සුවැති සෙවණේ රැදී අප හුන් ඒ සැදෑවේ හදවතින් මතුවූ සිනා කිසිදු දිනයක බොද නොවේවා"},
{"title": "දෑසේ මල් විලේ", "artist": "මාලනී  බුලත්සිංහල සමග රෝහණ  සිරිවර්ධන", "author": "Sarath De Alwis", "lyrics": "දෑසේ මල් විලේ ආශා රොන් සැළේ වෑහී ආදරේ චේතනා නෙත් දැලේ ආශා විල් තෙරේ පායා රන් සඳේ ඡායා පායලා මේ සැඳෑ යාමයේ දෑසේ මල් විලේ ආශා රොන් සැළේ සන්සුන් නදී තෙරේ මේ මල් විමානයේ ආරාධනා රැව්දෙනා යාමයේ ආදරෙන් ළංවෙමු දෑසේ මල් විලේ ආශා රොන් සැළේ නිල්වන් වලා තළේ ඈතින් එහා ලොවේ ගී ගායනා විසිරෙනා මේ රැයේ ආදරෙන් හිනැහෙමු දෑසේ මල් විලේ ආශා රොන් සැළේ"},
{"title": "දිවි කතරට ගංගාවයි", "artist": "රෝහණ  බෝගොඩ", "author": "Unknown", "lyrics": "දිවි කතරට ගංගාවයි මට හමුවු ගංගා දිවි ඇති තුරු මගෙ සරනට ඔබම වේය ගංගා දිවි ගමනේ ජය මාවත හදුනා දුන් ගංගා ඔබෙ සෙනෙහස නොලැබුනු දා මා තනිවෙයි ගංගා මලක මෙලෙක කියා දුන්නේ ඔබෙ දෑතයි ගංගා ඒ අයුරින් මා සිත සතපවන්න මගෙ ගංගා පුර සද සේ මුව මඩලින් සෙනෙහස දුන් ගංගා හැම දිනකම මා හමුවී සිනාසෙන්න ගංගා දිවි කතරට ගංගාවයි ඊයේ රෑ මා සිහිනෙන් දුටුවේ ඔබයි ගංගා මා හැරදා අළුයම ඔබ වෙන්න ගියා ගංගා මේ අයුරින් හැම දිනකම සිත සනහා ගංගා වෙන්ව නොයා ජීවි‍තේ අරුණ වෙන්න ගංගා දිවි කතරට ගංගාවයි"},
{"title": "මට මුළු ලොවම ඔබයි", "artist": "රූකාන්ත ගුණතිලක සමග චන්ද්‍රලේකා පෙරේරා", "author": "Unknown", "lyrics": "මට මුළු ලොවම ඔබයි මගෙ මුළු ලොවම ඔබයි සිනහව කඳුල ඔබයි ජය පැරදුමත් ඔබයි ඔබ ලඟ නැති විට හිරු සඳු මිලිනව ලෝකය නවතිනවා සුසුමක සිරවී හදවත නවතිනවා මට මුළු ලොවම ඔබයි ඔබ ලඟ නැතිවිට විකසිත වන ලොව පිබිදී හිනැහෙනවා හදගැඹ සහසක් මල් යලි පිඹිදෙනවා මට මුළු ලොවම ඔබයි"},
{"title": "මනලෝලී මනමාලියේ", "artist": "චන්ද්‍රලේකා පෙරේරා සමග රූකාන්ත ගුණතිලක", "author": "Unknown", "lyrics": "මනලෝලී මනමාලියේ ඔය දෑසේ කැල්මන් වෙලා මාගෙ දෑතේ දැවටී ආවේ පවසන්නදෝ ආදරේ කවදා හෝ සංසාරයේ එක් වීලා අතිනත් වෙලා ආවා වගේ ඔබ මේ ආවේ පවසාලා ප්‍රේමාදරේ මුව මදහාසේ ඔබ මට පෑවේ විහිදා පෙම් ආරාධනේ ඉඟියෙන් වාගේ රහසින් කීවේ සැනසීමයි මේ ජීවිතේ ඔබ හිනැහේවී පුන්සඳ වාගේ පායාලා මාගේ ලොවේ ඈයිදෝ නොහෑගේ ලෙන්ගතු වූයේ ඔබ මා ලංවීලා මෙසේ ලතැවුල් කීවේ සංසිදවූවේ දෙනෙතේ දල්වාලා සෙනේ ඔබ සුව ගේනා සුවඳක් වාගේ පාවේවී මාගේ ලොවේ"},
{"title": "පුරාණේ ඔබට පිදු ආලේ", "artist": "රොහාන් ද  සිල්වා", "author": "Rookantha Gunathilaka", "lyrics": "පුරාණේ ඔබට පිදු ආලේ ඇයට මම පිදුවා සිතාරේ වයන තත වාගේ සිත සෙමින් හැඬුවා ඔහු පතා සිත සිතා ඔබ පෙර දිනේ හැඬුවා ඔබ කතා නැති නිසා මම නිහඬ වී සිටියා ඒ දිනේ පවා නිහඬ වී සිටියා පුරාණේ ඔබට පිදු ආලේ අද මෙමා ඇය තුරුල්ලේ සැනසෙමි මෙලෙසේ පෙර දිනේ මගෙ දුක මතක් වී සිත හඬයි රහසේ මටම අනුකම්පා වී සිත හඬයි රහසේ පුරාණේ ඔබට පිදු ආලේ"},
{"title": "කලකට පස්සෙ", "artist": "රූකාන්ත ගුණතිලක", "author": "Unknown", "lyrics": "කලකට පස්සෙ ඔබ අමතන්නෙ මිතුරී පුදුම හිතන්නත් එපා මගේ සොඳුරී ඔබට නොකීවා කියලා තරහා වෙන්නෙපා ඔබට නොලීවා කියලා අමනාප වෙන්නෙපා පහුගිය දවසක මගෙ ජීවිත උයනේ ඉඳහිට පිපෙනා සුවඳ විහිදෙනා රුවැති මලක් පිපුණා ඒ මල් සුවඳින් ප්‍රාර්ථනා නැහැවී මුළු ජීවිතයම මල් සුවඳයි ලැබුවේ කොහෙන්ද සුර මල් ලොවෙන්ද තව හොඳ හොඳ මල් තව තව තියේද ඒවා අහන්නෙපා සොයලා බලන්නෙපා ඔබට නොකීවා කියලා තරහා වෙන්නෙපා ඔබට නොලීවා කියලා අමනාප වෙන්නෙපා සිහිනේ තවමත් පෙණෙනවා සවනේ මුමුණා ඇසෙනවා සුළඟේ සුවඳක් දැණෙනවා දිවියේ රොන් රස තියෙනවා ඔබ හමු නොවුණා කියලා තරහා වෙන්නෙපා ඔබ ඇමතුවෙ නෑ කියලා අමනාප වෙන්නෙපා ඔබට නොකීවා කියලා තරහා වෙන්නෙපා ඔබට නොලීවා කියලා අමනාප වෙන්නෙපා මට ඔබ හිමි නෑ කියලා තරහා වෙන්නෙපා මම ඔබ ළඟ නෑ කියලා අමනාප වෙන්නෙපා තාමත් පෙණෙනවා මුමුණා ඇසෙනවා සුවඳක් දැණෙනවා රොන් රස තියෙනවා"},
{"title": "ජේසුනී ඔබට ආදරේ", "artist": "රූකාන්ත ගුණතිලක", "author": "Unknown", "lyrics": "ජේසුනී ඔබට ආදරේ පව්කාරයා මං මා සිතේ මටම වද දෙනා පව්කාරයා මං ඔබෙ දෙසුම් අසන්නට ආසයි ඒ පණත් රකින්නට ආසයි ඔබ වාගෙ ඉන්නටත් ආසයි ඒ වුණාට බාධක බෝමයි ඒ වුණාට බාධක බෝමයි ජේසුනී ඔබට ආදරේ පව්කාරයා මං මං සීල සමාදන් වෙනවා පාපෙට යළි යළි වැටෙනවා සතුරන්ට සමාවත් දෙනවා යළි ඔවුනට බැණ වදිනවා ඉඳහිටලා දන් දෙනවා දීලා අඬ බෙර ගහනවා දුක දහදිය හොරකම් කරනවා ඉන් පස්සෙ මම රජ වෙනවා ජේසුනී මා සිතේ මටම වද දෙනා පව් කාරයා මං ජේසුනී ඔබෙ දයාව අයදිනා පව් කාරයා මං"},
{"title": "හිත නැවතුන තැන", "artist": "රූකාන්ත ගුණතිලක", "author": "Unknown", "lyrics": "හිත නැවතුන තැන ඔබ නවතිනවාද ඔබ නැවතුන තැන හිත නවතිනවාද ඔබයි ඔබේ හිතයි එක විට එක තැන නැවතුන දා බලන්න වට පිට මම ඔබ ළඟද කියා හිත නැවතුන තැන දුර ඈත නොපෙනෙන රෑක ළඟ පාත ඉන්නෙමී දුටුවාද බැලුවාද දෙනෙතින් සෙනේ කියමී හිත තාම දුර නේද හැමදාම අසමී හිත පාළු වුන දාට ඔබ ගාව ඉන්නෙමී හිත නැවතුන තැන ඔබ නවතිනවාද මුළු රෑම සඳු ගාව තරු රෑන තනි රකී හැමදාම ඔබ ගාව තනි නෑනෙ මම ඉමී නුඹ නාව නෙතු ගාව කඳුලැල් සැලි සැලී ඉඟි පෑව ඔය දෑස මතකේ රැඳි රැඳී හිත නැවතුන තැන ඔබ නවතිනවාද ඔබ නැවතුන තැන හිත නවතිනවාද ඔබයි ඔබේ හිතයි එක විට එක තැන නැවතුන දා බලන්න වට පිට මම ඔබ ළඟද කියා හිත නැවතුන තැන"},
{"title": "බොල්පිණී වෑහෙන වේලාවේ", "artist": "රූකාන්ත ගුණතිලක", "author": "Unknown", "lyrics": "බොල්පිණී වෑහෙන වේලාවේ ඔබගෙන් සමුගෙන යා යුතුවේ තාමත් ඔබ ඇත සුව නින්දේ ඒකයි මා නොකියා යන්නේ බොල්පිණී වෑහෙන වේලාවේ ගැලපිට නැගලා ඈත ගම් බලා පියමන් කරවන්නේ තවත් නිවහනෙක ගිමන් නිවනතුරු ඔබ සිහියට එන්නේ ඔබගෙන් සමුගෙන මා යන්නේ ඔබ අවදිව මා සොයනු එපා ඈතයි මා ඉන්නේ තවලම්කරුවෝ කවරදාක හෝ එකම තැනක උන්නේ බොල්පිණී වෑහෙන වේලාවේ"},
{"title": "අනාත මාරුතේ", "artist": "රූකාන්ත ගුණතිලක", "author": "Unknown", "lyrics": "අනාත මාරුතේ කුණාටු සාගරේ දිවිය තියෙන තුරු මගේ ඔබයි ආදරේ… අතීතයට වඩා පැරණි අපේ ආදරේ අපි දෙන්නා හැඩූ හැඩුම් දනී සාගරේ සදා වෙනස්‌ වෙන්න එපා මැණික මා කෙරේ දිවිය තියෙන තුරු මගේ ඔබයි ආදරේ… සිත රිදවන වදන් වලට හඩන්නට එපා ඇනුම් බැනුම් වලට මගේ තැවෙන්නට එපා සසර සරණ තුරා මගෙන් මිදෙන්නට එපා දිවිය තියෙන තුරු මගේ ඔබයි ආදරේ…"},
{"title": "දෑසම රිද්දන", "artist": "රූකාන්ත ගුණතිලක", "author": "Unknown", "lyrics": "දෑසම රිද්දන හසගන තාලෙට පාද නගාගෙන කවුද හැබෑටම මේ යන රන් ළන්ඳා… කිව්වානාහන මේ මගෙ දෑසම ඇසිපිය නොහෙළනවා… මේ හැටි ලස්සන රූ වරුනාවට ඉබේම නැවතුනු හිටි පාදෙම ඔය කී රූ වරුණා… මා ගැන නම් මේ අහන්න ආසයි ආයෙම මයෙ වරුණා… මල් පෙති වාගේ පාද රිදෙද්දෝ බොරළු ප‍යේ ඇනිලා මා‍ ගැන මන්දෝ මේ අනුකම්පා හිතට දුකක් දැනිලා… ආලේ කුසුමෙන් මා හිත පිපිලා සුවඳ හදේ රැඳිලා… පේර නාරං බෝවිටියා දං අපට කඩා දෙයිදෝ බුරුතු පිටින් මේ වාරේ අවාරේ නෙලාන ඉන්නම් දෝ… මේ ගුරු පා‍රේ මේ නෙතු ආයේ හෙටත් සිනා සෙයිදෝ…"},
{"title": "සිනාසෙන්න බෑනේ", "artist": "රොමේෂ් සුගතපාල", "author": "Unknown", "lyrics": "හැඟුම් මත් කලා ඒ නුරා දෑසෙ මායා නැගූ මල් සිනා හද පුරා සුවඳ දීලා ඉගිලී ගියාදෝ සයුරෙන් එහා දුර යන්නෙ හැංගෙන්නෙ මගෙ හිත දවාලා සිනාසෙන්න බෑනේ ඔබේ සුවඳ නෑනේ කොහෙදෝ මා දමා ඉගිලුනේ නිල්වන් ගැබේහී සඳ හැංගුණා සේ ඔබ එයිද ආයෙ දෑස පේන මානයේ මල පර වුණා සේ නොපිපේද ආයේ හද රැන්දු සිහිනේ බොඳ වෙයිද මාගේ හද විලම සනසන්න දුක මගෙ නිවාලා සිනාසෙන්න බෑනේ ඔබේ සුවඳ නෑනේ කොහෙදෝ මා දමා ඉගිලුනේ සංසාර හීනේ ඔබ නේද මාගේ මේ පෙම් කතාවේ ගිණි ඇවිලිලානේ හමුවන්න ආයේ පෙරුමන් පුරන්නේ ගිණි දැවෙන ලෝකයේ මං තනි වෙලානේ මුණ ගැහුණ තැන තාම මම ඉන්නවා සිනාසෙන්න බෑනේ ඔබේ සුවඳ නෑනේ කොහෙදෝ මා දමා ඉගිලුනේ සිනාසෙන්න බෑනේ"},
{"title": "සෙනෙහසේ මල් පිපේවා", "artist": "රොමේෂ් සුගතපාල", "author": "Unknown", "lyrics": "සෙනෙහසේ මල් පිපේවා ලයේ උපදින ලතෙත් හැඟුමින් ගයා සුවඳම පතුරනා ගිලන් වූ සිත් නිවා සනසන පහන් හැඟුමන් උපදනා සෙනෙහසේ මල් පිපේවා වෛරයෙන් ඉරි තැලෙන සිත් තුල කෙලෙස මිනිසත් බව පිරෙන්නේ සෙනෙහසේ සුවඳින් නිවී ගිලන් වූ සිත් සුව ලබන්නේ එවන් සත් සිත් පහන් කරවන සෙනෙහසේ මල් පිපේවා ඉසුරු සම්පත් ලබත් එනමුත් එයින් මනු සිත් නැහැ නිවෙන්නේ ගිලන් වූ සිත් සුවෙන් පිබිදී සෙනෙහසින් මල් පණ ලබන්නේ එවන් සත් සිත් පහන් කරවන සෙනෙහසේ මල් පිපේවා"},
{"title": "නන්නාදුනන සිහිනය", "artist": "රොමේෂ් සුගතපාල", "author": "Unknown", "lyrics": "නන්නාදුනන සිහිනය වෙලා තරු ඇස් කොනක හිත නවතලා ආඩම්බර කතා ඉඟිපා තියා මගේ තනි හිතට ඔච්චම් කළා මනමාලයි හිතේ පෙම් කතා මහමෙර උසට හැඟෙනා නිසා කවි හිත යට ලියා නෙත ළඟ හැංගිලා සින්නක්කරම මට හිමි වෙලා රෑට අහසට නැගලා දඟකාරි හිත අල්ලලා කෝල බැල්මක් හෙලලා මගෙ හීන ගෙත්තම් කළා වැසි වැටෙන කළුවර මකා නිල් අහසේ සිත්තම් කළා ඔය හිත තාම මගේ ළඟ නිසා හීන ඇත්තක් වෙලා නන්නාදුනන සිහිනය වෙලා තරු ඇස් කොනක හිත නැවතිලා ආඩම්බර කතා ඉඟිපා ගියා මගේ තනි හිතට ඔච්චම් කළා"},
{"title": "හමු නොවනා ලෙස ආයේ", "artist": "රොමේෂ් සුගතපාල", "author": "Unknown", "lyrics": "හමු නොවනා ලෙස ආයේ වෙන්වන්නද හමු වූයේ ආදරේ දුන්නු කාලේ ඉවරයිද වෙනස මට දැනෙනවා වේදනා දැනෙනවා… අප හමුවූ මුල් දිනයේ ආදරෙන් සිත් වෙලී වෙන් නොවනා ලෙස දිවුරු පොරොන්දුව කඩවී වේදනා දෙන්නෙපා මගේ ආදරේ බිද දම වේදනා දැනෙනවා මේ අදරේ වෙනසක් වෙලා හමු නොවනා… ඔබයි එදා මගේ හිතේ ආදරේ වැතිරුවේ ඔබම තැනු පෙම් සිහිනේ තනිව මා ඉන්නේ වේදනා දෙන්නෙපා මගේ ආදරේ බිද දමා වේදනා දැනෙනවා මේ අදරේ වෙනසක් වෙලා හමු නොවනා…"},
{"title": "හැමදාම හඬන සිත", "artist": "රොමේෂ් සුගතපාල", "author": "Unknown", "lyrics": "හැමදාම හඬන සිත හදන්න ඔබ ලඟ නෑනේ කවුරුවත් එපා ඔබ හැරුනම දුක දැනුනාවේ ඉස්සර වගෙ හීනෙන්වත් දැන් එන්නෑනේ මට විතරද දුක දෙන්නේ මං දන්නැනේ සඳ මඬලට උපමා කර - කවි ලියු කාලේ කාගෙත් දුක දැනෙනා හිතක් - ඔබ සතු වූයේ කදුළු ගලා ඔබ අද මට හිනැහෙනවානේ ඔබවම සිත පතනා කරුණ මං දන්නැනේ හැමදාම හඬන සිත නෙතු තෙමුනා මගෙ මතකෙට - ඔබ එන ගානේ තාම හිතේ ඔබ හැරුනම - කවුරුත් නෑනේ අද නැති මුත් ලඟ සිටි දා සිත හැදුවානේ හිත මේ තරමට අසරණ ඔබ හින්දානේ හැමදාම හඬන සිත"},
{"title": "දැනෙන දුක් වේදනා", "artist": "රොෂාන් ප්‍රනාන්දු", "author": "Unknown", "lyrics": "දැනෙන දුක් වේදනා - හිත අස්සෙ හිරකරන් සැනසුනමක් නැති වෙලා ඔබ හින්දා රත්තරන් ඔබ මගෙන් වෙන් වෙලා අද දුරට වී ගිහින් මං හඬන හැටි දැක්කොතින් ඔබ හඬයි සත්තකින් මං තරම් පෙම් කරපු වෙන කෙනෙක් නැති තරම් දන්නවා නම් ඔයා වෙන්වෙන්නෙ නෑ මගෙන් හිත හොයන උණුහුමත් නැති වෙලා අද ඉතින් ආදරේ තරම් මා දන්නේ නෑ සත්තකින් දැනෙන දුක් වේදනා ජීවිතේ මම කියා කියූ හැටි ළඟ ඉඳන් සිහිවෙලා හඬනවා තුන්යමේ නිදි වරන් මට පුරුදු තනිකමින් මම යළිත් තනිවෙමින් එනතුරා ඔබ ඉතින් බලන් ඉමි රත්තරන් දැනෙන දුක් වේදනා"},
{"title": "දිගු දෑස", "artist": "රොමේෂ් සුගතපාල", "author": "Unknown", "lyrics": "දිගු දෑස දුටුවාම හැ‍ඟෙනවා පෙර සේම උන්නු හැටි මගෙ ගාව ඔය හිතට අමතකද බිඳ දමා මගෙ සිහිනේ ඇයිද ඔබ හැංගෙන්නේ මට දෙන්න මගෙ සිහිනේ ලඟ ඉන්න පෙරවාගේ රෑ දිවා හිත පුරා ඇවිලිලා මේ ගින්න තරු පවා හඬනවා ‍ඔබට නෑ තේරෙන්නේ හිතට හිත හිමි නැතිද අහනවා හිත මාගේ ම‍ට දෙන්න මගෙ සිහිනේ ලඟ ඉන්න පෙර වාගේ දිගු දෑස දුටුවාම පෙර එදා හමුවෙලා වෙළුනු හැටි මුදු පහසේ විදිනවා දකිනවා නිහඩ රෑ දුර අහසේ දුරම මිස ලඟ නැතිද අහනවා නෙතුමාගේ කවදාද ඔබ එන්නේ නැතුවාද හමුවන්නේ දිගු දෑස දුටුවාම"},
{"title": "රත්තරන් ප්‍රාර්ථනා", "artist": "රෝයි පීරිස්", "author": "Unknown", "lyrics": "රත්තරන් ප්‍රාර්ථනා ඈත සුන්වී ගියා ආදරේ චාරිකා නිමවුණා නෙත් තෙමා ආයේ කවදා දකිම්දෝ ඔබේ පෙම් සිනා රත්තරන් ප්‍රාර්ථනා ඈත සුන්වී ගියා ආදරේ චාරිකා නිමවුනා නෙත් තෙමා ගංගා තලාවේ වැතිරී හිඳන් ළංවී මගේ කනට රහසින් කියා ගංගා තලාවේ වැතිරී හිඳන් ළංවී මගේ කනට රහසින් කියා ඒ පෙම් කතාවන් සුළඟේ පාවී රහසක් අපේ ආදරේ රත්තරන් ප්‍රාර්ථනා ඈත සුන්වී ගියා සැඟවී හිඳින්නම් එන මං බලා තනිවී හඬන්නම් ඔබේ නාමයෙන් සැඟවී හිඳින්නම් එන මං බලා තනිවී හඬන්නම් ඔබේ නාමයෙන් දෙගුරුන් නිසානම් අප වෙන් උනේ අහිතක් නොවේ මා සිතේ රත්තරන් ප්‍රාර්ථනා ඈත සුන්වී ගියා"},
{"title": "රත්තරන් ප්‍රාර්ථනා", "artist": "රෝයි පීරිස්", "author": "Unknown", "lyrics": "රත්තරන් ප්‍රාර්ථනා ඈත සුන්වී ගියා ආදරේ චාරිකා නිමවුනා නෙත් තෙමා ආයේ කවදා දකින්දෝ ඔබේ පෙම් සිනා රත්තරන් ප්‍රාර්ථනා ඈත සුන්වී ගියා ආදරේ චාරිකා නිමවුනා නෙත් තෙමා ගංගා තලාවේ වැතිරී හිඳන් ළංවී මගේ කනට රහසින් කියා ගංගා තලාවේ වැතිරී හිඳන් ළංවී මගේ කනට රහසින් කියා ඒ පෙම් කතාවන් සුළඟේ පාවී රහසක් අපේ ආදරේ රත්තරන් ප්‍රාර්ථනා සැඟවී හිඳින්නම් එන මං බලා තනිවී හඬන්නම් ඔබේ නාමයෙන් සැඟවී හිඳින්නම් එන මං බලා තනිවී හඬන්නම් ඔබේ නාමයෙන් දෙගුරුන් නිසානම් අප වෙන් උනේ අහිතක් නොවේ මා සිතේ රත්තරන් ප්‍රාර්ථනා"},
{"title": "ඔබ ආදරේ", "artist": "රෝයි පීරිස්", "author": "Unknown", "lyrics": "ඔබ ආදරේ මා කෙරේ නම් ඇයි වේදනාවන් මේ තරම් සිත මාරුතේ වෙලී නෙත කඳුලැලින් පිරී දිවා රෑ හදේ වේදනා සිත මාරුතේ වෙලී නෙත කඳුලැලින් පිරී දිවා රෑ හදේ වේදනා වෙනදාට මේ වාගේ හඳ පෑයු රෑ යාමේ ඔබ මාගෙ සුරතේ වෙලී සුදු පාට දිය රැල්ල නැග එද්දි හසරැල්ල පාලා මගේ ගත වෙලී හැමදාම මට කීව ඒ පෙම් කතාවන් ගොළු වී ගියා සේ දැනේ මහදේ සුසුම් යා වුණී ඔබ ආදරේ මා කෙරේ නම් සිතුවාද වෙන් වෙන්න වෙනතක් අරන් යන්න කම් නෑ ඔබේ සතුට නම් මනමාලියක් වීල යන දාට හිනැහීල සොයුරෙක් ලෙසින් මා සිතන් දැකගන්න ඉඩදෙන්න මාගේ නෙතින් ඔය මූණ සැරයක් ඉතින් සුපතන්න හෝ මා සිතින් ඔබ ආදරේ මා කෙරේ නම්"},
{"title": "නොදැක ඉන්න බෑ", "artist": "රුවන් හෙට්ටිආරච්චි", "author": "Unknown", "lyrics": "නොදැක ඉන්න බෑ මටනම් මගෙ ආදරී නොලැබ ඉන්න බෑ තවනම් ඔබෙ ආදරී නොසිත ඉන්න බෑ මටනම් කිසිදා ළඳේ නොවිඳ ඉන්න බෑ ඔබෙ ආදරේ නොදැක ඉන්න බෑ මටනම් මගේ ආදරී… පැහැදුල් කතා මතකේ වෙලා දෙනුවන් තෙමා පියමන් කලා පෙර පෑ සිනා පාවී ගියා මා හැරදමා සිහිවේනවා ඔබ කී කතා මුළු රෑ පුරා මතකේ දරා හිඳිමී සදා… මතකේ දරා හිඳිමී සදා… මිහිදුම් වලා සළුවෙන් වෙලා පැතුමන් දරා රකිමී සදා පෙර පෑ සිනා පූජාකලා අදුරේ තියා සගවා දොවා මේ වේදනා යලි එනතුරා දිවියේ පුරා හිඳිමී බලා… දිවියේ පුරා හිඳිමී බලා…"},
{"title": "සඳ තරු මල්", "artist": "අතුල අධිකාරී සමග සමිතා මුදුන්කොටුව", "author": "Unknown", "lyrics": "සඳ තරු මල් මට දන් දුන් මගේ රුසිරු නුඹ අරගන් හිරු තෙද වන් මට දන් දුන් මගේ ඔටුනු නුඹ ලාගන් දායාද එයයි මගෙ දෝනිට - අප දෙන්නාගේ ගණ දෙවිඳුන් මට දන් දුන් ‍ මගේ නුවණ නුඹ අරගන් පතිනි මවුන් මට රැක දුන් මගේ බලය නුඹ අරගන් දායාද එයයි මගෙ දෝනිට - අප දෙන්නාගේ සඳ තරු මල් ඇල දොල ගං මට දන් දුන් හදේ සිසිල නුඹ අරගන් මහ වන විල් මට දන් දුන් හිතේ සුවඳ නුඹ අරගන් දායාද එයයි මගෙ දෝනිට - අප දෙන්නාගේ සඳ තරු මල්"},
{"title": "ඈත එපිට ගම්මානෙන්", "artist": "සනත් නන්දසිරි", "author": "Sunil Sarath Perera", "lyrics": "ඈත එපිට ගම්මානෙන් නැග එන බටලී හඬ අතරේ ඉතාම දුක්බර කවියක් මතුවෙද ඇය නිදි නොමැති පැලේ මලානිකව හද එලිය ගලා එන අම්බලමක හෙවනේ බලාහිදිමි ඔබ හිදින විමන් දොර දැල්වෙන එලිය බදේ ඈත එපිට ගම්මානෙන් වේදනාව නෙතු අගට ගලාලා ඉකිලන නිහඬ රැයේ නීල නුවන් තරු කැට බොදවෙනවා කාටත් හොර රහසේ ඈත එපිට ගම්මානෙන්"},
{"title": "හිත ළඟ ඔබ", "artist": "සංඛ දිනෙත්", "author": "Unknown", "lyrics": "හිත ළඟ ඔබ කෙඳිරූ කතා හීනෙක දුර මා තනි කළා මා හිටියා දෑසම පියා ඔබ මා ළඟ තව ඇති කියා සිත නෑ ඔබ මා හැරගිය දා පටන් විඳින්න නෑ ජීවිතයක් ඉතින් ඔබ ඇයි මේ තරමට රිදෙව්වේ ආදරේ ඔබ ඇයිදෝ මේ ලෙස හැර ගියේ ඔබදෝ මා සිත තනි කලේ ආදරේ ආදරේ ඇයිදෝ මේ ලෙස හැර ගියේ ඔබ ඇයි මා සිත තනි කළේ ආදරේ ඔබ ඇයි මට ලං වුණේ තනි අඳුරක මා දිය කළේ මට මගෙ දුක විතරක් තියා ජීවිතයම අරගෙන ගියා පෙරදා ඔබ මා හා ගත කල ආදරේ ඔබ ඇයි අහසට විසි කළේ මට බෑ ඉගිලෙන්න ඔය තරම් ආදරේ ඔබ ඇයිදෝ"},
{"title": "මා දෙනෙත්", "artist": "සාරංග දිසාසේකර", "author": "Unknown", "lyrics": "මා දෙනෙත් පියවිලා මා සුසුම් සිරවෙලා යන තුරා දිවිමගේ ඔබ පමණයි සිහිනේ සදා තුරුලේ නැලවි එදා කීව පෙම් ගී කතා සුළගේ මුසුවි ගියා ඔබව මතකේ තියා ලාදළු මල්පෙති පවා මිහිමතේ සෑත්පිලා ඔබත් යලි නෑ කියා හිරුත් අවරට ගියා මා දෙනෙත් පියවිලා"},
{"title": "අම්මා", "artist": "සංගීත් විජේසූරිය", "author": "Unknown", "lyrics": "හෝහෝඅම්මාඅම්මාඅම්මා දන්දී පින්දී උදම් වී - දම් සාරෙන් නෑවිලා සම්මා සිත් පෑදුවා අම්මා උස්වී දුක් ගී වැයෙද්දී - හිස්වී ඇවිලී ගිනි මං නැත්තම් කෑවෙ නෑ අම්මා ඉන්නට නම් බැ ඉතින් - වන්දි දෙන්න ආයෙමත් ආයෙමත් අම්මා වෙන්න නිවනින් පේ විලා වේදනා සේදිලා යනතෙක්ම හෝහෝඅම්මාඅම්මාඅම්මා හෝහෝඅම්මාඅම්මාඅම්මා දන්දී පින්දී උදම් වී - දම් සාරෙන් නෑවිලා සම්මා සිත් පෑදුවා අම්මා වාවාලා මිහිකත වාගේ කැක්කුම් දෙන්නාලා දියවුන රූපේ සම රැලි වී කෙහෙ ගැලවී කුදු වෙනවා නේ අම්මා හද දනවා ඉවසනවා ඔබ කියලා දී ඇත්තා සේ හෝහෝඅම්මාඅම්මාඅම්මා හෝහෝඅම්මාඅම්මාඅම්මා දන්දී පින්දී උදම් වී - දම් සාරෙන් නෑවිලා සම්මා සිත් පෑදුවා අම්මා දීඝායූ වැඩි වැඩි වේවා දෙවියොත් දෑස් පාලා ලෙඩ දුර ගාවා කිරි එරවා යලි පොවලා ලෙස ලං වෙනවාඅම්මා මට ලංවී සංසාරේ සංහිදවන්නේ අම්මා හෝහෝඅම්මාඅම්මාඅම්මා හෝහෝඅම්මාඅම්මාඅම්මා මගෙඅම්මාඅම්මාඅම්මා හෝහෝඅම්මාඅම්මාඅම්මා"},
{"title": "මල්සර හීසරින්", "artist": "සශිකා නිසංසලා", "author": "Unknown", "lyrics": "මල්සර හීසරින් ඇස් පිල්ලම් යටින් වින්දා කාටත් හොරෙන් කවුරුත් නැති සිත් මලින් ඉල්ලන්නේ මා ඔබෙන් දෙනවාද මා හට දෙනවාද මට ආදරේ මල්සරාගේ දුන්න වැරදී මටම වැදුනාදෝ පාලු නගරේ ඉන්න ආසයි ඉඩක් දෙනවාදෝ දිගන්තයකින් අනන්තෙට යන පාර මැද ඉන්නම් ඔබට ලංවී හදේ දොරටුව ලඟට ඇවිදින් සිතද ඉල්ලන්නේ මගේ නගරේ තවත් කෙනෙකුට ඉඩක් නෑ දෙන්නේ වසර ගණනක් පෙරුම් පුරලා ලැබූ මන්දීරේ මටම හිමිවූ මල්සර හීසරින්"},
{"title": "දුර යන්න හිතුවාට", "artist": "සශිකා නිසංසලා", "author": "Unknown", "lyrics": "දුර යන්න හිතුවාට සැඟවි හොරෙන් ඔබ නැතුව මම ඉන්නේ කොහොමද ඉතින් වාවන්න බැරි කඳුළු ආවත් නෙතින් හුස්මක් දුරින් ඉන්න මට බෑ ඔබේන් අවුතැන් වෙලා ළැමතුරේ පෙම් හැඟුම් හීනෙකින් හෝ තවකෙකුට ඔබ නොදමි මං එක්වෙන්න සංසාරේ පිං මදි නම් අපි දෙන්නා එකතැනම මිය යමු ඉතින් දහසක් නුවන් මා දෙසම නපුරෙන් බලන් ඉන්නා නිසා හමුවෙන්න බෑ අපට දැන් එක්වෙන්න සංසාරේ පිං මදි නම් අපි දෙන්නා එකතැනම මිය යමු ඉතින් දුර යන්න හිතුවාට"},
{"title": "අප හමුවුන තැන තනියෙන්", "artist": "සශිකා නිසංසලා", "author": "Sajith Chathuranga", "lyrics": "අප හමුවුන තැන තනියෙන් ඔබ විතරමයි ඉන්නේ ඔබ හැරගිය හැටි සතුටින් ඉන්නවද නෑ දන්නේ කවදාවත් ඔබ නාවත් තරහ නෑ හිතුනේ එක පාරක් දුටුවානම් කඳුළු නෑ දෙන්නේ මතකේ අපගේ රැදිලා මනසේ සුසුමන් නිතැතින් පිරුනත් දෙහදේ කවදාවත් ඔබ නාවත් තරහ නෑ හිතුනේ එක පාරක් දුටුවානම් කඳුළු නෑ දෙන්නේ අප හමුවුන තැන තනියෙන් පැතුවත් හැමදා උපදින සසරේ එක්වන්නට බෑ මගෙ රත්තරනේ කවදාවත් ඔබ නාවත් තරහ නෑ හිතුනේ එක පාරක් දුටුවානම් කඳුළු නෑ දෙන්නේ අප හමුවුන තැන තනියෙන්"},
{"title": "කොහේ කොතැනක", "artist": "සේනානායක වෙරලියද්ද", "author": "Unknown", "lyrics": "කොහේ කොතැනක තැනේවිදෝ අපට ලෝකයක් අපි අපේම ලොවක් තනා ගැන්ම සිහිනයක් සැබෑම සිහිනයක් පුංචි පුංචි ගෙවල් තනා අතු අග ඉගි බිගි කරනා කුරුළු කිරි‍ලියේ මට නම් මේක සිහිනයක් සැබෑම සිහිනයක් කොහේ කොතැනක රංචු රංචු සමනලයෝ මල් ඉති සිඔ සිඔ සරනා මගේ කැදැල්ලට කොදුරා දේදෝ සහනයක් සැබෑම සහනයක් කොහේ කොතැනක"},
{"title": "අදහන්න බෑ", "artist": "සශිකා නිසංසලා", "author": "Unknown", "lyrics": "අදහන්න බෑ ඔබද මේ සිදලන්නේ ඇයි ප්‍රථම ප්‍රේමේ ආදරේ විශ්වය කිමැයි ඔබ නේද මා හා කියුවේ සුසුමින් ගෙතු පද නිම් නොවු කවියක්ද ඒ ආදරේ… කවියක්ද ඒ ආදරේ… ගිම්හානයේ සුහුබුල් සඳේ නැබුල් මලක් රහසින් සැලී මල් සැඟවුනා පෙති හැකිලුනා සඳ සැඟවුනා තරු වැලපුනා අසරණ වෙලා මා නෙතු දිය වුනා පිනි බිංදුවේ විහගුන් තුඩේ සැඟවි ගීයාදෝ කවි වැල් ගෙතු මේ බිම් තෙරේ මේ තුරු ඉමේ සලකුණු මැකී නෑ සෙවනැලි සැලේ කදුළක් කලා මා ජීවිතේ අදහන්න බෑ ඔබද මේ……… කවියක්ද ඒ ආදරේ"},
{"title": "කෙහෙරැල් කඩාගෙන", "artist": "සේනානායක වෙරලියද්ද", "author": "Unknown", "lyrics": "කෙහෙරැල් කඩාගෙන ආදර අරුණැල්ලේ නාඹර නුරා නුඹ ළඟ ඉඳ දිය නෑවේ බැල්මෙන් කතාවෙන් කලබලයක් නැත්තේ කොහොමද ළඳුනි ඔය විධියට හැඩ බැලුවේ නිතරම පෙරෙන්නේ සරදම් කවට කතා සියොළඟ දුවන්නේ පියකරු සුපෙම්වතා වන වදුලක සැඟවුණ සිව්පාද සතා සමග ඔබී ඔබෙ කරවට කිඳුරු පබා කෙහෙරැල් කඩාගෙන ආදර අරුණැල්ලේ පුරඟුන් නිදන ඉස්තාලය අතේ අරන් අරියාදුවට දුන් සිනහව සින්න කරන් කයිවාරුවට නවගුණ වැල තුරුළු කරන් කිරිගරුඬෙන් බේසම ළඟ පතුල බලන් කෙහෙරැල් කඩාගෙන ආදර අරුණැල්ලේ"},
{"title": "කන්ද පිරිමැද", "artist": "සේනානායක වෙරලියද්ද", "author": "Siyabalagamuwe Amaradasa", "lyrics": "කන්ද පිරිමැද පිරිමැද පිරිමැද ලන්ද මුදුනට මුදුනට මුදුනට ඒවි හඳ පායලා වන්දනාවක යන්නෙ කොහොමද නංගියේ අපි දැන්ම මග බැහැලා අරලියා මල් ඔහේ පිපුනට පෝය නෑ ඇවිදින් ගෙවා අටවක වැඩෙයි අවසඳ නොවී ඉමු ඉක්මන් කන්ද පිරිමැද පිරිමැද පිරිමැද ලන්ද මුදුනට මුදුනට මුදුනට ඒවි හඳ පායලා වන්දනාවක යන්නෙ කොහොමද නංගියේ අපි දැන්ම මග බැහැලා ගෙදර බුදුනගේ ඇල්ම බැල්මේ අමාවක ගෙවපන් පුරා පෝයට මලුත් අරගෙන අපිත් යමු පන්සල් කන්ද පිරිමැද පිරිමැද පිරිමැද ලන්ද මුදුනට මුදුනට මුදුනට ඒවි හඳ පායලා වන්දනාවක යන්නෙ කොහොමද නංගියේ අපි දැන්ම මග බැහැලා"},
{"title": "දුක තද කරන්", "artist": "සේනානායක වෙරලියද්ද", "author": "Keshan  Perera", "lyrics": "දුක තද කරන් මහමෙර තරම් මට ඉන්න බෑ ඔබ නැතිව නම් අපි හමු වුනත් ඉඳහිට යළිත් එක් වෙන්න බෑ කවදාකවත් නිතර වැටෙනා කඳුළට ඉතින් කතා කරගන්න පුලුවන් නම් කියයි හඬගා ලොවට මතු දා ඔබට මම ආදරේ කියලා දුක තද කරන් මහමෙර තරම් මට ඉන්න බෑ ඔබ නැතිව නම් විටෙක ළං වෙලා විටෙක වෙන් වෙලා ගෙවෙන අපේ ආදරේ කෙළවරක් සොයා තවම තැවෙනවා මැරී මැරී ජීවිතේ කොහොම පිළිගන්නේ මම නම් ඔබේ දෑත අහිමියි කියා දුක තද කරන් මහමෙර තරම් නොනිද රෑ පුරා දෙතැනකට වෙලා හිමි අපේ ඉරණමේ දැනෙන වේදනා වචනයෙන් කියාගන්න බෑ පණ මගේ නොදක හිනැහෙන්නේ කොහොමැයි කියා දෙන්න ඇවිදින් සොයා දුක තද කරන් මහමෙර තරම් නිතර වැටෙනා කඳුළට ඉතින්"},
{"title": "කඳුළු බිංදුව", "artist": "සේනානායක වෙරලියද්ද", "author": "Unknown", "lyrics": "මටම පෙම් කර නෙතග නිවසන සද නොසිඳෙන සුනිල උල්පත කඳුළු බිංදුව සමනලිය නෙත ලැගුම් ගෙන හුන් නුඹව පළවා හැරිය දා මං උන්හිටිය තැන් අහිමි වීමෙන් උන්හිටිය තැන් අහිමි වීමෙන් ම වෙත වෙර බැඳ පිටව ගිය නුඹ කඳුළු බිංදුව මටම පෙම් කර නිදැල්ලේ ඔහෙ ඉගිල ගිය ඇය මගේ විජිතෙන් වහන් වුණු සඳ කොහේදෝ හිඳ ජීවතුන් මැද කොහේදෝ හිඳ ජීවතුන් මැද ම වෙත පෙම් බැඳ පැමිණි සකි සඳ කඳුළු බිංදුව මටම පෙම් කර"},
{"title": "දෑස් අග පිපී", "artist": "සේනානායක වෙරලියද්ද", "author": "Unknown", "lyrics": "දෑස් අග පිපී දිලිසෙන කඳුළු කැට වලට නොදැනෙන හීනයක් වගේ ලස්සන ආදරේ සොයා හ්ම් හ්ම් හ්ම් හ්ම් පාරමී පුරා සසරක ඇවිද එන ඔබේ පසු පස සුළඟ සේ වෙලී සනසමි ආදරේ කියා හ්ම් හ්ම් හ්ම් හ්ම් ඉස්සරත් දෙනෙත් රැවටූ රත්තරන් පාට හීනේ අදත් දකින්නට ආසයි හිඳිමි නෙත් පියා ආකහේ දුරින් හිඳගෙන සීතලේ ගැහෙන තරුවක ජීවිතේ සතුට තවරමි ඔබ මගේ නිසා ජීවිතේ සතුට තවරමි ඔබ මගේ නිසා ඔබ මගේ නිසා දෑස් අග පිපී දිලිසෙන අදත් ආකහේ දුරකින් හැංගිලා බලයි පුර හඳ ඒ ඔබයි බලා සැනසුණු අතීතේ කතා ඈතකට ගිහින් හැංගෙයි ඔබ මගේ ළඟින් හිනැහෙයි ඉන්න ළඟ ඉන්න සෙනෙහස සදාකල් නිසා ඉන්න ළඟ ඉන්න සෙනෙහස සදාකල් නිසා සදාකල් නිසා දෑස් අග පිපී දිලිසෙන"},
{"title": "අර සඳ පළුවෙන්", "artist": "සේනානායක වෙරලියද්ද", "author": "Unknown", "lyrics": "අර සඳ පළුවෙන් නුඹව පෙනෙයි පාළු සිතේ විඩා නිවෙයි මේ සුවිසල් පුර තනිව ඉන්නට මට ඔය සිත සවිය ගෙනෙයි තුරු හිස සිඹ සිඹ වැද මද නළ මුමුණන විට ගී සවනට අපි ඇල් හේනේ පැල් මැස්සේ ගැයූ ගීත එයි සිහියට හිත වාවනු බැරි වී එන්නට හිතුනත් ආපසු ගම රට හෙට අදට වඩා හොඳ වේ යැයි කොඳුරයි රහසින් යටි හිත අර සඳ පළුවෙන් නුඹව පෙනෙයි අග හිඟ මාලය ගෙල ළාගෙන දුක විඳින්න බැරි හින්දම මට වෙස්සන්තර රජු වාගේ දරු දන්දෙනු බැරි හින්දම පෙර සෙනෙහෙ සිතින් අපි දෙන්නා උන් හැටි සිහියට අරගෙන හොඳ පරිස්සමින් මං එනතුරු ඉන්නවා නේද මගෙ රන් කඳ අර සඳ පළුවෙන් නුඹව පෙනෙයි"},
{"title": "ඇහි දාර මත දුක", "artist": "සේනානායක වෙරලියද්ද", "author": "Unknown", "lyrics": "ඇහි දාර මත දුක දෝරෙ ගැලුවට නෑ ඔබ එන්නේ හිත වදදේවී ඔබ ඉල්ලලා ඔබ ඉල්ලලා කවියාක් වාගේ ජීවාත් වෙන්න තාලේ ගෙනවීත් දෙන්න පද වැල් එළි වැටේ ළඟම නතර වෙලා ආදරෙ නමෙන් මියැදෙන්න හැදුවත් දුකමයි සෙතක් වෙන්නෙ නෑ හිත පිළිගන්නේම නෑ ඇහි දාර මත හිතුවාත් ගලන ගඟ සේ ඉන්න බාදා අතැරලා ගලන ආදර කතරෙදි හිඳිලා ගියා ආදරෙ නමෙන් මියැදෙන්න හැදුවත් දුකමයි සෙතක් වෙන්නෙ නෑ හිත පිළිගන්නේම නෑ ඇහි දාර මත"},
{"title": "ඇහි දාර මත දුක", "artist": "සේනානායක වෙරලියද්ද", "author": "Unknown", "lyrics": "ඇහි දාර මත දුක දෝරෙ ගැලුවට, නැ ඔබ එන්නේ හිත වද දේවී ඔබ ඉල්ලලා, ඔබ ඉල්ලලා කවියක් වාගේ ජීවත් වෙන්න, තාලේ ගෙනැවිත් දෙන්න, පදවැල් එලි වැටේ ළඟම නතර වෙලා ආදරේ නාමෙන් මියැදෙන්න හැදුවත්, දුකමයි සෙතක් වෙන්නේ නෑ, හිත පිළිගන්නෙම නෑ ඇහි දාර මත හිතුවාත් ගලන ගඟ සේ ඉන්න, බාධා අතැරලා ගලන ආදර කතරේදී හිඳිලා ගියා ආදරේ නාමෙන් මියැදෙන්න හැදුවත්, දුකමයි සෙතක් වෙන්නේ නෑ, හිත පිළිගන්නෙම නෑ ඇහි දාර මත"},
{"title": "විසේකාර අරුමැත්තී", "artist": "රනිදු ලංකාගේ", "author": "Unknown", "lyrics": "විසේකාර අරුමැත්තී නෙතින් කතා පවසන්නී සුමුදු වදන් තෙපලන්නී ගමේ පුංචි හැඩකාරී හිතේ සතුට මාගේ ඔබමයි ඔය මුහුණට ලොබ බැන්දේ ගයන ගීය මාගේ සැමදා ඔයාටමයි මගේ කෙල්ලේ විසේකාර අරුමැත්ති නෙතට හොරා පැනයන්නි කෝල වදන් මුමුනන්න මගේ පුංචි හැඩකාරී අරුමේ හීන බැඳුනු දා නියරේ පාද පැටලුනා හදෙහි ගැස්ම වැඩි වුනා මාගේ ආදරයේ හීනේ නැකත් ලියුනු දා ඇඹුලේ රසය වැඩි වුනා සතුටේ කඳුළු ඉතිරුනා මගේ ජීවිතයේ පෑයූ හිරු සේ ඔබ නිතිනා දිවියේ සොඳුරුම තැන හිඳුනා ගොයමේ අරුමය කිරි වදිනාමාගේ ආදරේ විසේකාර අරුමැත්තී අරුමේ හීන බැඳුනු දා විසේකාර අරුමැත්තී"},
{"title": "හාදු වැස්සේ තෙමිලා", "artist": "රදීශ්  වැන්දබෝනා", "author": "Unknown", "lyrics": "හාදු වැස්සේ තෙමිලා ආදරේ දුන්නා නීල දෑසේ ගිලිලා ජීවිතේ හෙව්වා නුහුරු නුපුරුදු හැඟුම් ගානක් රෑ පුරා මැවිලා ආදරේ වැහැලා සුවද ළමැදේ රැදුනු හැම දේ කවියකින් ලිව්වා ඉරට සද සේ ඉමුද අහසේ ආදරෙන් කිව්වා සුන්දරයි ඉතින් ජීවිතේ හෝ ඒ තරම් ගලයී ආදරේ සොදුරියේ හාදු වැස්සේ තෙමිලා ආදරේ දුන්නා මහද ගැඹුරේ ඇදුනු සෙනෙහේ ඔබට මා පිදුවා සයුරු පතුලේ හැදෙන මුතු සේ ඔබ වටී කියුවා ඒ තරම් ඔබයි ජීවිතේ ම්ම් සුන්දරයී ඉතින් ආදරේ සොදුරියේ හාදු වැස්සේ තෙමිලා"},
{"title": "මේ ගඟ ගලන්නේ", "artist": "ප්‍රියංකා  ගමගේ", "author": "Priyanka Gamage", "lyrics": "මේ ගඟ ගලන්නේ අඳුරු තුරු ගොමු අතරින් නේක රිදවුම් ඉවුරු බිඳිමින් දැනෙන මොහොතෙත් හැඩවෙමින් මේ ගඟ ගලන්නේ නේක අවමන් විදිමින් ලෝකයෙන් ලද සරදම් නිහඬ ලය යට සඟවන් සසල සැඩ රළ නිසල කර කර ගඟ ගලයි සංවේගෙන් මේ ගඟ ගලන්නේ ඔබට දුන් මේ සිහිලැල් නැවත ලැබුවේ ගිනිදැල් ඔබගේ නෙතු අග කඳුළු දුටුවම ගඟ ගලයි සංවේගෙන් මේ ගඟ ගලන්නේ"},
{"title": "පෙම් සිහිනේ", "artist": "ප්‍රදීප්  රංගන", "author": "Pradeep  Rangana", "lyrics": "ආදරයේ පාවෙන හැඟුමක් ජීවිතයක් සෙව්වා පුරාණේ මගේ වූ ඔබේ ආදරේ මිරිඟුවක් තනිකමක් විතරමයි පෙම් සිහිනේ සිත සැනසූ සේයාවී ඔබ මාගේ සිත රැවටූ මායාවී මා ළඟින් ලංවෙලා - ඔබ එදා කී කතා මගෙ දිළිඳු ලෝකෙ මාළිඟාවක් කළා ඒ තැනූ මාළිඟා - සුන්වෙලා ගිය දිනේ අඬන්න කඳුළු ඉතිරි නොකර යන්න ඔබ කියා පෙම් සිහිනේ සිත සැනසූ සේයාවී ඔබ මාගේ සිත රැවටූ මායාවී වස්සානයේ තනිවෙලා - තුරුළු වී උණුසුමේ දෑඟිල්ලේ පැටලී උන් සැඳෑව සුන්දරයි නුඹ මගේ හැම භවේ - දිව්රලා සෙනෙහසින් කී කතාව මාගෙ ලෝකෙ තනිවෙලා ගියා පෙම් සිහිනේ සිත සැනසූ සේයාවී ඔබ මාගේ සිත රැවටූ මායාවී"},
{"title": "මිතුරේ පවසන්", "artist": "ප්‍රිහාන් මඩප්පුලි", "author": "Unknown", "lyrics": "(මිතුරේ කියන් ) මිතුරේ කියන් මා දෙස  බලන් ඔබ මා නෙත් හමුවිය හැකිදෝ එදා පටන් අද වනතුරා ඔබ හද රිදවන්නට මා කිමක් කලදෝ කිමක් කලදෝ කිමක් කලදෝ මිතුරේ පවසන් දිවියේ එන හැඟුමන් කිසිවක් කරමින් මඟ හරවන්නේ ඔබගෙන් සඟවා සිටිනා සෑමදා පරලොවකට සම වූවා මේ ජීවිතේ පරලොවකට සම වූවා මේ ජීවිතේ (මිතුරේ මිතුරේ) (දිවියේ දිවියේ) මා ඔබ හට අත හිත දී සැපටත් දුකටත් සමවී කිසිදා තනිකර නොදමා ඇයිදෝ මෙලෙසේ මා ලෝකය අඳුරු කලේ ඔබ හට මා නොදෙමි සමා සොයුරන් සේ අප හැදී වැඩී කිසිදාවත් නෑ සිටියේ වෙන් වී ඔබ දෙදෙනා අතරේ අගහිඟකම් ඇති වුයේ කිමදෝ කියා පවසන් මිතුරේ පවසන් දිවියේ එන හැඟුමන් කිසිවක් කරමින් මඟ හරවන්නේ (ඔබ අප මිතුදම ඇයි බිඳ දැමුවේ) ඔබගෙන් සඟවා සිටිනා සෑමදා පරලොවකට සම වූවා මේ ජීවිතේ පරලොවකට සම වූවා මේ ජීවිතේ ඔබ දෙදෙනා අතරේ අගහිඟකම් ඇති වුයේ කිමදෝ කියා පවසන් මිතුරේ කියන් දිවියේ එන හැඟුමන් කිසිවක් කරමින් මඟ හරවන්නේ ඔබගෙන් සඟවා සිටිනා සෑමදා පරලොවකට සම වූවා මේ ජීවිතේ පරලොවකට සම වූවා මේ ජීවිතේ පරලොවකට සම වූවා මේ ජීවිතේ"},
{"title": "මට වාසනා ඔබ මට වාසනා", "artist": "ප්‍රියා සූරියසේන", "author": "Premakeerthi De Alwis", "lyrics": "මට වාසනා ඔබ මට වාසනා උපන් නූපන් හැම ආත්මයේ මට ඔබ ඔබ මට වාසනා ඔබ මට මට ඔබ වාසනා ඔබේ නෙත් දොළොස් මහේ පහණ වේ කල මැන දල්වන්න ආරාධනා පෙර භවයේ වියෝග අඳුරේ නිවුනු තැනින් මට වාසනා ඔබ මට වාසනා සුරතින් සුළං මුවා කරලමි නොනිමනු මැන ප්‍රේම ප්‍රාර්ථනා අප අපගේ අනෝම ඇසුරේ වෙලෙමු සදා මට වාසනා ඔබ මට වාසනා"},
{"title": "මගේ සැමරුම් පොතේ", "artist": "ප්‍රියා සූරියසේන", "author": "Unknown", "lyrics": "මගේ සැමරුම් පොතේ රෝස පිටුවක් පුරා පුංචි නිල්පාට අකුරින් ලියා නොයමි හැරදා ඔයා ඔබ මගේ යැයි කියා පැතුවේ සිතුවේ බොරුවටද ඔයා… පාසල හැර අපි වෙන්ව ගියා මතක සේයා මවා ඔබ ලියුදේ තියා කී දේවල් පවා සුළෙඟ් විසිරි දුවිල්ල වාගේ… උණුසුම් ආදර වදන් ඔබේ අද ඇතේ තනිවෙලා මා සිතින් වැළපිලා සොඳුරු සැමරුම් බලා සැමදා මෙලෙසේ සිහිකරමි ඔයා…"},
{"title": "මහ සයුරේ රැළි", "artist": "නොයෙල් රාජ්", "author": "Unknown", "lyrics": "මහ සයුරේ රැළි ‍ගොඩට ගලනවා හමන සුළං සිසිල  ගෙනෙනවා මල් සුවද සොයා බඹරු ඇදෙනවා සිත ඔබහට ආදරේ වෙනවා එය පුදුමයක් නොවේ අන්ධයිලු ආදරේ දැන දැන සිත වැරදිකරනවා එළිය සිසිල වාගේ ලස්සන සිනහව ඔබගේ දැක්කම සිත මුරණ්ඩුවෙනවා දුර තරු ගනින්න බැහැනේ ඔබ අන් හදකට හිමිනේ සිත හෙමිහිට කඳුළු සලනවා මහ සයුරේ රැළි මල් නටුවේ කටු ඇත්නම් ඝනදුරු රැය රුදුරුයි නම් සිතේ පැතුම් ඉටු නොමවෙයි නම් ඔබෙ ආදරේ මට නැතිනම් එය පුදුමයක් නොවේ නම් කඳුළින් සුභ පතමි මං මහ සයුරේ රැළි"},
{"title": "සිත ඔබට මුවාවී", "artist": "නිරෝෂා විරාජිනී", "author": "Unknown", "lyrics": "සිත ඔබට මුවාවී ඉකිබිදිනා ඔබ ඇය හා සිනාසි සුව විදිනා ප්‍රේම ලොවේ දොර කවුලු වැසී සිත ඉකිගසමින් හඩනා හැටි සිත පෙමට මුවාවු දා ඉදලා සිත ඉවසන්නෑ කොපමණ සිතුවත් දුක අඩු වී නෑ කොපමණ හැඩුවත් ඔබ පෙම් කර නෑ මා පෙම් කෙරුවත් සිත පෙමට මුවාවු දා ඉදලා සිත ඔබට මුවාවී සිත පිළිගන්නෑ ඔබ ඇගෙ කීවත් දුක අඩුවක් නෑ ඔබ හමුවුවත් ඔබ සමුගෙන නෑ ඇය සැනසුවත් ඔබ ඇයට ලගා වු දා ඉදලා සිත ඔබට මුවාවී"},
{"title": "සුදු මුතු රළ පෙළ", "artist": "ජයරත්න T.M. සමග නීලා  වික්‍රමසිංහ", "author": "Unknown", "lyrics": "සුදු මුතු රළ පෙළ කිඳුරු කොදෙව්වේ පාවඩ පලස එලා සිඳුලඳ ගෙනදුන් මුතු කැකුලක් සේ ඔබ මට තිලිණ වෙලා යුගදිවි වැල්ලේ අඳුරු ඉස්සව්වේ මුකුලිත සිතැඟි සලා අරුණැල්ලක්සේ අරුණැල්ලක්සේ  නුඹ මිණ පායා සනහස ජනිත කළා සුදු මුතු රළ පෙළ සැඩ රළ රැල්ලේ සැලෙන කැදැල්ලේ රැඳුනෙමි සරණ සොයා පවනැල්ලක්සේ පවනැල්ලක්සේ නොම හැර ආවෙමි ඔබ හද සැදෙන තුරා සුදු මුතු රළ පෙළ"},
{"title": "මී අඹ අත්තේ", "artist": "මිල්ටන් මල්ලවාරච්චි සමග නීලා  වික්‍රමසිංහ", "author": "Unknown", "lyrics": "මී අඹ අත්තේ කොහෝ කොහෝ දොලොස් මහේ මගුල් දොහේ රබාන රත්වෙන නැකත් වෙලාවට නළාව පිබහන් කොහෝ කොහෝ විරා නිවෙන් එලි ගොයම් ලියද්දේ උඩින් උඩින් වර පෙත්තප්පූ හෝරාවෙන් නොනගතේ ගෙවෙද්දී නෑ ගම් එනවද පෙත්තප්පූ ගම් මැද්දේ සරු අවුරුදු දා පච්ච වඩම් පළඳා මී අඹ අත්තේ ඉහතෙල් ගාලා ආදර අතකින් ඉහෙන් බහින උවදුරු දුරු වී නෙත් දෙක වාගේ අයිය නගාලට පින් පල දේ අවුරුදු ජය වී එක මව් කුසයේ උප දීවා මතු මතු සංසාරේ මී අඹ අත්තේ"},
{"title": "චන්දන ඇග ගාලා", "artist": "නාරද  දිසාසේකර සමග මල්ලිකා  කහවිට", "author": "Unknown", "lyrics": "චන්දන ඇග ගාලා කොන්ඩෙ කඩා දාලා ගඟුලේ වෙලීලා ටිකිරිමලී නාලා වගේ වෙලේ පැලේ දී හා පැල් කවි කියලා පැල් රැකලා මහරෑ සිලිඳු උදේ ආවා වගේ වී කොටලා ඊයේ හවස මං නාගත්තා අවදිවී උදෙන් වී කොටලා ඊයේ හවස මං නාගත්තා අවදිවී උදෙන් ගම්මූ අපි වාගේ කම්මැලිවී බෑනේ චන්දන ඇග ගාලා සිහි නැති ගැහැනියක් මා වගේ කලේ මතක නැතිවුනා ගඟේ සිහි නැති ගැහැනියක් මා වගේ කලේ මතක නැතිවුනා ගඟේ මොටද හැරී යන්නේ කවුද ඕක ගන්නේ චන්දන ඇග ගාලා"},
{"title": "රොසලිනා", "artist": "නලින් පෙරේරා", "author": "Unknown", "lyrics": "රොසලිනා රොසලිනා රොසලිනා මගේ රොසලිනා අයරින් තරහා උනා කැතරින් පැනලා ගියා මැගිලින් ඩුබායි ගියා මට කවුරුත් නැතිව ගියා එපා එපා එපා යන්න එපා එපා එපා එපා යන්න එපා එපා එපා එපා යන්න එපා එපා එපා එපා එපා දාල යන්න එපා රොසලිනා රොසලිනා රොසලිනා මගේ රොසලිනා කොණ්ඩය දිග හින්දා ඇඟපත මදි හින්දා අතමිට නැති හින්දා මගේ අයරින් තරහා උනා සංගීතය හින්දා මුළු රෑ නිදි මරලා දවසම බුදි හින්දා මගේ කැතරියා පැනලා ගියා එපා එපා එපා යන්න එපා රොසලිනා රොසලිනා රොසලිනා මගේ රොසලිනා සල්ලිම ඉල්ලාලා මට කරදර කරලා දුන්නේ නෑ කියලා මගේ මැගිලියා ඩුබායි ගියා මට ආදරේ කරලා රොසලින් වෙන්ව නොයා ඉන්නකෝ ළඟට වෙලා මගේ රන් කඳ තමයි ඔයා එපා එපා එපා යන්න එපා රොසලිනා රොසලිනා රොසලිනා මගේ රොසලිනා"},
{"title": "ඔබ මුලාවී", "artist": "නාමල් උඩුගම", "author": "Unknown", "lyrics": "ඔබ මුලාවී මා සොයාවී ඔහුගෙ ආදරෙන් ඉවත් වෙලා ඔබ සිතාවී මතු දිනේ මාගේ ආදරේ ලැබෙයි කියා බඹරු මලින් වෙන්වන්නේ නෑ රොන් අරගෙන ආයේ නොයන් නෑ රොනේ සුවඳ සිතන් යන්නෙ නෑ එලෙස ඔබට ඔහු කරන්නෙ නෑ ළහිරු කිරණ දුටු සැනෙකින් වාගේ විකසිත වුණ මල ඔබ ඒ වාගේ පැතුවත් හදවත ගන්න මට මාගේ මගේ ආදරේ ඔබට දෙන්නෙ නෑ"},
{"title": "බස් එකේ දැක්කේ", "artist": "Funky  Dirt සමග මුර්ෂාර්ඩ්  හුවයිස්", "author": "Unknown", "lyrics": "බස් එකේ දැක්කේ - මා හා සිනා පෑවේ පුසුඹේ බැරුවා - මා ලඟින් වාඩිවුන්නේ ජනේලයෙන් අහක බැලුවේ මා දෙස හොරෙන් බැලුවේ කොටුවට ටිකට් ගත්තේ - ඒ ලඟම හදත් ගත්තේ වංගු ලාල ලාල ලාල ලා වංගු ලාල ලාල ලාල ලා හෝන් සද්දේ ඇසේ සංගීතයක් සේ ට්‍රැෆික් එකේ වෙනස් වේ දැනේවී පෙම් සිසිලේ ඈ ළඟ සිටින වේලේ හෘදේ සාදයක් සේ මං ලෝකේ පාරාදීසේ මැවේවි හයිලෙවල් පාරේ ළඟින් මෙසේ මෙ බස් එකේ මේ රූට් එකේ මුණ ගැසෙයි කියා සිතා හිතා මතා ඇහෙන වෙලාවටම එන්නේ හිටන් යන්නෙ - ඉදන් යන්නෙ දුරින් ඉන්නෙ - ලඟින් ඉන්නෙ සාරි අදින - ස්කර්ට්ස් අදින සුරගනක්ද ඔෆිස් යන්නෙ වංගු ලාල ලාල ලාල ලා වංගු ලාල ලාල ලාල ලා කලින්ම පැනල වෙනද ගෙදර යන්නෙ මං ඈ හින්දා කට්ට කාලා ඉන්නෙ මඟ බලන් බස් එකේ සුන්දරියේ සඳ වතියේ මගෙ හෝල්ට් එකට පෑයුවේ බස් එකේ දැක්කේ"},
{"title": "දැවෙනා දුක මේ", "artist": "නදීර  නෝනිස්", "author": "Sajith Chathuranga", "lyrics": "දැවෙනා දුක මේ වාවනු බෑ කඳුලැල් දෙනෙතේ බාරගන්නෙ නෑ මා තරම් කවුරුවත් ඔබට නම් ආදරේ කරන් නෑ තනියෙන් ගෙවෙනා තත්පරෙත් අපේ මටනම් දැනුනේ කල්පයක් වගේ නැතිකම් දෙනෙතින් දකිනකන් මගේ ඔබමයි උන්නේ දැවටිලා හදේ අපෙ පෙම් කතන්දරේ - අද නතර වී ගියේ දුප්පත් කමටයි මගේ දැවෙනා දුක මේ දෙනුවන් පියෙනා කාලයට මගේ වැඩිකල් නැති බැව් හිත කියයි ඔහේෙ නැති මුත් වටිනා මුතු මැණික් අතේ තවමත් ඔබටයි ආදරේ කලේ සැනසුම අරන් මගේ - මට වැඩිකලක් නොවේ නිදුකින් ඉනු මැන පණ මගේ දැවෙනා දුක මේ"},
{"title": "සිනහවයි කඳුලයි සදා", "artist": "මොරිස්  දහනායක", "author": "Unknown", "lyrics": "සිනහවයි කඳුලයි සදා ලෝකයේ බල දෙක මහා සිනාසී හැඬුවත් හඬා සිනා පෑවත් එක තමා සුදෝ පොඩ්ඩක් අඬන්න හරිම ආසයි බලන්න ඔයා ලස්සන අඬන විටදී කඳුළු බිඳුවක් හෙලන්න ඔයා හෙළු කඳුලැලි අගේ ගලන විට කම්මුල් දිගේ දිමුතු මුතු වාගේ පෙනෙන්නේ ලස්සනක් නැහැ ඔය වගේ සුදෝ පොඩ්ඩක් අඬන්න බොරු කියා ඔබ හැඬෙව්වත් ලපටි හදවත රිදෙව්වත් මගේ ආලය මමයි දන්නේ නැහැ වෙනස්කම් සිතින්වත් සුදෝ පොඩ්ඩක් අඬන්න රත්තරන් අත් දෙක තබා අඬන විට ඔබ ඉකි ගසා මගේ ආලය තවත් වැඩිවේ තවත් අඬවමි බොරු කියා සුදෝ පොඩ්ඩක් අඬන්න"},
{"title": "මගේ ඔරුකඳත් දිරාලා", "artist": "නලින් පෙරේරා", "author": "Unknown", "lyrics": "මගේ ඔරුකඳත් දිරාලා කොල්ලෑවේ ලණු කැඩීලා නමුත් මුහුදු යායුතු රැක ගන්න ජීවිතේ මගෙ බිරිඳ නිදිමරන් සාදා දුන් බතුත් අරන් මහ සයුරට යන්නේ හද පුරවා ගෙනත් පැතුම් අව්ව සැරයි සුළන් වැඩියි සැඩ සුළගින් රුවලත් ඉරිලා යයි මහ සයුරේ රළ නැග ඒවී ජීවන මරණය අතර සටනකි මහ දියඹේ අඝාදයේහි දරුවන් රකින්න ඈතට යනවා තෝරුන් හා ලොකු ලොකු මෝරුන් මම වෙරළ පුරා ගොඩට ගේනවා වෙරළ දිගේ සුදු වැල්ලේ මා එනතුරු දරුවන් මග බලා හිඳී වෙහෙසවෙලා දවස ගෙවාලා මම දෙවි පිහිටෙන් ආපසු එන්නේ"},
{"title": "මෙත් මල් පිබිදේවා", "artist": "මොරිස්  දහනායක", "author": "Unknown", "lyrics": "මෙත් මල් පිබිදේවා සිත් තුල මෙත් මල් පිබිදේවා කරුණා ගුණ දේවා සිත් තුල කරුණා ඉතිරේවා තණ්හා අශා වෛරේ ක්‍රෝධේ සංකා නැති වේවා පාපේ ද්වේශේ මෝහේ මානේ මෙලොවින් දුරු වේවා මෙත් මල් පිබිදේවා සමගිය සාමේ දෑ අනුරාගේ යුතුකම් රජවේවා හොර බොරු වංචා බිය සැක දුරු වී සැමටම සෙත් වේවා මෙත් මල් පිබිදේවා"},
{"title": "අංජලීකා", "artist": "නලින් පෙරේරා", "author": "Unknown", "lyrics": "මල මිලින වෙලා මුඳු සුවඳ ගලා මගේ ලොවම වෙලා ඇත තවමත් අංජලිකා සඳ නැතද රැයේ නිල් සළුපිලියෙන් සුරඟනක වෙසින් ඔබ තමත් හිනැහෙනවා අංජලීකා මට පෙනෙන දුරින් මට ඇහෙන සරින් තවමත් ඔබ සිටී බලා මද සිනහා මුවින් තවමත් මෙගේ අංජලිකා අංජලීකා"},
{"title": "මෙහෙණියක වී", "artist": "නාමල් උඩුගම", "author": "Unknown", "lyrics": "මෙහෙණියක වී සසර කතරින් එතෙර වන්නට පාරමී පුරනා ඔබ පෙම්වතියක ලෙසින් එදා මා පෙමින් එදා මා ළඟ උන්නා අවිහිංසක ඔබ අවිහිංසක මා දෙගුරුන් හමුවේ ගැරහුම් ලැබුවා මා රිදවන්නට නොහැකිව ඔබෙ හද දහස් වරක් දෙගුරුන් රිදවූවා පළිගන්නට මිස පිළිගන්නට මා දෙගුරුන් ඔබගේ නොකැමති වූවා ඒ පාපෙන් දෙගුරුන් මුදවන්නට කසාවතට ඔබෙ වත දන් දුන්නා"},
{"title": "මේ වේදනා", "artist": "නාමල් උඩුගම", "author": "Unknown", "lyrics": "මේ වේදනා මට පවරලා වෙන් වී ගියේ ඇයි මා හඬවලා අදහන්න බෑ පිළිගන්නේ නෑ ඔබමද කියා පෙම් කල කෙනා ඒ ඔබට මා හිමි නෑ මටද ඔබ හිමි නෑ අන්සතු වෙලාදෝ මට මැව් කෙනා අපට අප හිමි නෑ සදා මේ වේදනා මට පවරලා වෙන් වී ගියේ ඇයි මා හඬවලා ළඟ උන්නු කාලේ කී කතා සිහිවේ අමතක වුනාදෝ නිස් කාරනා යලි මුණ ගැහෙයි නම් නාදුනන සේ මං මග හැරලා යන්නම් මතු හමු නොවෙන්නම් ඔබට මා හිමි නෑ කඳුළු අතරේ රඳවා තියාලා ඈතට වුනේ ඇයි රහසේ ඔයා යලි මුණ ගැහෙයි නම් නාදුනන සේ මං මග හැරලා යන්නම් මතු හමු නොවෙන්නම් ඔබට මා හිමි නෑ මේ වේදනා මට පවරලා ඔබට මා හිමි නෑ"},
{"title": "ලොවම නිදන රාත්‍රියේ", "artist": "නාමල් උඩුගම", "author": "Unknown", "lyrics": "ලොවම නිදන රාත්‍රියේ මා නොනිදන මේ රැයේ සිහින ගෙනාවේ ඔබ මා හමුවී එදා වෙන් නොවනා ලෙස කියා අප හදවත් එකට බැඳී කෙලෙස ඉමු කියා මා ආදරේ සඟවලා ඔබ ඔහු සමඟින් ගියා නැතිවද කුමරියේ ඔබට මා මතක්වෙලා"},
{"title": "මා මුව අගින්", "artist": "නාමල් උඩුගම", "author": "Unknown", "lyrics": "මා මුව අගින් හිනහුනා ඈගේ හැඟුම් පිබිදුනා ආදර ලොවක් ගැනද ඒ සිතන්නේ සොයුරියනේ ඔබට මගේ හද නොලැබෙන්නේ රුව දැකලා සිත පිරිලා හද බැඳිලා තැවෙනු එපා මා මුව අගින් මා තනිවී නෑ ලෝකේ මටද කුමාරියක් ඇතේ මා මුව අගින්"},
{"title": "බැසයන සඳ දෑතින්", "artist": "නාමල් උඩුගම", "author": "Unknown", "lyrics": "බැසයන සඳ දෑතින් නවතා ගන්නට බෑ පරවෙන මල දෝතින් වලකා ලන්නට බෑ ඔබ බැසයන සඳ නම් ඔබ පරවෙන මල නම් රැක ගනිමිද කෙලෙසින් මන්දාකිණීය ගලන නිසසල රැයක මැවෙන මැදියම් අඳුරේ සැගවී පවනැල් රහසේ සැඟවෙයි ඔබ ඒ අහස වගේ නම් හඳුනාගන්නද කෙලෙසින් නන්නාඳුනන ලෙසින ගිමනට සිසිල රැගෙන අවුදින් සිරුරේ දැවටී පවනැල් රහසේ හැරයයි ඔබ ඒ සුළඟ වගේ නම් හඳුනා ගනිමිද කෙලෙසින්"},
{"title": "ඉස්සර සෙනෙහස", "artist": "නාමල් උඩුගම", "author": "Unknown", "lyrics": "ඉස්සර සෙනෙහස තිස්සෙම හදතුල මැවි මැවි රිද්දනවා ඇස් දෙක වස්සන කඳුළැලි දුටුවෙමි ඔබ මට හිනැහෙනවා සුවඳක් දැනුණත් තවමත් ආසයි පණ මෙන් පිදු හින්දා මගේ අහිංසක හිත තැලුවත් නෑ තරහක් මට දැනිලා දම් පැහැ ගවුමයි රතුමල් කුඩයයි තාමත් තියෙනවද එපා වුණත් මා එපා දවන්නට ඒ ආදර තිළිණ"},
{"title": "අවාසනාවට රෝස මලත් පරවෙයි", "artist": "නාමල් උඩුගම", "author": "Unknown", "lyrics": "අවාසනාවට රෝස මලත් පරවෙයි කඩා වැටෙන්නට උණු කඳුළක් වැලපෙයි දරා ගන්න බැරි තරමට ආදරෙයි ඔයා රත්තරන් වරදක් කළා නොවේ ලියා හසුන්පත් තැන තැන හංගාපු ගලා බොඳව යයි ඒ ඇස් දෙකෙන් තෙමූ වලාකුලට රෑ සඳ නෑවිත් ඉඳපු එකම දවස අද විතරද මගෙ දෙවිඳු පතා නොසිටියත් සැප සම්පත් ඉසුරූ මහා යදම් බැඳ සිතුවිලි සිර කරපු මගේ නැගණියක් ලෙසින් සිතා මතූ අවසර දෙන්නම් අපි හිත හඳාගමු"},
{"title": "ඇස ගැටෙනා හැම තැනම", "artist": "නාමල් උඩුගම", "author": "Unknown", "lyrics": "ඇස ගැටෙනා හැම තැනම කොහේහෝ හිනැහී ඉන්නවා ඇස පියනා හැමවිටම හීනෙනුත් නුඹ ළඟ ඉන්නවා දහවල් පුරා මෙහෙම ඇවිදින් හීනෙන් වගේ පාරේ ඇවිදින් දවසම ගෙවී රෑට ඇවිදින් හීනෙන් හිදී ළඟට ඇවිදින් නුඹ මගේ, නුඹ මගේ, නුඹ මගේ මේ වාගේ කවදාවත් ළඟ ඉන්න බැරි බවත් දන්නවා නුඹ මාගේ ළඟ ඉන්න හීනෙන්ම දවසක් ගෙවෙනවා කාලේ ගෙවී සවස ඇවිදින් ඇහැරෙන්න වී දිනෙක හීනෙන් නුඹ පෙන්වූ ඇස් කඳුළු ඇවිදින් පිය වෙන්න වෙන දවස ඇවිදින් නුඹ මගේ, නුඹ මගේ, නුඹ මගේ"},
{"title": "අප හමුවීම වෙන්වීම දෝ ආදරේ", "artist": "නාමල් උඩුගම", "author": "Unknown", "lyrics": "අප හමුවීම වෙන්වීම දෝ ආදරේ මට රිදවන්නෙපා ආයේ සංසාරයේ මතු හැමදාම පැතුසේම ඔබ ආදරේ මේ අද වාගේ කඳුලින්ම වෙන්වී නොයන් පෙම්වන්තියේ මා හැඬුවා දරා ප්‍රේමේ නමින් වේදනා ඒ සිත යාමේ සැමරුම් කියා ලියවේවි මගෙ චේතනා රන් තාරකාවෝ දිලුණා එදා ගෙනදී නැවුම් කල්පනා මේ ආදරේ නාමයෙන් වේදනා මතුදා ගෙනේ ප්‍රාර්ථනා"},
{"title": "ගලන ගඟකි ජීවිතේ", "artist": "නන්දා මාලනී", "author": "Unknown", "lyrics": "ගලන ගඟකි ජීවිතේ දයාලූ ලෝකයේ මිහිර පතා ආදරේ ලපළු නටයි ගංතෙරේ වැලිතල කිති කවන නටන පෙම් රළ වැළ ඉවුරු බඳින මිහිතලයට සුවය දැනෙන උකුළු තලය බඳු නැලැවෙන ගලන ගඟකි ජීවිතේ පෙමට පෙම පුදා තුඩට තුඩු දිදී කුරුළු ගී නගයි ආදරේබැදීලා ගලන ගඟකි ජීවිතේ"},
{"title": "දෙනෝ දාහක් නුවන් අතරේ", "artist": "නන්දා මාලනී", "author": "Unknown", "lyrics": "දෙනෝ දාහක් නුවන් අතරේ කවුරුදෝ මා තනි කළේ තනි කළේ පාසැල් බිමේ සිනා කෙළිලොල් තෙපුල් රහසේ දෙඩූ තැන් අද ගොළු වෙලා සොඳුරු පාසැල් පියස කඳුලින් බොඳ වෙලා කැදැල්ලෙන් ඔබ වෙන් වෙලා නිබඳ ඔබ මා ඇවිද ගිය තැන් සෙවණ දුන් ගහ කොළ පුරා බිමට බරවුණු කැකුළු අතු ඉති මැලවිලා දුකින් හදවත ගොළුවෙලා දෙනෝ දාහක් නුවන් අතරේ"},
{"title": "බුද්ධානුභාවේන", "artist": "නන්දා මාලනී", "author": "Unknown", "lyrics": "බුද්ධානුභාවේන සිත් නෙත් පහන් වී මෙත් මල් පිපීලා මුදිතා ජලාසේ නංවා ප්‍රභා ලොව්තුරා රශ්මි මාලා හෙළ දෙරණ ජන ජයතු ජය මංගලානී හෙළ දෙරණ ජන ජයතු ජය මංගලානී තණ්හා උපාදාන පරිදේව වියැකී අඥාන අඳුරේ දැල්වී ප්‍රදීපේ හඬවා නුවන් දැල් මංගල්‍ය ප්‍රීතී හෙළ දෙරණ ජන ජයතු ජය මංගලානී හෙළ දෙරණ ජන ජයතු ජය මංගලානී බුද්ධානුභාවේන සිත් නෙත් පහන් වී භෘංගාවලී රාව ප්‍රතිරාව නංවා බන්දා ප්‍රශංසා ජය කේතු කේලී දසතින් ගලා ක්ෂීර පායාස ධාරා හෙළ දෙරණ ජන ජයතු ජය මංගලානී හෙළ දෙරණ ජන ජයතු ජය මංගලානී බුද්ධානුභාවේන සිත් නෙත් පහන් වී"},
{"title": "බිරිද මගේ ඔබ", "artist": "නන්දා මාලනී සමග ගුණදාස කපුගේ", "author": "Unknown", "lyrics": "බිරිද මගේ ඔබ නෑ මා ඔබගේ බිරිද නොවේ දෑගිලි හුයකින් බැදිපමනින් මා ඔබගේ බිරිද නොවේ ඔබ පෙම් කල අය ඔබට ලැබී නැත මා පෙම් කල අය මටද ලැබී නැත මව්පිය නෑසිය ආසිරි ගී මැද දෑගිලි පමනක් එකට බැදී ඇත සිරුරින් එක තැන හදවත් දෙතැනක දෙදෙනෙකු වෙමු අපි එකම වහල යට ඔබෙත් මගෙත් හද ගැහෙනා රාවය අපට මියෙන තුරු හැදිනිය හැකි වෙද"},
{"title": "අරලිය ලන්දට", "artist": "නන්දා මාලනී", "author": "Unknown", "lyrics": "අරලිය ලන්දට – සඳ පායන කොට තුරුලිය මල් වට – බඹරු බමන විට සිය සිය සිය දහසට – ඇඟිලි ගණිනා මට ඔබ ගැන සිහිවෙනවා එතකොට ගී පද ලියැවෙනවා… රඹවන් හේනේ – කරල් පැසෙන කොට අඹ මල් ගානේ – ගිරව් හඬන විට දොඹ තුරු මානේ – සෙවන දකින මට ඔබ ගැන සිහිවෙනවා – එතකොට සි ති විලි ඉගිලෙනවා… අරලිය ලන්දට… දඬු‍වැල් බෑ මී – සුවඳ දැනෙන කොට පඬුවන් අහසේ – තරු පායන විට හැඬුමට නොහැකිව – දෙඇස වසන මට ඔබ ගැන සිහි‍වෙනවා – එතකොට සි හි නය උපදිනවා… අරලිය ලන්දට…"},
{"title": "අහසින් බසින්", "artist": "නන්දා මාලනී", "author": "Unknown", "lyrics": "අහසින් බසින් සඳ මඬලින් බසින් මිනිසුන් මැද පුතුනේ මිහි මඬලේ ඉඳින් කඳුළු සුසුම් විඳ මුවහත් වෙමින් රට වෙනුවෙන් දැය වෙනුවෙන් නොසැලී ඉඳින් සුපසන් නොවේ ලොව නුඹ මේ උපන් නුවණින් වැඩී ලොව සුපසන් කරන් විරුවන් ලෙසින් රුදු රණ බිම් මැදින් නුඹගේ ගමන් මග ඉදිවේ බලන් දෙවියන් නොවේ නිති අසලින් ඔබේ දිරියෙන් ගතේ ඉ‍ටු දෙවියන් මැවේ ජය පැන් වඩන් දහදිය වැල් වලින් නුඹගේය ඒ නව ලොව පුංචී පුතුන්"},
{"title": "අහස සේ ඔබ අනන්තයි", "artist": "නන්දා මාලනී", "author": "Unknown", "lyrics": "අහස සේ ඔබ අනන්තයි සයුර සේ ඔබ අනන්තයි මේ විශ්වයේ මා දකින්නේ…… ඔබම පමනයි ඔබ අනන්තයි වෙන තතක් හැඩවෙන තැනක් ඔබ මදු විතක් උතුරන තැනක් ඔබ තෙලි තුඩක් දැවටෙන තැනක් ඔබ පන් හිදක් ගැවසෙන තැනක් ඔබ අඩ සදක් සැගවෙන තැනක් ඔබ රළ පෙලක් පෙරලෙන තැනක් ඔබ සිහිලසක් දනවන තැනක් ඔබ උනුහුමක් ගෙන එන තැනක් ඔබ"},
{"title": "අහස ගුගුරා", "artist": "නන්දා මාලනී", "author": "Unknown", "lyrics": "වසා ගං දොර මගේ හිමියනි නුඹට රිසි නම් යන්න යන්නෙමි ආලයක් නැතී තාලයක් නැතී විජිතයේ කටු ඔටුණු හැර යමී කාළයක් අපි ආදරෙන් සිටි සොඳුරු මතකය අරන් යන්නෙමි බැන්ද රන් දම් මගේ ගෙල වට මුදා විසිකොට අඬන අහසට මගේ සිහිනයේ ඔබ නිදන් කොට කුරුටු ගී දහසක් ලියන්නෙමී අහස ගුගුරා අකුණු පුපුරා මගේ හිත වැන්දඹු වුනා"},
{"title": "ආදරයේ වේදනාව", "artist": "නන්දා මාලනී", "author": "Unknown", "lyrics": "ආදරයේ වේදනාව හදට දැනුනු යම් මොහොතක හුදකලාව නොතැවී යලි එන්න මා සොයා එන්න මා සොයා දේදුනු පැහැයෙන් දිදුලන ආදර විජිතය හැරදා රැගෙන පලා ගිය මොහොතක නොතැවී යලි ඈ සිහිකර එන්න මා‍ සොයා එන්න මා‍ සොයා ආදරයේ වේදනාව ජීවිතයට මිහිර ලතැවුල ඔබ තුරුලට ලංවූදා නොතැවී හිද තනියහනේ මතක සුලං රොදක එතී එන්න මා‍ සොයා එන්න මා‍ සොයා ආදරයේ වේදනාව"},
{"title": "චංචල දෑසේ මායා", "artist": "නීලා  වික්‍රමසිංහ", "author": "Himali N. Liyanage", "lyrics": "චංචල දෑසේ මායා - ඉස්සර වාගේ පාලා ඉන්නට ආයේ මා හා - ආදරේ දීලා මල්පෙති සිනහා ගේනා මෘදු හාදු වෑහේනා නින්දෙදි සනසාලා - හීන සාදනා ඊයේ වාගේ - මා දෑතේ යාවීලා සීතේ නෑවීලා - නුඹ ඒදෝ පායාලා නිම්හිම් නැති සිත්තම් - හද ගෙත්තම් කරවා නිල්වන් නෙතු යන්තම් - ළඟ දැන්නම් නැතුවා පාට සේද සේල ගෙන ආ ඔයා නාවදාක හීන පාලු වී ගියා ඊයේ වාගේ - මා දෑතේ යාවීලා සීතේ නෑවීලා - නුඹ ඒදෝ පායාලා සන්සුන් නැති සිත්තම් - මගෙ ඉක්මන් වෙනවා ළං ළං වෙනු ඇත්දැයි - යළි පෙම්බස් දොඩනා නෑසූ ගීත සීත රෑක ගී කියා කෝල දෑස ලෝල වේවි මා පෙළා ඊයේ වාගේ - මා දෑතේ යාවීලා සීතේ නෑවීලා - නුඹ ඒදෝ පායාලා චංචල දෑසේ මායා"},
{"title": "ආලය වන්", "artist": "නන්දා මාලනී", "author": "Unknown", "lyrics": "ආලය වන් මනරම් කවිකම් දෙන සිතුමිණ කොඳ විස්කම් හදවත් වී සමහම් නිගැයුම් කර සිඳ බිඳලයි බව ගිම් පැණසර මහා බෝසතුන් විරතට පැමිණ නොමින් පබවත වෙත බැඳෙමින් පුදදුන් උණු කඳුලින් ආලය නම් මනුදම් අදහම් නිති එතැනය සබය සුදම් ආලය වන්… සහලඟුරෙන් දැවෙමින් පවසට පැන් දෙනුවෙන් උරය පලා සතොසින් පුද දුන් සිය රුහිරෙන් ආලය නම් මනුදම් සුරකිම් නිති එතැනය සුර ලොව නම් ආලය වන්…"},
{"title": "මේ උයන් තෙරේ", "artist": "නිර්මලා රණතුංග", "author": "Unknown", "lyrics": "මේ උයන් තෙරේ මේ තුරු සෙවණේ ඔබේ කතා මට තවම ඇසේ මේ නදී තෙරේ මේ අඩි පාරේ ඔබේ සිනා මට තවම පෙනේ ඔබ එදා කියූ වදන් ලියා ඇති සිතේ නෑ ඉඩක් යළිත් සදා අන් සිතක් කෙරේ අතරමගත මා දමා තනිව ඒ ලොවේ කොහෙද ඔබ ගියේ කියන්න කොහෙද ඔබ ගියේ අප එදා පෙමින් වෙලී දෙපා නැගු මගේ නෑ තවත් මැකී ගියේ මුදු වදන් ඔබේ යළිදු ඔබ එතැයි පතා හිඳිමි ඒ ලොවේ කොහෙද ඔබ ගියේ කියන්න කොහෙද ඔබ ගියේ"},
{"title": "ඔබ මට තරුවකි", "artist": "ලක්ශ්මන්  විජේසේකර සමග නිර්මලා රණතුංග", "author": "Kumaradhasa Saputhanthree", "lyrics": "ඔබ මට තරුවකි ඝනදුරු රැයකදි දිදුලන සඳ ලෙස ගුවන අරා ළා හිරු මඩලයි මා අබියස ඔබ බැස යන්නේ නැති සසර පුරා උපතින් උපතට චාරිකාවේ දිවි මඟ ඔබ මා ළඟ උන්නා යුගයෙන් යුගයට මේ භවයේ මෙන් යළි හමුවන්නෙමු අපි දෙන්නා ඔබ මට තරුවකි ඝනදුරු රැයකදි සෙනෙහස ගඟුලක් ඔබට පුදන්නෙමි බිඳුවක් ඔබගෙන් ලබන නියා සෙනෙහස උතුරන මහ සයුරක් වෙමි වෙරළක් වී ඔබ දකින නියා ඔබ මට තරුවකි ඝනදුරු රැයකදි"},
{"title": "අකලට වට", "artist": "නිර්මලා රණතුංග සමග දයා ද  අල්විස්", "author": "Unknown", "lyrics": "අකලට වට මහ වරුසාවක් සේ අසුබ දිනක ආ සුභ පැතුමක් සේ මා හැර ගිය ඔබ නොසිතූ මොහොතක ඇයිදෝ යළි ආවේ පෙරදා මෙන් හද මල් පිපුණාදෝ සතු‍ටු කඳුලු නුවනත සිඳුනාදෝ ආදර අතීත නටඹුන් අතරේ මන්දිර මැව්වාදෝ සොවක් නැතේ නොසිතනු මැන සංකා ඔබෙන් ලබනු කුමටද අනුකම්පා රජෙකුට හිමිවුන මා දැන් ‍රැජිනකි සතුටයි කිරුළ අපේ හෙට හමුවීමෙන් කිසිදු පලක් නෑ ඔබෙ ඇරයුම පිළිගන්න හිතක් නෑ විමසන වදනට පිලිතුරු දෙන්නම් ලඟකදි ලබන දිනේ"},
{"title": "නිර්මලා ලොන්ඩරිය හිමි සළු", "artist": "ගුණදාස කපුගේ සමග නිරංජලා සරෝජිනී", "author": "Unknown", "lyrics": "නිර්මලා ලොන්ඩරිය හිමි සළු වඩන මැණිකේ නිර්මලා මල් හිනා නුඹෙ තැවරිලා කිරි ඉද්ද මල්වැට පීදිලා කුල ගෙවල් සැරසිලි කළත් අපි සළු වඩා පාවඩ එලා නිර්මලා නිර්මල නැතැයි මා ඔබෙ ලොවින් පිටමන් කළා පන්තියේ මිතුරන් එදා කළ විහිළුවෙන් හිත රිදුනු දා මා හෙළුෑ කඳුළක් මගේ දින පොතක තිබිලා හමුවුනා යුධ වැදී නෑ සියන් බළමුළු අපේ ලොව ගිනි වැදුනු දා මා හෙළුෑ කදුලින් තෙමූ සළු පිළි තවම නෑ වේලිලා දොවා ලන්නට බැරි පිළී ගඳ කහට කුලමල තවරලා මගෙ ඇදුම් ඔබෙ අතට දෙන එක දරන්නට බෑ නිර්මලා එදා සෙනෙහස නොකිලිටිව ඔබෙ හිත පුරා පවතින නිසා හිමිනැතත් මට හුරු සුවඳ ඒ ඇඳුම් අතරේ තියනවා නිර්මලා"},
{"title": "සිනාතොටක් විය", "artist": "නිරෝෂා විරාජිනී", "author": "Unknown", "lyrics": "සිනාතොටක් විය ඔබ පාමුල මා ලද සරදම් මහෝගයක් විය ඔබෙන් ලැබු අපමණ අභිමන් නොහඩා ඉන්නම් ගිලිහුනු දා පෙම් ලොව මල්දම් ‍දුටුව නිසා ආදරයේ දෙව් ‍රුව ඔබගෙන් මං පෝසත් ඔබ සිත ළග උවැසිය වී දැහැනට වී සිටිය මිස නොදනිමි කොයි සිටියාදැයි මලවී පුදසුන් මත මිස යද්දී සහසක් මල් පරවී නොපිදු මල තවමත් ඇත ඔබ ගැන බැති බරවී මගෙන් මිදුනු ලොව ඔබට මිහිරි නම් එය සැපකී ඔබට ලංව දුක බෙදා ගන්ට බැරිකම දුකකී මෙවැනි බැදුම් බැරි ලෝකය සිර ගෙයකී එවන් ලොවක මේ හමුවීමත් වාවනු නොහැකී සිනාතොටක් විය"},
{"title": "හිත රිදෙන තරම්", "artist": "නිරෝෂා විරාජිනී", "author": "Unknown", "lyrics": "හිත රිදෙන තරම් මාගේ ඔබට දැනේ නම් දුරින් ඉන්නේ නෑ ඔය තරම් දෑස් රිදෙනකම් බැලුවත් ඔයා එන්නෙ නෑ ඉතින් කදුළු පමණි උරුම මට ඔබෙන් ඔබටම සිතී  ලංවුනා වෙන්වුනා මා තාම උන්තැන තමා ඔබටම සිතී  ලංවුනා වෙන්වුනා මා තාම උන්තැන තමා ඔභ දුටුව මේ දෙනෙතේ කදුළැල් වෙසෙන්නේ හද සුසුම් තරගෙටයි හඩන්නේ අමතක කලාදෝ අපි ගෙවු අතීතේ සිහින මා හා වෙන්වී ගියේ ඔබටම සිතී  ලංවුනා වෙන්වුනා මා තාම උන්තැන තමා මට මැවුව සෙවනැල්ලේ වෙනකෙකු සිටින්නේ මට ඉඩක් නැතිදෝ දැන් හදේ මදිවී ගියාදෝ මා පිදු සෙනේහේ අව ඉක්මනින් ඔබ ගියේ ඔබටම සිතී  ලංවුනා වෙන්වුනා මා තාම උන්තැන තමා හිත රිදෙන තරම්"},
{"title": "දුහුල් මලෙක", "artist": "නිරෝෂා විරාජිනී", "author": "Unknown", "lyrics": "දුහුල් මලෙක මල් පෙත්තක එහා මෙහා පෙනෙන පරිදි සියුම්ව ලිව්වා වූ මගේ පෙම් පණිවිඩය සමනළයෙක් අතේ එව්ව හම්බ වුණාද බාර ගන්න පරිස්සෙමින් තටු පොඩි නොකර මගේ පෙම් පණිවිඩය හම්බ වුණාදැයි කියලා ලියලා එවන්න ඔබ වෙනුවෙන් තව දුරටත් ජීවත් වෙන්න ඔබට කැමති වූ දවසේ දැණුනු හැඟුමේ පාට තමයි දේදුන්නක් වෙලා දෑස් වෙත පාත් වුණේ ඒ සතුටේ සුසුම තමයි නළ මුදු සුවදක් වී හිත තෙත මාත්තු කළේ ඒ බව හැ‍ඟෙනවා නම් මට කියලා එවන්න ඒ ඇති මට ඔබ වෙනුවෙන් ජීවත් වෙන්න ඔබ නික්මන් කළ දවසේ උනපු කඳුලේ තරම තමයි පොද වැස්සක් වෙලා පොළවට පාත් උනේ ඒ කඳුලේ බලයක් තමයි මහවැලි ගඟ මැද්දේ දිය සුළියක් වූයේ ඒ බව දැණුනා නම් මට කියලා එවන්න ඒ ඇති මට තව දුරටත් ජීවත් වෙන්න දුහුල් මලෙක මල් පෙත්තක"},
{"title": "ලං ලං වෙලා", "artist": "නොයෙල් රාජ්", "author": "Unknown", "lyrics": "ලං ලං වෙලා සිතින් මා හොර රහසේ ගොළු වෙලා දැන දැනත් අහීමි බැව් මා පෙම් කලා මේ පාළු ගිම්හානේ තනිකමයි මගේ උරුමේ වෙන් වෙන්න බෑ මට පෙම් කල නිසා පැහැසර සිනාවෝ අත සුසුම් එවලා හොර රහසේ ගියාදෝ මේ දෑස හඩවාලා මේ පාළු ගිම්හානේ තනිකමයි මගේ උරුමේ වෙන් වෙන්න බෑ මට පෙම් කල නිසා දුප්පත් කථාවෝ ඇති ලයේ රැස් වෙලා අහලා බලන්න ඒවා මතකද කියාලා මේ පාළු ගිම්හානේ තනිකමයි මගේ උරුමේ වෙන් වෙන්න බෑ මට පෙම් කල නිසා"},
{"title": "මගේ ළමැද සුව යහනක්", "artist": "ප්‍රියා සූරියසේන", "author": "Unknown", "lyrics": "මගේ ළමැද සුව යහනක් ඔබට තනා දෙන්න කියා බවෙන් බවේ පෙරුම් පුරා බලා ඉන්නවා ඒ යහනේ ඔබ සතපා බිඟු ගී වැල් මුමුණනවා සොඳුරු ලොවක අප දෙදෙනා හෙට තනි වෙනවා සිහින ගෙනෙන කුමාරියේ ඇගේ ලොවට එන්න එපා ඇය රවටා කැඳවාගෙන නොයන් කුමරියේ අපට උරුම අපේ ලොවේ හද සොම්නස් කිරැල දරා මගේ ළඟින් සසර පුරා ඉන්න වාසනා මගේ ළමැද සුව යහනක් ඔබට තනා දෙන්න කියා බවෙන් බවේ පෙරුම් පුරා බලා ඉන්නවා ඒ යහනේ ඔබ සතපා බිඟු ගී වැල් මුමුණනවා සොඳුරු ලොවක අප දෙදෙනා හෙට තනි වෙනවා"},
{"title": "හෙට දවසේ අප දෙදෙනා", "artist": "ප්‍රියා සූරියසේන", "author": "Unknown", "lyrics": "හෙට දවසේ අප දෙදෙනා අද වාගෙම හමුවිය යුතුවේ අද දවසේ මවෙත ගෙනා මිහිර හෙටත් ගෙන ආ යුතුවේ කිසි වෙනසක් නැති එකම දෙයක් අති එය මා ලබු ඔබෙ ආදරයයි මගෙ ජීවිතයම නෞකාවක් නම් එය ඔබ සුරකින සාගරයයි අද සුපිපෙන මල හෙට නොපිපේවී ලොකය දිව යයි වෙනස් වෙලා එලෙස වෙනස්වන ලොවෙහි අළුත් වන ආදරයම මම ඉඳිමි බලා"},
{"title": "හැරදා විමන්", "artist": "ප්‍රියා සූරියසේන", "author": "Unknown", "lyrics": "හැරදා විමන් සිය මා පියන් මා ආදරෙන් වැඩූ නොසිතූ ලෙසේ වෙන්වී මෙසේ ඇයිදෝ වෙනස් වුණේ මුළු ජීවිතේම නෑ මෙමා දුක් ගීයක් ගයා හඬවන්නෙ ඇයි ළදේ ඔයා දුක් මාරුතේ හොවා පෙර ආදරේ අපේ ලොවේ සඳපාන සේ දිලී තිබුණා කියා සිතන්නෙ මා කෙලෙසින්ද මිහිරියේ"},
{"title": "හදවත ඉල්ලා", "artist": "ප්‍රියා සූරියසේන", "author": "Unknown", "lyrics": "හදවත ඉල්ලා නොලැබුන විටදි දහසක් සිතුවිලි මා හද තුල තෙරපී මිතුරිය ඔබ කෙලෙසක හෝ අමතක කරමී නොපිරු පෙරුමන් පුරලා කුමටද ලතැවී ඔය නෙතු අග රැදි තිබු නිල්මිණි ඡායා දැක මා හදවත සසැලි සෙනෙහස කීවා මතු අප උපදින භවයේ යළි හමු වේවා ඔය නෙත් අග සිසිල රැදි මට ළං වේවා"},
{"title": "එකම වීදියේ දෙතුන් වතාවක්", "artist": "ප්‍රියා සූරියසේන", "author": "Unknown", "lyrics": "එකම වීදියේ දෙතුන් වතාවක් එහා මෙහා අපි ඇවිද ඇතී බිමට නැමුණු මල් අතු ඉති අතරේ අපේ කතාවන් රැඳී ඇතී සුදු හසඟන සේ හසරැළි ඉහලා හඳ පායන සේ හද ගිණි නිවලා ඔබ මා සුරතේ දසඟිලි පටලා දොඩමළු වීලා මට ඉඟි කරලා හැන්දෑ යාමේ මා අත හැරලා යන්නී ඔබ ඔබේ කුටියට පෙරලා කවුළුව අතරින් හසරැලි එළලා මම යමි මගේ හිත ඔබ ළඟ තියලා තනි යහනේ මා කෙසේ සිතන්නේ මා සිත ඔබේ ළඟ නොවෙද තියෙන්නේ ඔබට හිතෙන දේ හිතට කියාදී හෙට එන විට යලි රැගෙන වරෙන් එකම වීදියේ දෙතුන් වතාවක්"},
{"title": "එකම මගක", "artist": "ප්‍රියා සූරියසේන", "author": "Unknown", "lyrics": "එකම මගක පියවර මැන යන්නයි එකම බිමක සෙවනැලි පැටලෙන්නයි සෙනෙහෙ දියෙන් මීවිත පිරවෙන්නයි මගේ පැතුම ඔබ මට හිමිවෙන්නයි වැලේ පිපුණ මල නොවේ වැලට බර බිගුන් සලාවී පැතුම් මවා සිතේ රැදුනු පෙම නොවදෙන් රටකට මගේ ලොවින් පිට නොයන්් පලා එකම මගක පියවර මැන යන්නය මගේ ලොවට සඳ ඔබේ සිඟිති මුව අගින් එබේවි කැළුම් මවා ඔබේ පිනට මතු මගේ ගෙපැල ලඟ කුසුම් පිපේවා පවන් සලා එකම මගක පියවර මැන යන්නය"},
{"title": "ආදරණීය නේරංජනා", "artist": "ප්‍රියා සූරියසේන", "author": "Unknown", "lyrics": "ආදරණීය නේරංජනා ඔබෙ මුදු මඳ හසරැලි මාලාවේ වෙලී බැඳුන දින රඟ ශාලාවේ තුන් සිතකින්වත් නොසිතූ විලසින් යළි ඔබ දැකුමට ආ වේලාවේ අප හමුවූ ගෙවුයන් සීමාවේ එක මොහොතක පමණකි තනිවූයේ මටමම පුදුමයි අදහන්නට බෑ මමම නොවේ යළි ඉන් පිටවූයේ කවුදෝ මා පසුපස එනු දැනුණා පාලු වීදියේ තනිකම මැකුණා ජීවමාන කිසිවකු සිටියේ නෑ එනමුදු කවුදෝ ඇති බව හැඟුණා නිදි යහනේ මා නින්දට වැටුණා ඔබ මා සිහිනෙන් අමතනු ඇසුණා එනමුදු කෙළෙසද ඇගෙ අත ගන්නේ මගේ සිතම මට මුමුණනු ඇසුණා"},
{"title": "ඈත රන් විමන් තුළින්", "artist": "ප්‍රියා සූරියසේන", "author": "Unknown", "lyrics": "ඈත රන් විමන් තුළින් පාට සේලයෙන් සැදී මුදු සීත හිම මුදුන් අතරින් එබී බලනවා ආ හා හා හා හා මේ ලොවෙන් එහා සිටන් ඈත ලෝකයෙන් ඇවිත් මුදු නීල පීත ලෝහිත ඈත දිලෙනවා ආ හා හා හා හා රෑට තරු දහස් ගණන් ඈත සුරපුරෙන් වැටී අද රෑට අද රෑට අද රෑට දිලෙනවා ආ හා හා හා හා ගීත රාවයෙන් සැලී දෑත ආදරෙන් වෙලී ඔබ කීව පෙම් කතා ඇසුරෙන් ගීත මැවෙනවා ආ හා හා හා හා"},
{"title": "සඳරේණු වෑහෙනා", "artist": "ප්‍රින්ස් උදය  ප්‍රියන්ත", "author": "Lalith Wasantha", "lyrics": "සඳරේණු වෑහෙනා මේ සීත රාත්‍රියේ ඔබ ඉන්න මාගේ ළඟින් හද පිරුණු වේදනා පිසදා සිනා සලා මට දෙන්න ආදරේ ඔබගේ හදින් සඳරේණු වෑහෙනා මේ සීත රාත්‍රියේ ඔබ ඉන්න මාගේ ළඟින් පියවී ලොවේ කිසිදා එක්වන්නෙ නෑ එනමුත් මගේ හදින් වෙන්වන්නෙ නෑ දෙතැන තනි වී සදා හෙලන සුසුමන් නිවා ඔබ ඉන්න මාගේ ළඟින් තිබුණත් හදේ පැතුමන් ඉටුවන්නෙදෝ ඔබ ගැන පැතු සිතින් වැලපෙන්නදෝ කඳුළු හසරැල් මවා ම සිත ලතැවුල් නිවා ඔබ ඉන්න මාගේ ළඟින් සඳරේණු වෑහෙනා මේ සීත රාත්‍රියේ"},
{"title": "එකම මගක", "artist": "පුන්සිරි  සොයිසා", "author": "Unknown", "lyrics": "එකම මගක පියවර මැන යන්නයි එකම බිමක සෙවනැළි පැටලෙන්නයි සෙනේ දියෙන් මීවිත පිරවෙන්නයි මගේ පැතුම ඔබ මට හිමිවෙන්නයි වැලේ පිපුණු මල නොවේ වැලට බර බිඟුන් සරාවී බැලුම් හෙලා හිතේ රැඳුණු පෙම් නොම දෙන් රටකට මගේ ලොවින් පිට නොයන් පලා එකම මගක මගේ ලොවට සඳ ඔබේ සිඟිති මුව අගින් එබේවී හැඟුම් මවා ඔබේ පිනට මතු මගේ ගෙපැල ළඟ කුසුම් පිපේවා පවන් සලා එකම මගක"},
{"title": "තනිවූ මිනිසා", "artist": "රනිදු ලංකාගේ", "author": "Unknown", "lyrics": "මතකයි ඔබේ එදා දෑතේ වෙලීලා කියමින් ඔබේ ආදරේ සදා නොමැකෙයි කියා සඳ රැස් නිවී ගියා යන මාවත් පාදලා සිටියේ බලා නෙත් ඇගේ මගේ වේ යැයි කියා මක්  හෝ දෙයක් නිසා ඈ සිත් වෙනස් වෙලා ආලෙන් තුරුල් වෙන්න නෑ ඈ මා හා ඇරඹුම සැමදා ඔබ ගිය බිඳ දා සිත මගේ පාරලා තනි වුන මිනිසා මම වෙමි හඬනා වේදනා විඳවනා ඇරඹුම සැමදා ඔබ ගිය බිඳ දා නොපෙනෙමින් රිදවනා තනි වුන මිනිසා මම වෙමි හඬනා වේදනා විඳවනා දරා ගන්න බෑ මේ භවේ කුරිරූ වූ ඒ වදන් දුටුවොත් ඈ පවසන්න මා බලා හිඳී කියා ඈට පවසන්න  මාගේ හදේ රිද්මයද නෑ කියා හඬනා මගේ දෑසේ නෑ ඈ මා හා ඇරඹුම සැමදා ඔබ ගිය බිඳ දා සිත මගේ පාරලා තනි වුන මිනිසා මම වෙමි හඬනා වේදනා විඳවනා ඇරඹුම සැමදා ඔබ ගිය බිඳ දා නොපෙනෙමින් රිදවනා තනි වුන මිනිසා මම වෙමි හඬනා වේදනා විඳවනා"},
{"title": "නින්ද නොයන හැන්දෑවේ", "artist": "රනිදු ලංකාගේ", "author": "Unknown", "lyrics": "නින්ද නොයන හැන්දෑවේ සොඳුරුයිද මොන තරම් දුක නැතුවමත් නොවේ ඔබ යන්න යනවානම් සිපගන්නට පමණක් නම් ඔය දෙතොල් ළං කළේ විඳ ගන්නට මම ඉන්නම් එන නිවාඩුවට එනකම් දෑස් වසා කඳුළු සලා දෑස් වලින් සිනා සලා සුසුම් වලින් කතා කලා ඔබ යනවා සුවඳ තියා"},
{"title": "සුව දේ", "artist": "මොහිදින් බෙග්", "author": "Unknown", "lyrics": "සුව දේ මට සීතල සුළඟ පවා හිමි බුදු වුණ බුද්ධගයාවේ හිමි බුදු වුණ බුද්ධගයාවේ ප්‍රිය දේවිය හා රජ සැප හැර දා මරු බල පරදා බුදු වූ පෙරදා සුව දේ මට සීතල සුළඟ පවා හිමි බුදු වුණ බුද්ධගයාවේ හිමි බුදු වුණ බුද්ධගයාවේ ගිරි මුදුන පවා කුසුමන් පිබිදී බුදු රැස් විහිදී සිරිසර පලවී සුව දේ මට සීතල සුළඟ පවා හිමි බුදු වුණ බුද්ධගයාවේ හිමි බුදු වුණ බුද්ධගයාවේ ඇසු දුටු පම‍ණින් ගත සිත සැනසේ ජය භූමිය වේ ලොව බොදු දනගේ සුව දේ මට සීතල සුළඟ පවා හිමි බුදු වුණ බුද්ධගයාවේ හිමි බුදු වුණ බුද්ධගයාවේ"},
{"title": "ඔබ එනව බලා", "artist": "මොහිදින් බෙග්", "author": "Unknown", "lyrics": "ප්‍රියේ රුචිරාණනියේ ඔබ එනව බලා පැල්පතට වෙලා ඔබ එනව බලා පැල්පතට වෙලා මං හිටියා උදේ ඔබ කොහෙද ගියේ මං හිටියා උදේ ඔබ කොහෙද ගියේ ඔබ එනව බලා පැල්පතට වෙලා මල් මාල ගොතා බෝ ඉවර වෙලා තව නැද්ද ළඳේ මගෙ ආදරී ඔබ එනව බලා පැල්පතට වෙලා සුර සිහින මවා මල් ඔටුණු තනා පිළිගන්න සුපෙම් මන්දිරය සැදේ ඔබ එනව බලා පැල්පතට වෙලා ගුණවන්ත කතුන් ලොව ඉන්නවනම් ඔබ වන්න එයින් එක ළඳකු ඉතින් ඔබ එනව බලා පැල්පතට වෙලා"},
{"title": "මා නිසා ඔබ", "artist": "මිල්ටන් මල්ලවාරච්චි", "author": "Unknown", "lyrics": "මා නිසා ඔබ නොපිරූ පෙරුම් මා නිසා ඔබ නොපැතූ පැතුම් ඒ සිනහා මැද ඉටු වේවි නම් ආයේ නාවත් කම් නෑ ඉතිං කෝ එදා ඔබ අත පැලැන්දුව මුදුව කෝ කොයිදෝ නෑ මාගේ සිත අන් කෙනෙක් ගැන කීවාදෝ නැතිදෝ මා නිසා ඔබ නොපිරූ පෙරුම් මාළිගාවක රජ කෙනෙක් වත් යනවදෝ කැදවා වාසනාවන් ඒ සැඳෑවට මා ඇවිත් යනවා මා නිසා ඔබ නොපිරූ පෙරුම්"},
{"title": "මා නෙත් කැදැල්ලේ", "artist": "මිල්ටන් මල්ලවාරච්චි", "author": "Unknown", "lyrics": "මා නෙත් කැදැල්ලේ සැතපීලා නිදැල්ලේ දැවටී රන්දැලේ හද පුරා සැනසිලා ආයෙත් ඉගිල්ලී පියඹාලා පිපාසෙන් නොසරා මල් කැලේ රොන් සොයාලා රොන් සොයාලා බඹර තුඩු ගා නැති කුමුදු මලකින් පෙති ගෙනෙමි දුර ඈත විලකින් බලා ඒ මැද ඔඛෙ යහන සාදන්නෙ නා දල්ලෙනුයි සුවඳ උලා මා නෙත් කැදැල්ලේ අරුණ පිණි බිංදුවයි පියුමෙ මකරන්දයයි පොවමි මේ කුලක කලතා නිවා ඉන්මතු කිසි දාක යන්නෙහිද හද රන් ලෙනේ පහන නිවා මා නෙත් කැදැල්ලේ"},
{"title": "මුහුද හඬන වෙලාවේ", "artist": "මධුමාධව  අරවින්ද", "author": "Unknown", "lyrics": "මුහුද හඬන වෙලාවේ වෙරළේ තනියේ මේ යාමයේ මම නාඳුනන ඈ කාගෙදෝ තනිව හඬන ඈ කවුරුදෝ මෙලෙස තනි වෙලා ඔබ කවුරුදැයි කියා පවසන්න පැකිලෙන්නෙපා කඳුළු පිස දමා ඔය මුහුණ පෙන්නලා හිනැහෙන්න හසරැල් මවා මුහුද හඬන වෙලාවේ සිතිජ ඉමව්වේ දුර ඈත දනව්වේ මුසුවේවි සංකා ඇගේ ඈ හෙලන කඳුළැලි මුහුදටම යා වෙවී මුහුද හඬයි ඈ හා බැඳී මුහුද හඬන වෙලාවේ"},
{"title": "ප්‍රේමයේ විල් තෙරේ", "artist": "මාලනී  බුලත්සිංහල", "author": "Kularathna Ariyawansha", "lyrics": "ප්‍රේමයේ විල් තෙරේ යෞවනේ මල් වනේ ඇසෙන මේ ගී මියුරු රාවේ සිතක ආරාධනා ප්‍රේමයේ විල් තෙරේ සුසුදු හසකැන් සලා දෑස පෙරුමන් පුරා පාළුවේ තනි වෙලා කාටදෝ ඉඟි කලා ප්‍රේමයේ විල් තෙරේ සීත පවනැල් ගලා නීල තුරු මල් සලා ආදරෙන් පිබිදිලා ලෝකයම හිනැහිලා ප්‍රේමයේ විල් තෙරේ"},
{"title": "මං හින්දා ඔබෙ", "artist": "මාලනී  බුලත්සිංහල සමග ගුණදාස කපුගේ", "author": "Sunil Ariyarathna", "lyrics": "මං හින්දා ඔබෙ නෙතඟින් කඳුලක් හෙලන්නෙපා මං හින්දා ඔබෙ හද තුල සුසුමක් නැගෙන්නෙපා ගිවිසා ගනිමු අපි පෙම් යුවලක් සේ කිසිදා එක් නොවෙනා අහස් මාලිඟා නැහැ ඔබ නිසා මැවී සැක සංකා නැහැ ඔබ ගැන හිතේ රැදී හිමිකම් නොකියමි ඔබට මගේ කිසිදා උරණ නොවන්නෙමි ඔබ අන්සතු වූ දා මං හින්දා ඔබෙ අතැඟිලි බන්ධන නොපතමි පෙමින් බැදී ඔබ සිරකරලන දොරඟුලු දමනු බැරී නෑ කුල සිරිතෙන් සැලෙනා පෙමක් නොවේ පෙමට පෙමින් යන පෙම්ලොව මෙයයි අපේ මං හින්දා ඔබෙ"},
{"title": "කන්ද කෙන්ද කරනු පිණිස", "artist": "මාලනී  බුලත්සිංහල", "author": "Premakeerthi De Alwis", "lyrics": "කන්ද කෙන්ද කරනු පිණිස කන්දට ගරහාලා කෙන්ද කන්ද පාමුල ළඟ සිටියලු තනි වීලා අන්ද මන්ද ගණ අදුරේ කෙන්ද පටලැවීලා කන්ද කඩා වැටේ සිතූ කෙන්ද බලාපල්ලා ගහේ පිපුණ මල් සේරම බඹරුන්ටත් දීලා බලා හිඳී ගසක් ඔහේ සුළගේ හිනැහීලා බඹරු එතත් දෙඹරු එතත් ගහ නැහැ කැළඹීලා ඔහේ සිනා සෙනු මිස විහඟුන්ගේ ගී අහලා කන්ද කෙන්ද කරනු පිණිස කන්දට ගරහාලා කුණාටු සුළි සුළං වැදී ගහකොල පෙරලාවි මුල හොඳනම් ගසක් ළඟදි කුණාටු පරදීවී ගහේම මල් බුදු පුදටත් නෙලා රැගෙන යාවී ඒ ඈයෝම ඒ ගහේම මල් බිම පාගාවී කන්ද කෙන්ද කරනු පිණිස කන්දට ගරහාලා කෙන්ද කන්ද පාමුල ළඟ සිටියලු තනි වීලා අන්ද මන්ද ගණ අදුරේ කෙන්ද පටලැවීලා කන්ද කඩා වැටේ සිතූ කෙන්ද බලාපල්ලා කන්ද කඩා වැටේ සිතූ කෙන්ද බලාපල්ලා කන්ද කඩා වැටේ සිතූ කෙන්ද බලාපල්ලා"},
{"title": "පාර මාරු වෙන්නෙ", "artist": "ලයනල්  රන්වල", "author": "Sisira Dissanayaka", "lyrics": "පාර මාරු වෙන්නෙ ඇයිද මා දුටුවම නංගියේ මා එපා වෙලා නම් වෙන පාරක යන්නම් නැතිනම් ගම් පළාත අතහැර යන්නම් නැතිනම් ගම් පළාත අතහැර යන්නම් උදෑසනට සුබ පතනා උදෑසනට සුබ පතනා නුඹෙ සිනහ මනාවයි යස ගමන් ලතාවයි මං නුඹට මනාපයි හංග හංග ඉන්නෙ නැතිව ඒ වග මං කිව්ව හන්ද නුඹ අමනාපයි නුඹ අමනාපයි පාර මාරු වෙන්නෙ ඇයිද මා දුටුවම නංගියේ හැන්දෑවට කඩිමුඩියේ හැන්දෑවට කඩිමුඩියේ නුඹ ගෙදර දුවඤ්ඤයි මං පෙරුම් පුරඤ්ඤයි මග බලා හිඳිඤ්ඤයි පන්න පන්න යන්නෙ නැතිව පාඩුවෙ මං උන්න හන්ද නුඹ දැන් කෝළයි නුඹ දැන් කෝළයි පාර මාරු වෙන්නෙ ඇයිද මා දුටුවම නංගියේ"},
{"title": "දිනක අපි හමු වුණා", "artist": "ලලිත්  පොන්නප්පෙරුම", "author": "Unknown", "lyrics": "දිනක අපි හමු වුණා දිනක අපි වෙන් වුණා පැතුම් මල් මාවතේ කිමද අපි තනි වෙලා ඔබ කී කතා අසා සතුටින් බලා සිටියේ ඔබේ අත ගෙන එන්නම් කියා වැටහී තියේ නම් සෙනෙහේ නම් වෙන් වෙන්නෙ නෑ ඔබ කිසිදා මෙසේ දිනක අපි හමු වුණා දිනක අපි වෙන් වුණා පැතුම් මල් මාවතේ කිමද අපි තනි වෙලා රන් මසු සොයා ගියේ නුඹ ඇයි ළඳේ සෙනෙහෙන් දුගී වුණේ නෑ සිත මගේ වැටහී මගේ පැතුම් මතු දිනෙකදී කඳුලක් නැගේවී නෙතගින් ඔබේ දිනක අපි හමු වුණා දිනක අපි වෙන් වුණා පැතුම් මල් මාවතේ කිමද අපි තනි වෙලා"},
{"title": "රම්බරි", "artist": "ලහිරු පෙරේරා", "author": "Unknown", "lyrics": "ඩබ් ඩබ් රපට ඩපඩ රපට ඩපඩ රපට ඩපඩ රප ඩබ් ඩබ් රපට ඩපඩ රපට ඩපඩ රපට ඩපඩ රප ඩබ් ඩබ් රපට ඩපඩ රපට ඩපඩ රපට ඩපඩ රප ඩබ ඩබ් රම්බරි කියපන් උඹෙ නොම්බරේ තන්දුරි කමුද නොදා බරබරේ වාකරෙ කවුද ඉන්නෙ ජරමරේ අම්පාරෙ මල්ලි නිදිද කාමරේ ජම්බෝලේ වගෙ ඉන්න සුන්දරා සම්බෝලෙ කොටල ගමුද ලුණු දමා දංගොල්ලෙ මාම ඇවිත් මහ කුණා ගස් පල්ලෙ ඉඳන් බොමුද රා පෙරා රපට ඩපඩ රපට ඩපඩ රපට ඩපඩ රප ඩබ් ඩබ් රපට ඩපඩ රපට ඩපඩ රපට ඩපඩ රප ඩබ් ඩබ් එන්න මල්ලි එන්න මල්ලි නැගිටලා මෙන්න මල්ලි මෙන්න මල්ලි රස කතා පාන් බාගෙ කපල ගන්න ප්ලේන්ටි වක්කරල ගන්න එන්න මල්ලි එන්න මල්ලි නැගිටලා එන්න නංගි එන්න නංගි හැඩදමා එළිවෙනකම් සින්දු කියමු රොක් වෙලා ලෝකෙ තියෙන හොඳම සොමිය එළිවෙනකම් අපේ ජොලිය ගන්න නංගි ගන්න නංගි එක් වෙලා රපට ඩපඩ රපට ඩපඩ රපට ඩපඩ රප ඩබ් ඩබ් රපට ඩපඩ රපට ඩපඩ රපට ඩපඩ රප ඩබ් ඩබ් කන්ණඩි දැම්මත් නෑ හැඩවැඩේ කවුද මේක බාරගන්නෙ අන්තිමේ ලොරි බාගේ මට දුන්නත් හුටපටේ මෙහෙම කටක් දැක්කෙම නෑ මේ රටේ හුම්මානෙන් වතුර බොමුද සෝබනා හඳපානේ විරිදු කියමු රන්ජනා ලොරි බාගෙන් රවුමක් යමු රෑ වෙලා මරදානෙන් පරාට කමු ලංවෙලා රුක්මන් දාබන රුක්මන් දාබන රුක්මන් දාබන දාබන රුක්මන් රුක්මන් දාබන රුක්මන් දාබන රුක්මන් දාබන රුක්මන් එන්න මල්ලි එන්න මල්ලි නැගිටලා රපට ඩපඩ රපට ඩපඩ රපට ඩපඩ රප ඩබ් ඩබ් රපට ඩපඩ රපට ඩපඩ රපට ඩපඩ රප ඩබ් ඩබ් සෙල්ලම් වලින් රට හොල්ලපු ලොකුසිරා ඇතුලෙ ඉඳන් ඊයෙ ඇවිත් ඒ හොරා එහා ගෙදර මැගි අක්කට හරි හිනා මට නම් නෑ දිරවන්නේ ඔය කතා මුරලි දැම්ම හොඳට දුස්රා අඹරලා සනත් ගැහුවා තිතට අනේ නෑ හිනා ජොන් සීනා කාල හොඳට පෙරේදා එත් වහලෙ හිලෙන් වතුර ගැලුව රෑ පුරා රපට ඩපඩ රපට ඩපඩ රපට ඩපඩ රප ඩබ් ඩබ් රපට ඩපඩ රපට ඩපඩ රපට ඩපඩ රප ඩබ් ඩබ් එන්න මල්ලි එන්න මල්ලි නැගිටලා"},
{"title": "ලබැඳියේ", "artist": "ලහිරු පෙරේරා", "author": "Unknown", "lyrics": "ඔබ එන්න සුළඟේ දැවටිලා මා ඉන්නේ ඔබ දැන් එයි කියා සුදු හංස තටුවේ සැතපිලා පෙම් කරමු රහසේ සැඟවිලා ලබැඳියේ ලබැඳියේ මා සිතුම් සිරකලා ලබැඳියේ ලබැඳියේ මා සිතින් පෙම්කලා නා දල්ල වාගේ දිදුලනා මුදු හාදු වැස්සෙන් මා තෙමා ඔය දෙතොල් අතරේ සිර වෙලා මට ඉන්න ඇත්නම් තනි වෙලා ලබැඳියේ ලබැඳියේ කිරි කවඩි මාලේ මා ගොතා ඔය ගෙලේ පළඳා හැඩ බලා මා වින්ඳ සතුටේ නිම් සොයා ඔබ යන්න සුළඟේ අප දමා ලබැඳියේ ලබැඳියේ"},
{"title": "සමනළී", "artist": "කිත්සිරි ජයසේකර", "author": "Padmakumara Meththasena", "lyrics": "සිත නතු නැති සමනළී මට බිඳුවක් ඉන්න කියා ළඟ පාතකට ද දන්නේ නෑ තටු ගසමින් ඉගිල ගියා සිත නතු නැති සමනළී ඒ මනරම් මුතුවැල් හා පබළු මා ළඟ මෙහෙම තියා මා ළඟ මෙහෙම තියා ඒ මනරම් මුතුවැල් හා පබළු මා ළඟ මෙහෙම තියා මා ළඟ මෙහෙම තියා ගිම්හානේ මදහස ළඟ නවතා හිනැහී යන්න ගියා හිනැහී යන්න ගියා සිත නතු නැති සමනළී මට බිඳුවක් ඉන්න කියා ළඟ පාතකට ද දන්නේ නෑ තටු ගසමින් ඉගිල ගියා සිත නතු නැති සමනළී රෑ රැඟුමේ දුටු ගී හඬ හැඩලූ ඔබගේ දසුන නිසා ඔබගේ දසුන නිසා රෑ රැඟුමේ දුටු ගී හඬ හැඩලූ ඔබගේ දසුන නිසා ඔබගේ දසුන නිසා සඳ පානේ නිහඬව නෙතු සනසා සමුගෙන යන්න එපා සමුගෙන යන්න එපා සිත නතු නැති සමනළී මට බිඳුවක් ඉන්න කියා ළඟ පාතකට ද දන්නේ නෑ තටු ගසමින් ඉගිල ගියා සිත නතු නැති සමනළී"},
{"title": "රටා තියලා", "artist": "කිංස්ලි පීරිස්", "author": "Unknown", "lyrics": "රටා තියලා ඇමදපු මගෙ හිත් මළුවේ අපිළිවෙලට සක්මන් කළ සුදු මැණිකේ යන්න ගිහින් කල් ගෙවුනට හොර රහසේ තාමත් හැඩිවෙලා මගේ හිත වැළපේ නුඹ ගැන ඔය රතු තොල් ගැන කවි ලියලා ලියන්න බැරි තරමට පන්හිද ගෙවිලා අතරින් පතරට සුදු වෙන කෙස් දැකලා තුරුනු හිතට තනිකම ගැන දුක හිතුණා රටා තියලා පණ තර්මට පෙම් කළ උඹ කෝ කියලා අසයි සරදමට මිනිසුන් ඉඳහිටලා අපේ මතක රැදවුණු තැන් අතහැරලා යන්න හිතෙනවා මට ගම රට දාලා රටා තියලා"},
{"title": "මලක් වගේ පරිස්සමට", "artist": "කිංස්ලි පීරිස්", "author": "Unknown", "lyrics": "මලක් වගේ පරිස්සමට නෙලාගන්න බැරි උනාට හිතේ තියෙන ලෙන්ගතුකම මැකී යන්නෙ නෑ දෙනෙත් යටින් නිති බැලුවට ආල බැලුම් මට හෙලුවට බිඳක් තරම්වත් නුඹ නම් ප්‍රේම කරල නෑ හිත ඉකිලන රාත්‍රියක නෙතකඩ එන කඳුළුවලට හද හඬවන සෙනෙහස නම් බිහි කරන්න බෑ නුඹ තාමත් මගේ නොවෙයි මට හිතෙන්නෙ නෑ නුඹ තාමත් මගේ නොවෙයි මට හිතෙන්නෙ නෑ මලක් වගේ පරිස්සමට නුඹ නැති දා මංමුලාව මග වැරදුණු ජීවිතයට මතු කවදා සතුට අරන් හිරු නැගෙන්නෙ නෑ නුඹ තාමත් මගේ නොවෙයි මට හිතෙන්නෙ නෑ නුඹ තාමත් මගේ නොවෙයි මට හිතෙන්නෙ නෑ මලක් වගේ පරිස්සමට නෙලාගන්න බැරි උනාට හිතේ තියෙන ලෙන්ගතුකම මැකී යන්නෙ නෑ දෙනෙත් යටින් නිති බැලුවට ආල බැලුම් මට හෙලුවට බිඳක් තරම්වත් නුඹ නම් ප්‍රේම කරල නෑ බිඳක් තරම්වත් නුඹ නම් ප්‍රේම කරල නෑ"},
{"title": "ලස්සන ඇස් දෙක ලඟ", "artist": "කිංස්ලි පීරිස්", "author": "Unknown", "lyrics": "ලස්සන ඇස් දෙක ලඟ මොහොතක් නවතින්නට අවසරදැයි කියන්න තරහද මගේ ඉල්ලීමට ඇවිලෙන හදවත තුළ දුක් ගින්දර නිවන්න පුළුවන් ඔය ඇස්දෙක හෙලනා එක බැල්මට ලස්සන ඇස් දෙක ලඟ සංසාරේ දුක කියන්න හැමදාමත් දුක අහන්න දවසක් දුක් නිවන්න දෙනවද ඔය සෙනෙහස ලස්සන ඇස් දෙක ලඟ"},
{"title": "කඳුළු", "artist": "කසුන් කල්හාර", "author": "Unknown", "lyrics": "ඊයේ ඇස් වල තිබු කඳුළු පිසලන්නට බෑ කිව් නිසා ඒ කඳුලේ ආදරයේ පැහැයක් මා නෑ කිව් නිසා සඳ අඳුරට උරුම වෙලා ආදරයේ කඳු බෑවුම් අතරේ කඳුළු වලින් මියැදී සිනහවෙන් ඉපදී ආ හැටි පෙරදී කඳුලේ ඉපදී වියැකී ඒ සුරතල් සිනා ඒ කඳුලේ ආදරයේ පැහැයක් මා නෑ කිව් නිසා ඒ කඳුලේ ආදරයේ පැහැයක් තිබුණා"},
{"title": "දිලි දිලි දිලී සේවි", "artist": "ජෝතිපාල H.R.", "author": "Unknown", "lyrics": "දිලි දිලි දිලී සේවි ‍මා දෑසෙ ආලෝකෙ දිලි දිලි දිලී සේවි ‍මා දෑසෙ ආලෝකෙ කව්දෝ මාන බලන්නේ ඔබ ලඟ මා ඉන්නේ කව්දෝ මාන බලන්නේ ඔබ ලඟ මා ඉන්නේ හිතවත මේ ලෝකේ බොරුවෙන්ද ජයගන්නේ හිතවත මේ ලෝකේ බොරුවෙන්ද ජයගන්නේ සතුරා සමඟ සිනාසී මිතුරා සේ ඉන්නේ සතුරා සමඟ සිනාසී මිතුරා සේ ඉන්නේ ඇස්බැන්දුමක් වාගේ මේ ලෝ තලේ මොහොතින් බිදී යාවී සිතු සෑමදේ අපගේ සිහින පාරුවේ පාවී සයුරේ ඈත ජීවිතේ යාවී මල් වර වී යෞවනේ සල් වනේ ආදරේ දිලි දිලි දිලී සේවී කව්දෝ මවා පාන මායාවකි ඔබගේ ලගින් ඉන්නෙ ඡායාවකි ඔහුගේ දෑස ඔබ සොයා යන්නේ සැගවූ රහස නැ ප්‍රෙමේ දන්නේ මල් වර වී යෞවනේ සල් වනේ ආදරේ දිලි දිලි දිලී සේවී"},
{"title": "බඹරා වගේ ඇත තවම විසේ", "artist": "ජෝතිපාල H.R.", "author": "Unknown", "lyrics": "බඹරා වගේ ඇත තවම විසේ සල්ලි නැතේ මට විස්‌කි නැතේ යාළුවෙලා සිටි අය නැතේ වැටී ගියත් අප එකා වගේ ගල්මුල් ආවත් බය නෑ බය නෑ අපට හිතට දුක නෑ පැතුම් සැබෑ වෙන ජීවිතේ අළුත් දසුන් නව ලොවින් මැවේ මා යන ගමනේ බැමි නෑ බැඳුනේ ගිමන් පවස නොදැනේ"},
{"title": "ඇයිදෝ මගෙන් වෙන් වීලා", "artist": "ජෝතිපාල H.R.", "author": "Unknown", "lyrics": "ඇයිදෝ මගෙන් වෙන් වීලා ඔබ යන්නෙ කොහෙදෝ ළඳුනේ සැනැහී සදා ඔබ ඉන්නයි පැතුවේ හදෙන් තනිවී මා පැතුවේ හදෙන් තනිවී ඇයිදෝ මගෙන් වෙන් වීලා බමරුන් මේ ඇයි දුක්‌ ගීතේ පරවෙන්න ඇයි මල් පිපුණේ සැංගෙන්නෙ ඇයි සඳ අහසේ හිනැහෙන්නේ සඳ තරු එළියේ උපදින්නේ ඔබ මතු බවයේ - හිනැහෙන්න සුහදී පෙරසේ සැනසෙන්න වනමල් පිපුණේ බමරුන් ද ඒ වෙත යන්නේ හැංගෙන්නේ නෑ සඳ ආයේ හිනැහෙන්න තරු ඒ යාමේ උපදින්නේ ඔබ මතු බවයේ - හිනැහෙන්න සුහදී පෙරසේ"},
{"title": "අතීත දිවියේ අනන්ත අඳුරේ", "artist": "ජෝතිපාල H.R.", "author": "Unknown", "lyrics": "අතීත දිවියේ අනන්ත අඳුරේ විඩාව නිමවේ මිලාන දෙනෙතේ වියෝග කඳුලේ සිනාව මතුවේ උදාර මවගේ සෙනේහ දැඩිවී සිතේහි පුතුගේ අසාර කතරේ තුෂාර සිසිලයි දයාව මවගේ විනීත මවගේ පැතීම නොතකා ගියාම දුකසේ හඩන්න වූයේ තුසිත විමානේ අපාය වෙත මා ගියාසේ කඳුලැලි හෙළන්න වූයේ සමාව ඉල්ලා දෙපා වදින්නයි රත්තරන් අම්මා බලන්න ආවේ විනාසේ ගැලලූ ඔබේම පුතුනු ලැබීම් පිටුපා දයාව අම්මේ අගේට පැළඳූ ගෙල වට මාලේ එදා සොරා ගෙන ගියානෙ අම්මේ මගේම දැතින් පළඳවන්නයි මෙදා  මාලේ මා ගෙනාවේ අම්මේ සමාව ඉල්ලා දෙපා වදින්නයි සමාව දෙනු මැන පුතුහට අම්මේ"},
{"title": "ඇස්‌ දෙක වාගේ හිටිය", "artist": "ජෝතිපාල H.R.", "author": "Unknown", "lyrics": "ඇස්‌ දෙක වාගේ හිටිය දෙන්නට මේ මොකද වුනේ ඔබෙ අත ගන්න පවා වාසනාව නැද්ද අනේ දෙන්නට මොකද වුනේ පෙම් ලෝකයේ කොතරම් අවහිර බාධා තිබුණත් එක හිත ඇත්නම් බෑ වෙන් කරන්න සිහිනෙන් වත් ඔයාගේ නම රැදුනේ මගෙ මේ තොල් අතර නොවේ උපදින හැම වාරෙම වෙන කාටත් අයිති නොවේ - ඔයාව අයිති නොවේ ආදර බලකොටුවේ ඔබ සුරැකිව තබා ගමී එන හැම දේකට එඩිතරවී මම පපුව දෙමි අවත් කුහක ලොවේ මට පිට පිට ඇනුම් බැනුම් එනවා ළඟට ඔබේ මැරෙන්න මොහොතකට කලින් - මැරෙන්නෙ ළඟට ඇවිත්"},
{"title": "අඬන්නේ ඇයි සුදු මැනිකේ", "artist": "ජෝතිපාල H.R.", "author": "Unknown", "lyrics": "අඬන්නේ ඇයි සුදු මැනිකේ කියන්න පණ මාගේ හෙලන්නේ ඇයි කදුලැලි ආදර නිල්මිණි දෑසේ ඔයාව ජීවිතයේ මට හමුවුණ මුල් දවසේ සිනාවේ දෑසේ අහිංසක ආදරයයි තිබුණේ කියාපු මිහිරිකතා තවමත් ඇහෙනවා වාගේ ප්‍රියාවී රැක ගන්නම් හද බලකොටුවෙහි මාගේ පරාද වෙන්න ඉඩක්‌ නෑ අපි දෙන්නගෙ ප්‍රේමේ දිනන්නේ යන යන තැන ඔබ හින්දයි මා ලෝකේ මැණිකේ සුවඳ මලයි පිපි බාධක කටු අකුලේ සිටින්න දෝතින් ඒ මල නෙලනා තුරු මැණිකේ දිලෙන්නෙ එක තරුවයි සඳ වටකර පෙම් ලෝකේ සඳ මැණිකෙයි මම තරුවයි පායන රෑ අහසේ"},
{"title": "අඬන්නේපා සුදු මැණිකේ", "artist": "ජෝතිපාල H.R.", "author": "Unknown", "lyrics": "අඬන්නේපා සුදු මැණිකේ මා ඔබ ළඟමයි ඉන්නේ අඩන්නෙපා සුදු මැණිකේ මා නැත ඔබ හැර යන්නේ රෑ දාවල් යයි ගෙවිලා මම ඉමි ඔබ වෙත රැදිලා මධු රස බසකින් නළවා මම ඉමි පාළුව පලවා අදමෙන් හෙට සනසන්නම් මිහිරෙන් මිහිර පොවන්නම් සැප සම්පත් ගෙන දෙන්නම් ඔබ සුබ සිහින සැබෑ කරවන්නම් මල් යහනක සතපන්නෙම් මල් පැණි පෙරලා දෙන්නම් මුතුවැල් ගෙළ පළඳන්නම් රන් විමනක රඳවන්නම්"},
{"title": "ඇහෙනවනම් හිත හඬන තරම්", "artist": "ජෝතිපාල H.R.", "author": "Unknown", "lyrics": "කිසිවෙකු නෑ ලොව හිනැහෙන්නේ පෙරදින රජ මැදුරක උන්නේ අද මා මහමග සැතපෙන්නේ පතන පැතුම් සුළගට මුසුවේ මියුරු වදන් කදුලේ ගොළුවේ සතුට උපන් හැම දින වැළලේ කුමන නැටුම්දෝ දිවි මඩලේ අපගෙ අහිංසක ලොව බිදිලා ඔබද අනන්තෙක ඇත බැදිලා ගිණි දළුවා ගත වෙළෙනු පෙනේ ඔබ මල් යහනක හිදිනු මැනේ"},
{"title": "අහසේ ලියුවත් පොළොවෙ කෙටුවත්", "artist": "ජෝතිපාල H.R.", "author": "Unknown", "lyrics": "අහසේ ලියුවත් පොළොවෙ කෙටුවත් කළ නොහැකිය නිම් ඕ පුවත අපේ පෙම් ආ යන්නෙන් ආදර ගීතේ - මුලින් ලියූ සිහින පොතෙහි සීගිරියේ ගී වැල් වාගේ - දෙදෙනාගේම මතක තියේවී දේදුන්න සේ මැකී නොයේවා - ආවත් වියෝග අන්ධකාරේ මුව පියුමේ උතුරන සීනේ - මම නිරතුරු රැදෙමි දයාවී අපි ගැන පඬිවරුද කතාවී - මතු ඉතිහාසය ද කියාවී රාමා සීතා කතන්දරේ මෙන් - යුගයෙන් යුගයට එය පැතිරේවී කඳුළු හෙළූ දෙකොපුල් යහනේ - විඩා නිවා ලැඟුම් ලබන්නයි පියෙන් පියට ඇස්‌ වැල් පටලා - දිවි ඇතිතුරු ගමන් කරන්නයි මා ඉන්නේ ඔබ පැමිණෙන තුරු - ආදරයේ තනි නවාතැනේ මේ"},
{"title": "ආලෝකේ බිහිවේ පැතිරේදෝ", "artist": "ජෝතිපාල H.R.", "author": "Unknown", "lyrics": "ආලෝකේ බිහිවේ පැතිරේදෝ ආශාව ඉටුවී සපිරෙයි දෝ වැළලුණු මල ඊයේ තව හෙටක්‌ තියේ සටනකි ජීවිතේ ජය පරාද වේ කල්පනාව පෙරසේ නැත ඇහැරීලා කොටුවීලා සිතු සේ රන් කුරුල්ලෙකු සේ යමී පියඹලා සැනසීලා සිතුසේ ආකාසේ හිරු දෙවියෝ හිනැහෙනවා අපේ ජය පරාදවේ සටනකි සත්‍යයෙන්ම මිස ලොව කවදාද අවනිති දිනුවේ යුක්‌ති ධර්මේ අනුව සත්‍ය බලවත්ව තෙදවත්ව රජවේ රැයම නොවේ දහවල වේ නියදම සේ ලොවේ ජය පරාද වේ"},
{"title": "ගමට කලින් හිරු", "artist": "කරුණාරත්න දිවුල්ගනේ", "author": "Unknown", "lyrics": "ගමට කලින් හිරු මුළුතැන් ගෙට වඩිනා ඒ හිරු එළියේ නැන මල් පොඩි පිපුණා ඒ මල් සුව‍‍‍‍ඳේ අද ලොව් තුරු සුව විඳිනා කලා වැවේ නිල් දියවර අපෙ අම්මා… රෑ කළුවර අරගෙන දරුවන් එනතුරු සිත නෑ නිවන් දකින්නේ රෑ කළුවර ඇවිදින් ඉකිබිඳ හැඬුවත් නෙත නෑ නිදි විඳගන්නේ හෙට අරුණට සැරසෙන තව දවසක් ගැන නින්දේ සිහින දකින්නේ මහමායාවනි කවදාදෝ ඔය නෙත් දරු සෙහෙහසින් මිදින්නේ… වෙල් දෙණිවල ඇවිදින් දෙපා රිදෙන විට විහඟ ගීත බණ පද වේවා බෝ මළුවක ඇවිලෙන පහන් වැටක් සේ තුන් සිත නිවී සැදේවා මතු උපදින සසරේ විශාකාව වී මෙත් මග නෙත් හමුවේවා ඇත් රැජිණියනේ ඔබෙ නැළවිලි ගීතය ලොවම නිදන කවියක් වේව…"},
{"title": "ගහක මල් පිපිලා", "artist": "කරුණාරත්න දිවුල්ගනේ", "author": "Unknown", "lyrics": "ගහක මල් පිපිලා පිපෙන්නේ ඇයිද නොදන්නෙමි හිතක මල් පිපිලා පිපෙන්නේ ඇයිද නොදන්නෙමි නුඹට සිත බැදුනේ කිමැයි මා තවම නොදන්නෙමි නුඹට සිත බැඳි කාරනේ මම තවම සොයන්නෙමි කතරෙ වැලි කැට හිරුට පෙම් බැඳ ඇතත් ලෝ දහමෙන් සොඳුරු වැස්සට දැවෙන කතරත් ආදරෙයි පණ මෙන් ලොවට නොපෙනෙන අරුම සෙනෙහස ඒ වගේ මනරම් කරනු බැරි තහනම් ගහක මල් පිපිලා … සඳට සදහට සෙනේ පෑ මුත් උදුල තරු කැටයම් හිරුට පෙම් බැඳි එකද තරුවක් සිටිය නොහැකිද යම් නුඹට නොහැ‍‍‍ඟෙන මගේ ප්‍රේමය ඒ වගේ මනරම් පුදුම වෙයි නුඹ නම් ගහක මල් පිපිලා …"},
{"title": "දුර කතර ගෙවාගෙන", "artist": "කරුණාරත්න දිවුල්ගනේ", "author": "Unknown", "lyrics": "දුර කතර ගෙවාගෙන මම නොකියම ආවට මට සමාවෙයන් බණ්ඩර මැණිකේ අර බලන්න අර පුර හඳ අහසේ දුම් වලාකුළෙන් තරුකැට හැංගිලා නෙත් කොණින් බලා මට ඉඟි බිඟි කළා මට ඉන්නට බෑ කොළොම්තොටට වෙලා උඹෙ කතාකරන දෑස මතක් වෙලා මහා මැදුරු උඩින් පුර හඳ පායලා නුඹෙ මුහුණ පෙනුණේ මුළු අහසම පුරා ඒ සෙනෙහෙවන්ත කමට වහල් වෙලා මට ගම නෑවිත් ඉන්නට බැරිවුණා"},
{"title": "චන්ද්‍ර කින්නර ජාතකේ", "artist": "කරුණාරත්න දිවුල්ගනේ", "author": "Unknown", "lyrics": "චන්ද්‍ර කින්නර ජාතකේ කිඳුරිය ලෙසින් නුඹ පෙම් බැඳන් මට ළං උනා පෙම් බැඳන් ආ කින්නරාවී මගෙ ළඟින් හිඳ වෙන් උනා… චන්ද්‍ර කින්නර ජාතකේ… ගෙට එන්න පෙර කී කතා උඩුගම් බලි ගියෙ දෝ මෙදා විස හී සරේ පපුවට හෙලා නුඹ නාටකේ වෙනසක් කළා… අත දරුවො ගෙන මහගිරි දඹේ තනිවම නගින්නද පෙම් කළේ කළු කාසියට හදවත් වැසේ නුඹ සොයනවද බරණැස් පුරේ… චන්ද්‍ර කින්නර ජාතකේ…"},
{"title": "බැබලීම වගෙම", "artist": "කරුණාරත්න දිවුල්ගනේ", "author": "Unknown", "lyrics": "බැබලීම වගෙම බැසයාම අයිති සඳටයි පිබිදීම වගෙම පරවීම අයිති මලටයි හැමදාම වගෙම මම තාම අයිති නුඹටයි රැවටෙන්න වගෙම රවටන්න හිතක් නැතී හංඟන්න වගෙම පෙන්වන්න කිසිත් නැතී නුඹ දන්න තරම් මගෙ හිත වෙනදන්න කෙනෙකු ලොව මට හමුවෙලා නැතී හිමිවන්න කියා හමුවන්න හිතක් නැතී පිංවන්ත හිතේ විඳවන්න දුකක් නැතී අදහන්න නමුත් හැකි වෙද නුඹ දුන්නෙ නැතත් නුඹෙ හිත මගෙ ලඟම ඇතී"},
{"title": "අතීතය සිහිනයක් පමණයි", "artist": "කරුණාරත්න දිවුල්ගනේ", "author": "Unknown", "lyrics": "අතීතය සිහිනයක් පමණයි සැබෑ සුවඳක් නෑ එදා සෙනෙහෙන් නොබැඳුනා නම් මෙදා වියෝවක් නෑ… තැනූ මන්දිර බිඳී වැටුනත් නෙතේ කඳුළක් නෑ සිනහ වෙන්නට වරම් නොලදත් සිතේ කිලුටක් නෑ… අතීතය සිහිනයක් පමණයි… සොබා දහමට නොවන අවනත ලොවේ කිසිවක් නෑ ලොවේ පැරදුම මිසක කිසිදා ලැබූ දිනුමක් නෑ… අතීතය සිහිනයක් පමණයි…"},
{"title": "ඇසට අසුවන මායිමේ", "artist": "කරුණාරත්න දිවුල්ගනේ", "author": "Unknown", "lyrics": "ඇසට අසුවන මායිමේ බමර සැණකෙළි මල් වනේ ලසෝ ලැවිගිනි ඇවිලුනා සිත ඔබ මගෙන් වෙන්වූ දිනේ සියපතක් මත විසුල පිණිකැට සැඬ සුළං වැද සරසරින් වෙද මගෙන් රිදවුම් දෙවුණු මොහොතක නුඹේ වත මට නැඟේ සිහියට සතර අත පෙති විහිද විකසිත මලේ මල් මී බමනයුරු දැක ඔබේ ලවනත නැඟුණු මීවිත මත්කළා මතකයි මගේ සිත"},
{"title": "අන්දර යායේ", "artist": "කරුණාරත්න දිවුල්ගනේ", "author": "Unknown", "lyrics": "අන්දර යායේ වැව්තාවුල්ලේ සක්මන් කරනා අප්පච්චී දොලේ දියයි මට කෙතේ නිලයි ගහ වැලේ මලයි මට අප්පච්චී වළාකුලේ දා බිදු තවරා මහපොළවට මහ වැසි ගෙනෙනා දිවි ගමනේ ඉම කදුමුදුනේ හිද පිතු සෙනෙහේ කඳුලැලි සලනා අන්දර යායේ තුරු හිස මුදුනේ මල් ඵලදා කැකුළු මුවට ඵල වැල නෙලුවා ඒ දඬු මං බැද සත්කුළු පව් බිද සිදාදියට යන මං තැනුවා අන්දර යායේ"},
{"title": "අජානේය ස්කූටර්", "artist": "කරුණාරත්න දිවුල්ගනේ", "author": "Rathna Sri Wijesinghe", "lyrics": "අජානේය ස්කූටර් තුරඟා පිට වඩිනා කුමාරියනි වාත වේගයෙන් ඉගිලෙනු කොතැනා බදා හිමි දෙඋර එසැවී පුරවර සිරි බලනා විලාසයට නුඹේ කිරුල බිම වැටෙයිද සිතුණා සූ සැට ශිල්පය උගෙනා පාරගතව ගියෙනා පාරෙ වැඩට හවුල් වෙන්න උදැල්ල මට ලැබුණා මා ගත ඩා බිඳු හඳුනා තදය සිනා නගනා ප්‍රේමවන්ති විලවුන් ගෑ ලේන්සු පට සිඹිනා අජානේය ස්කූටර් සදාකල්ම පෙම්වතුන්ගෙ සිහින පුරා පිපෙනා උදුම්බරා මලක් තියේ ආදරයයි කියනා රෑ තුන් යම සුවඳ උලා උදෑසනින් මැකෙනා කාට අහිමි උනත් සාදු මල් පිපියන් සැමදා අජානේය ස්කූටර්"},
{"title": "ඉරිමා උදයේ", "artist": "ඉන්ද්‍රචාපා ලියනගේ සමග කසුන් කල්හාර", "author": "Unknown", "lyrics": "ඉරිමා උදයේ සීතල මුතු පිණි මතින් මද්දහනේ වැටෙනා හිරුගේ කිරණ වැසි සිත් නිම්නයට සතුටක් ගතේ දුවනා ආදරේ නොදී එය සඟවා මුවගට සිනා තබා දෑසට කඳුළු ගෙනා ඔබ ඇඳි සිතුවම් මතකේ රැඳුණා එය දකිනා නෙත් සතුටක්දෝ"},
{"title": "එක වසන්තයක", "artist": "කසුන් කල්හාර", "author": "Unknown", "lyrics": "එක වසන්තයක එක රාත්‍රියක දැනුනා මතකයි මට ඉබේම වාගේ ඔබෙ සුවද එක හුස්මක්වත් ගන්නට ඉඩ නැති තරමට දැනුනා විතරක් මතකයි හද ලුහුබැද ඉව කරනා පෙර සසරක සුපුරුදු සුවද ඒ ඔබේ නොවෙද එනමුදු ඒ ඔබමද ඔබමද ඒ සොදුර මේ වසන්තයේ හමුවෙන සුලග සමග සසැදී පැහෙන්නට හිතයි මට ඔබෙ සුවද සමග මුසු වනු පිණිස මගෙ සුසුමක් තියන්නද සිහිවනු පිණිස සොදුර මේ වසන්තයෙම ගතවී යන්නට පෙර තුරුලේ ඇහිරෙන්නට පතමි මම ඔබෙ සිතැගි වලට මුසු වනු පිණිස මගෙ හැගුමක් තියන්නද ගිවිසනු පිණිස සොදුර"},
{"title": "ආදරය සුන්දර වරදකි", "artist": "කරුණාරත්න දිවුල්ගනේ", "author": "Unknown", "lyrics": "ආදරය සුන්දර වරදකි කිසිදා සමාවක්‌ නම් නැති මට පෙන්නලා ආලේ හැටි නුඹ දුන්නු දුක හොඳටම ඇති ඉඳුවර නුවන් දෑලේ වැටී පෑහී බැහැරී වෙලී උන්මාද වූයේ මා වෙනකෙකු දිහා බැලුමට යලිත් මට නෙත් නැතැයි කෙඳිරුවේ කවුරුන්දෝ පුළුලුරුතලා වීණා බඳින් දැවටී රතැඟිලි බැඳී නින්නාදයේ අනුරා හද ස්‌වර පවා කම්පිත වෙවී මට මා පවා නැති කලේ කවුරුන්දෝ"},
{"title": "හෙට අළුත් අළුයමක්", "artist": "කසුන් කල්හාර", "author": "Unknown", "lyrics": "හෙට අළුත් අළුයමක් වෙන කවරදාකටත් වඩා මිහිමත මල් පිපෙන දවසක් පුංචි කුමාරියක් හිරිමල් හිනා අරන් මග බල‍න් ඉන්න බවට දුන් නිසා පොරොන්දුවක් ඉරත් හැංගිලා බලා හිඳී වලාකඳු යටින් ලා හිරු කදම්බයක් හෙලා අප හමුවීම කරන්න ආලෝකමත් අප හමුවීම කරන්න ආලෝකමත් සුළඟ ගල් ගැහී හමා නො ඒ ඈත කඳු වෙතින් ලාපත් අහුරක් විසුරුවා අප හමුවීම කරන්න අසිරිමත් අප හමුවීම කරන්න අසිරිමත්"},
{"title": "ඇරඹුමම කඳුලක් වෙලා", "artist": "කසුන් කල්හාර", "author": "Unknown", "lyrics": "ඇරඹුමම කඳුලක් වෙලා මා බලා ඉද්දී ඒ දිහා ආ තුරක් දුර වැඩි නිසා අවසානයට පෙර ඈ ගියා දුක් බරව කවියක් ලියා එහි පද පෙලක් අඩුවෙන් තියා අරුත පසිඳින්නට කියා අවසානයට පෙර ඈ ගියා ශෝකාන්තය එනතුරා එහි රැ‍ඳෙන්නට සිත් නැති නියා අනන්තය ලග මා දමා අවසානයට පෙර ඈ ගියා ඇරඹුම ම කඳුලක් වෙලා මා බලා ඉද්දී ඒ දිහා ආ තුරක් දුර වැඩි නිසා අවසානයට පෙර ඈ ගියා"},
{"title": "අඳුරේ මැදියමේ", "artist": "කසුන් කල්හාර", "author": "Unknown", "lyrics": "අඳුරේ මැදියමේ නිදි වරා වැපිරූ සිහිනේ කඳුළු අතුරා පුළිඟු සැඟවූ සිහිනේ මොහොතක් ගැවසෙන්න අහම්බෙන්වත් හමුවී යමුද වචනයක් කියනවද තව එක දවසක් ගෙවා ගන්න සිහින අතැර ගිය ජීවිතේ මරණ ආගාධයේ තනිකමේ හිඳිමි මම ඔබද එය දන්නවා සිහින සොහොන ළඟ ජීවිතේ නොමළ සිත සමග තනිකමේ හිඳිමි මම ඔබද එය දන්නවා මොහොතක් ගැවසෙන්න අහම්බෙන්වත් හමුවී යමුද වචනයක් කියනවද තව එක දවසක් ගෙවා ගන්න සොඳුරු ලෝකාන්තය මුදුනතේ මතක භශ්මයන් හද දරා හිඳිමි මම ඔබද එය දන්නවා නොඑනා සෘතුවක බර දරා අහිමි හුස්මකට ළය අයා හිඳිමි මම ඔබද එය දන්නවා මොහොතක් ගැවසෙන්න අහම්බෙන්වත් හමුවී යමුද වචනයක් කියනවද තව එක දවසක් ගෙවා ගන්න"},
{"title": "ආකාස ගඟේ", "artist": "කසුන් කල්හාර", "author": "Himali N Liyanage", "lyrics": "ආකාස ගඟේ-වළාවේ වෙළී සීමාව සොයා සිසාරා ඇදී එමි ආදරී සිත සාදමී මෘදු හාදු දී හද ගිනි නිවමි සුළඟ හිමිහිට හැමුවාවේ කොහෙද ඇය මට කිව්වාවේ පෑයූව සඳේ අකාසේ රැඳී ඈ වාගේ දිලී රිදවයි නුඹ හිනැහී ඈ ඉන්නා සී මැදුරේ ලා අඳුරේ මේ යාමේ පාවේ දෝ ගී රාවේ පීඩා වී සංතාපේ ඒ හඬනා හඬ දෝ ඇයගේ දෑසේම පායා රෑ සීන ගේනා ඈ කෝ සොයා දැවෙමී පෑයූව සඳේ ආකාසේ රැඳී ඈ වාගේ දිලී රිදවයි නුඹ හිනැහී රෑ බෝවී ආවාවේ දී දුක් දී හේමන්තේ නෑ එන්නේ මල් වාරේ සරසාලා ඈ හිසකේ ඈ මතකේ සුසුමේ සිරවේ දෑසේම පායා රෑ සීන ගේනා ඈ කෝ සොයා දැවෙමී පෑයූව සඳේ ආකාසේ රැඳී ඈ වාගේ දිලී රිදවයි නුඹ හිනැහී ආකාස ගඟේ-වළාවේ වෙළී සීමාව සොයා සිසාරා ඇදී එමි ආදරී සිත සාදමී මෘදු හාදු දී හද ගිනි නිවමි සුළඟ හිමිහිට හැමුවාවේ කොහෙද ඇය මට කිව්වාවේ පෑයූව සඳේ අකාසේ රැඳී ඈ වාගේ දිලී රිදවයි නුඹ හිනැහී"},
{"title": "ආදරණීය වස්සානේ", "artist": "කසුන් කල්හාර", "author": "Unknown", "lyrics": "හීනයකි මට ආදරේ හැඟෙනව මට ජීවිතේ හිනයට ළඟ ජිවිතේ හැඟෙනවා මගෙ ආදරේ වැටෙනකොට කඳුළු ඇවිලිලා සුවඳ මල් පෙති පරවෙලා සුවඳ මල් පෙති පරවෙලා වස්සාන සිහිනේ ඇවිලිලා සුසුමේ තවරා සැඟවු සිහිනේ ආආආආදරණීය වස්සානේ"},
{"title": "ආදර මල් වල", "artist": "කසුන් කල්හාර", "author": "Unknown", "lyrics": "ආදර මල් වල පාට කියන්නද මේ වගෙ ලස්සන තව නෑ මේ වගෙ ලස්සන තව නෑ මීදුම් පිණි පොද දෑස වසන් කල සමනල් සිහිනය පිපුනා සමනල් සිහිනය පි පු නා දේදුනු රේඛා - දෑසම තවරා තවමත් මල් සිත - බලා සිටිනවා මීදුම් තවරා සුළඟක - ඈතක සගවා තුන්සිත දෑස හොරෙන් ඈත‍ සොයනවා අදුර මැදින් එන්න සදලියේ දේදුනු සායම - දෑස‍ බොඳ කල මාලති යායක හැලිලා මාලති යායක හැලිලා සීතල හිම කදු යාය පිය මැන දෙව්ලිය සිහිනෙක වැ‍ඩියා දෙව්ලිය සිහිනෙක වැ‍ඩියා"},
{"title": "කඳුළු සුන්දරද", "artist": "කිංස්ලි පීරිස්", "author": "Unknown", "lyrics": "කඳුළු සුන්දරද මාව හඬවන්නේ ඔබට සතුටක්ද කඳුළු දුටු මොහොතේ සුන්දරයි කවිය ඔබ ලියූ පෙමට මටත් නොදැනීම හැඬුනේ කවිකමට එපා හඬවන්න මා ආදරෙන් ඉන්න කඳුළු සුන්දරද සිනිඳු වැඩිකමට මගේ හදමඬල පුංචි රිදුමකට හැඬෙයි නොදැනීම එපා හඬවන්න මා ආදරෙන් ඉන්න කඳුළු සුන්දරද"},
{"title": "කෙටිම කෙටි කතාවක්", "artist": "කිත්සිරි ජයසේකර", "author": "Chaminda Rathnasuriya", "lyrics": "කෙටිම කෙටි කතාවක් මං ඔබ ගැනම ලියන්නම් මා අතැර ගියේ ඔබ බව එහි නොලියා ඉන්නම් ඔබ පැරණි මතකයෙන් මා මුදවනවා නම් සුදු ඔබ පැරණි මතකයෙන් මා මුදවනවා නම් සඳ නිවෙන තරු මඩල යට ගොස නගන මූදු රළ දෙස වරු ගණන් බලා උන් වග එහි නොලියා ඉන්නම් ඔබ පැරණි මතකයෙන් මා මුදවනවා නම් සුදු ඔබ පැරණි මතකයෙන් මා මුදවනවා නම් ගත හිවුඩු පිපෙන සීතේ දුම්රියේ එකට එක ළඟ දුර ගමන් ගෙවා ගිය වග එහි නොලියා ඉන්නම් ඔබ පැරණි මතකයෙන් මා මුදවනවා නම් සුදු ඔබ පැරණි මතකයෙන් මා මුදවනවා නම් කෙටිම කෙටි කතාවක්"},
{"title": "ආඩම්බර සඳ", "artist": "කසුන් කල්හාර", "author": "Unknown", "lyrics": "ආඩම්බර සඳ සිරියහනට වැද ඇයි අද මේ තරමට දඟ කියන්න කියන්න කියන්න කියන්න පුන්සඳ කෞමතී මලක් යහනට එවන්නේ කවදද දොර සිදුරෙන් ආල කැළුම් සිරි යහනේ අතුරලා රෑ කුමාරි මල් සුවඳක් සුළඟෙ එවයි දවටලා ඕ හොඕ හැමදාමත් සිහින වැලක් ඉහ ඉද්දර බොඳ කලා නීල වලා කෙඳි අමුණා යහන වටේ සරසලා සිකුරු තරුව කැන්දාගෙන යහනේ සරදම් කලා පිණි කඳුලක් තබා හොරෙන් උදේම පිටමං වෙලා ආඩම්බර සඳ සිරියහනට වැද"},
{"title": "හීන අරන්", "artist": "කිත්සිරි ජයසේකර", "author": "Unknown", "lyrics": "හීන අරන් රෑ තරු මල් අහසෙ පිපෙනවාලු වසන්තයක නැවුම් සුවඳ හිතට එබෙනවාලු කල්ප පුරා නෙතු උතුරා ගැලූ කඳුළු වේලු එක හුස්මට අමතක කල දවසක් එනවාලු මට මගේ කියා කියාගන්න කිසිවක් නැති දාක සඳක් වෙලා ඈ පිපුණා තරුවක් නැති රෑක කියාගන්නෙ කොහොම හිත ගොළු වී තාම යාය පුරා හිත වපුරා මල්වර නෙතු ගාව නොකී කඳුළු අමතක කල සුවඳකි වත පෑව නොලීව කවි ලීව මට නැති වුනි මාව හීන අරන් රෑ තරු මල් අහසෙ පිපෙනවාලු වසන්තයක නැවුම් සුවඳ හිතට එබෙනවාලු කල්ප පුරා නෙතු උතුරා ගැලූ කඳුළු වේලු එක හුස්මට අමතක කල දවසක් එනවාලු"},
{"title": "දැල්වෙනා පහන්", "artist": "කිත්සිරි ජයසේකර", "author": "Unknown", "lyrics": "දැල්වෙනා පහන් නිවා දමා මගේ අතින් දල්වමී ඔබේ නුවන් පහන් සදා ඉතින් ලෝකයෙන් ලඟා වෙනා අනේක වූ රිදුම් මාරුතේ හොවන්නෙමි ප්‍රියේ ඔබේ නමින් මල් උයන් දැවූ කුණාටුවෙන් පවා මිදී බලන්න මේ බලන්න මේ අපේ පැතුම් පිපී මල් උයන් දැවූ කුණාටුවෙන් පවා මිදී බලන්න මේ බලන්න මේ අපේ පැතුම් පිපී ජීවිතේ පෙමින් අරන් එමී ඔව් ඔබේ නමින් පළන්දමී ජීවිතේ පෙමින් අරන් එමී ඔව් ඔබේ නමින් පළන්දමී දුකයි මේ දුරු අගාධේ මැවෙයි එහි රන් විමානේ ඔබයි ගැයෙනා ප්‍රගීතේ මමයි උණුසුම සුසීතේ රෑ සඳේ රන් දහරින් සරසම් සාගරේ මුතු වැල් මෙන් එලවම් හීනයෙන් මිදේය පෙම්දම් මීවිතක්ය ජීවිතේ අපේ ජීවිතේ පෙමින් අරන් එමී ඔව් ඔබේ නමින් පළන්දමී දුකයි මේ දුරු අගාධේ මැවෙයි එහි රන් විමානේ ඔබයි ගැයෙනා ප්‍රගීතේ මමයි උණුසුම සුසීතේ රෑ සඳේ රන් දහරින් සරසම් සාගරේ මුතු වැල් මෙන් එලවම් හීනයෙන් මිදේය පෙම්දම් මීවිතක්ය ජීවිතේ අපේ ජීවිතේ පෙමින් අරන් එමී ඔව් ඔබේ නමින් පළන්දමී"},
{"title": "ඇසි දිසි ටෙලි නළුවේ", "artist": "කිත්සිරි ජයසේකර", "author": "Chaminda Rathnasuriya", "lyrics": "ඇසි දිසි ටෙලි නළුවේ කිවිවර කවි සමයේ සිත්තර තෙලි තුඩගේ ඔබයි මුණගැසුනේ ඇසිපිය ලන මෘදු ස්වරයේ දෑස් නිල් විලේ කිමිදී ආදරය සොයමී ඒ ඇසුරේ නිනව් නැති දිගු හීනයේ ඇසි දිසි ටෙලි නළුවේ චාරු මන්දස්මිතයේ මුවින් නොබිනූ වදනේ ජීවිතය සොයමි ඒ ඇසුරේ නිනව් නැති දිගු හීනයේ ඇසි දිසි ටෙලි නළුවේ"},
{"title": "අමීෂා", "artist": "කිත්සිරි ජයසේකර", "author": "Chaminda Rathnasuriya", "lyrics": "සඳකත් පිණි දිය කඩා හැලෙනවා දැව මුවා කුළුණු හිස පහන් නිවෙනවා මං එනතුරු අද්දර අල්තාරේ ඉන්නවද බලා අමීෂා අමීෂා අමීෂා රුක් අල්කාරී කන්දෙන් පාර අසා සූවස් සයුරේ රළ රැලිති මකා මං එනතුරු අද්දර අල්තාරේ ඉන්නවද බලා අමීෂා අමීෂා අමීෂා රුබියා කතරේ පා සළකුණු නොතියා නයිල් නිම්නයේ සුළඟටවත් නොකියා මං එනතුරු අද්දර අල්තාරේ ඉන්නවද බලා අමීෂා අමීෂා අමීෂා අමීෂා"},
{"title": "සමාව ඉල්ලා හඬා වැටෙන්නද", "artist": "ලක්ශ්මන්  විජේසේකර", "author": "Buddhadasa Galappaththi", "lyrics": "සමාව ඉල්ලා හඬා වැටෙන්නද ඔබ ආදරය කලේ පරාද කර මා හද රිදවන්නද ඔබ ආදරය කලේ ඔබ ආදරය කලේ තරු නැති කළුවර පාළු අහස් ගැබ පුරා හදක් සේ පායා ආ ඔබ ඇයි මා අතැර ගියේ සමාව ඉල්ලා ඔබේ පෙමට වෙන්වූ මා හදවත හඳුනන්නට බැරිවී දෝ ඔබ හට ඇයි මා අතැර ගියේ සමාව ඉල්ලා"},
{"title": "කෙසේ රහස් පවසම්", "artist": "ලහිරු පෙරේරා", "author": "Unknown", "lyrics": "කෙසේ රහස් පවසම් කෙසේ තුරුලේ සැනසෙම් කෙසේ අමතක කරම් පවසම් හදින් මෙමා ජයමංගලම් ජීවන අඳුරු කුටියේ මිණි පහන ඔබ උනේ මව්පියන් සමඟින් මා හැදු හැටි අගේ දුක් වේදනා - මගෙ නිව්වා මවකි මටනම් - මගෙ අක්කා කෙසේ රහස් පවසම් සරසියකි මටනම් ඔබ අනතප් විලේ සුරඟනකි මටනම් ඈ සිහින ලෝකේ ඔබ දිවි මගේ මල් පිපියන මතු භවයෙදිත් අක්කා වෙයන් කෙසේ රහස් පවසම්"},
{"title": "දෑත දෙපාලන", "artist": "ලක්ශ්මන්  විජේසේකර", "author": "Kumaradhasa Saputhanthree", "lyrics": "දෑත දෙපා ලන ගිගිරි සරින් මා කැඳවා නොතැවෙන් සිවුසිය ගව් දුර ඇදෙන ලෙසින් සෝක සුසුම් නොහෙලන් පෙරමග පියවර මැකෙන ලෙසින් ඈතට යනු මැන අසුරු සැනින් මා හඬවන්නට සිහින තුලින් අයදිමි යළි මෙහි නොඑන ලෙසින් දෑත දෙපා ලන ගිගිරි සරින් නිදි යහනට වන් අකුණු සරින් මතක සිහින සිතුවිලි පුබුදන් හද මළගම දා මම වැලපෙන් විදුලිය සේ යළි සිනහ නොවෙන් දෑත දෙපා ලන ගිගිරි සරින්"},
{"title": "අවසන් සැඳෑවයි", "artist": "ලලිත්  පොන්නප්පෙරුම", "author": "Unknown", "lyrics": "අවසන් සැඳෑවයි දෙදෙනා හමු වූ මින් මතු නෑ අප හමු වන්නේ දෛවය ළං කළ අප දෙදෙනාදෝ වෙන් වී යන්නට සැරසෙන්නේ ඔබගේ සුන්දර සමනළ ලෝකය බිඳලන්නට බැහැ කුරිරු වෙමින් කඳුළු දරාගෙන වෙන් වී යන්නට සමුදෙනු මැනවි සුහද සිතින් අවසන් සැඳෑවයි දෙදෙනා හමු වූ මින් මතු නෑ අප හමු වන්නේ දෛවය ළං කළ අප දෙදෙනාදෝ වෙන් වී යන්නට සැරසෙන්නේ ඉඳ හිට මග තොට හමුවන මොහොතක ඉවත බලාගෙන යන්න එපා මේ සංසාරෙදි මා නොපැතූවත් එය හඟවා රිදවන්න එපා අවසන් සැඳෑවයි දෙදෙනා හමු වූ මින් මතු නෑ අප හමු වන්නේ දෛවය ළං කළ අප දෙදෙනාදෝ වෙන් වී යන්නට සැරසෙන්නේ මින් මතු නෑ අප හමු වන්නේ වෙන් වී යන්නට සැරසෙන්නේ මින් මතු නෑ අප හමු වන්නේ"},
{"title": "දෑසින් පෑ", "artist": "ලහිරු පෙරේරා", "author": "Unknown", "lyrics": "දෑසින් පෑ මා ඉඟි මැරු දෙව්ලියේ රහසින් ඇයි හැඟුමන් මතු වී හදේ නෙතඟින් පෑ විසිරී උණුහුම රැඳේ දෑසින් පෑ මා ඉඟි මැරු දෙව්ලියේ යලි කිසිදා නොලියූ මේ ආදරේ බලා හිඳිම් හදින් සදා නොයන් ලඟින් නෙතේ වෙලී හදේ අදෙව් ලඳේ දෑසින් පෑ පැතූ පැතුම් ඔබෙන් සදා විඳීම් සුවෙන් අතේ වෙලී ලඟිම් රැඳෙන් මගේ දෑසින් පෑ"},
{"title": "ඔයා ළඟින් ඈත්වෙලා", "artist": "ලක්ශ්මන්  හේවාවිතාරණ", "author": "Unknown", "lyrics": "ඔයා ළඟින් ඈත් වෙලා හිඳින්න බැරුව තනි වුණ මගෙ හිත පතන්නෙ තවමත් ඔබව ඉස්සර වගෙ මගේ ළඟින් ඔබ නැතුවාට කඳුළු පුරන මගෙ ඇස් දෙක හොයන්නෙ ඔබව නෙතු අතරේ කඳුළු ඇතත් ඔබ දකින්නෙ නෑ මා අත හැර වෙන් වුණාට තරහ වෙන්න බෑ ආදරයට දුන් මේ දුක උහුලන්නට බෑ කවදාවත් මට ඔයාව අමතක වෙන්නෑ ඔයා ළඟින් නැති පාළුව දරාගන්න බෑ ඔයා ළඟින් ඈත් වෙලා මට ඉන්නට බෑ ආදරයක් ගැන ආයෙත් හිතන්න මට බෑ කවදාවත් මට ඔයාව අමතක වෙන්නෑ"},
{"title": "රුවන් වලා විමානේ", "artist": "ලතා වල්පොල සමග ජෝතිපාල H.R.", "author": "Unknown", "lyrics": "රුවන් වලා විමානේ සිරි යහනාවෝ දුටුවාදෝ දෝතින් ඔබේ අරගන්න මා සතපන්න ඒ යහනාවේ රුවන් වලා විමානේ සිරි යහනාවෝ දුටුවාදෝ මේ දෑත සීතල ඇයිදෝ මට පවසන්න කොඳුරා ලඳේ නෑ තාම උණුසුම කුමරූ යමු තනිවෙන්න මිටියාවතේ ළංවෙන්න ලඟ ඉන්න කුමරී විලවුන් විජිතේ මගේ වාසනා රුවන් වලා විමානේ කඳුයාය අතරේ සුහදේ පෙම් විහඟුන් පරාදීසයේ මධු චන්ද්‍ර ඇරයුම් ගයනා අර ඇසුනාද මනමාලියේ පවසන්න මට ලංව මුමුණා මා පෙර නෑසූ පෙම් ගායනා රුවන් වලා විමානේ"},
{"title": "රොනට වඩින", "artist": "ලතා වල්පොල", "author": "Unknown", "lyrics": "රොනට වඩින බිඟු ඔබයි කැකුළු මල මමයි මලට සුවඳ ටික ඔබයි සිඟිති පෙති මමයි ජේසූ දෙවියනී ජේසූ දෙවියනී ජේසූ දෙවියනී ජේසූ දෙවියනී පහන් දොරට හිරු ඔබයි කුමුදිනිය මමයි රැයට දිළෙන හඳ ඔබයි හඳට රැය මමයි ජේසූ දෙවියනී ජේසූ දෙවියනී ජේසූ දෙවියනී ජේසූ දෙවියනී විලට වසින පිණි ඔබයි පද්මිණිය මමයි සුළඟ සළන සිරි ඔබයි ලලිතිණිය මමයි ජේසූ දෙවියනී ජේසූ දෙවියනී ජේසූ දෙවියනී ජේසූ දෙවියනී දියට මුහුද දෙවි ඔබයි ගලන ගඟ මමයි දිගත පතල ජල ඔබයි නගින රළ මමයි ජේසූ දෙවියනී ජේසූ දෙවියනී ජේසූ දෙවියනී ජේසූ දෙවියනී"},
{"title": "දම්පාටින් ලා", "artist": "මාලනී  බුලත්සිංහල", "author": "Unknown", "lyrics": "දම්පාටින් ලා සඳ බැස යනවා අකාසේ රන් වන් පාටයි සමුගෙන යන්න මගෙන් තව මොහොතයි නොදොඩා ඉන්නේ ඇයි රන් පටින් සඳ මුහුණ පෙනෙනවා වෙන්වී යන මොහොතක් නැගෙයි දෑසට ලංව බලන් මේ මොහොතේ ගොළුවී ඉන්නේ මං සෙවනැලි නොමැකේ නම් එලිය කළු නොවේ නම් බිත්ති පුරා ඔබෙ සෙවනැලි ඇන්දේ තනිය මකා ගන්නයි - එනතුරු සොයා මගේ සෙනෙහස මතුදා දම්පාටින් ලා‍‍‍ රෑ කල දිගුවේ නම් ලා සඳ නොමැකේ නම් නෙළුම් පතක රැදි පිණිබිදුවක් සේ ලමැද තලා යනහනේ ඉන්නම් පමාවෙලා හිරු නැගෙන තුරා දම්පාටින් ලා‍‍‍"},
{"title": "මාල ගිරා ගෙල", "artist": "ජයරත්න T.M. සමග ලතා වල්පොල", "author": "Ajantha Ranasinghe", "lyrics": "මාල ගිරා ගෙල මාල පොටක් බඳු ගෝමර පෙති මාලේ පාට සරුංගල් පාට නෙලාගෙන රුව දිලෙනා ලීලේ වතු සුදු මල සේ මා වත රූසිරු බෝමා කෝළ කොමළ වරුනේ සිත බැඳුනා ළඳුනේ මාල ගිරා ගෙල කදිම උවම් යොදලා කවි සීපද ගොතලා හීතල දුරුතු මහේ කියමුද අපි ළඳුනේ මාල ගිරා ගෙල කෙකටිය සුදට සුදෝ හිරිමල් කැකුළු මුවින් ටිකිරි හිනා බිංදු මට දෙනවද ළඳුනේ මාල ගිරා ගෙල"},
{"title": "දකින විට පන්සලක්", "artist": "මාලනී  බුලත්සිංහල", "author": "Unknown", "lyrics": "දකින විට පන්සලක් පිළිමයක් බෝධියක් හුනස්නෙන් නැගිටිමින් වදිනවා හදේ නැති භක්තියක් වත පුරා තවරගෙන අඩවන්ව නෙත් බරව බලනවා ගැඹිනි මව් කෙනෙකු හෝ රෝගියෙකු දුටුකලෙක කවුළුවෙන් අනන්තය සොයනවා අතෙහි රැදි පොත පතෙහි එකම පේලිය තුලම නෙත් දහස් වාරයක් දුවනවා දකින විට පන්සලක් වාරු නැති මහළු වත නෙතේ ගැටෙතැයි බියෙන් දෙනෙත් යුග නිදිකිරා වැටෙනවා ලොවේ නැති දහසකුත් ගැටළු සිහියට නගා අහසබිම ගැටලන්න හදනවා දකින විට පන්සලක්"},
{"title": "හිමි සණරාමර", "artist": "මාලනී  බුලත්සිංහල", "author": "Ven. Rambukkana Siddhartha Himi", "lyrics": "හිමි සණරාමර ලෝක සිවංකර ලොව්තුරු බුදු සමිඳේ මා හද මැලවෙන මල් දෝතට ගෙන පාද වඳිමි නිබඳේ පාද වඳිමි නිබඳේ හිමි ගුණ ආකර ලෝක දිවාකර ලොව්තුරු බුදු සමිඳේ හිත දුක වාවන බුදු බණ පදයක මිහිර දකිමි නිබඳේ මිහිර දකිමි නිබඳේ හිමි දම් ආකර ගුණ මිණි සාගර ලොව්තුරු බුදු සමිඳේ හිත සුවදායක බුදු ගුණ ගීයක රසය විඳිමි නිබඳේ රසය විඳිමි නිබඳේ හිමි සණරාමර ලෝක සිවංකර ලොව්තුරු බුදු සමිඳේ මා හද මැලවෙන මල් දෝතට ගෙන පාද වඳිමි නිබඳේ පාද වඳිමි නිබඳේ"},
{"title": "අකීකරු හිමියනේ", "artist": "මාලනී  බුලත්සිංහල", "author": "Saman Athawudahetti", "lyrics": "අකීකරු හිමියනේ මවක් සේ රකිමි ඔබ අකීකරු හිමියනේ මධු මතින් ගත රැදුණු නෙතු යුගල මට දෙන්න සෙහෙහසේ සිහිල් නිල් දියෙන් පුරවාලන්න අකීකරු හිමියනේ බඹර හිස සතපන්න හද යහන සදන්නට ප්‍රේමයේ නාමයෙන් මදක් අවසර දෙන්න අකීකරු හිමියනේ මධු විතින් නොනිමි දුක් කුණාටුව මට දෙන්න යලිදු හෙට උදෑසන මලක් සේ පිබිදෙන්න අකීකරු හිමියනේ මවක් සේ රකිමි ඔබ අකීකරු හිමියනේ"},
{"title": "අහසින් තරුවක්", "artist": "මාලනී  බුලත්සිංහල", "author": "Lushan Bulathsinhala", "lyrics": "අහසින් තරුවක් කඩා හැලෙනවා තරුව කතා නෑ අහසයි වැලනේනේ නටුවෙන් නැහැඹුල් මලක් වැටෙනවා මලේ කතා නැ නටුවයි වැලපෙන්නේ පෑ හීමක් නැ නොකෙරෙන දීගේ සෙවනැල්ලත් ඇදලූ දවල් වැටුන වල මෙදා වැටුනෙ නැ හිත හොද වැඩි කමලූ අහසින් තරුවක් මලෙන් උපන් මල් පත්තිනි දේවී කැන්දන් එන නැකතේ ඇස්කූඩෙන් මං වතුර අදින්නම් ඔබේ මඟුල් දවසේ අහසින් තරුවක්"},
{"title": "කඳුපාර ඈත අයිනේ", "artist": "මිල්ටන් මල්ලවාරච්චි", "author": "Unknown", "lyrics": "කඳුපාර ඈත අයිනේ සඳ රෑක ඈ සිනා සේ වේදනා සිතාරේ මේ ගිත රාවේ ඇසේවා ජීවිතේ පුරා යාළු වී දෙවැටේ එදා කී කතා අසා යාළු වී දෙවැටේ එදා කී කතා අසා පාළු වී හැඬුවා සදා මාරුතේ පවා ගං ඉමේ මා දං කැලේ පාසැලේ පුරා ගං ඉමේ මා දං කැලේ පාසැලේ පුරා මා සොයා ආවා වගේ වෙන්වෙලා ගියා කඳුපාර ඈත අයිනේ"},
{"title": "ගමනේ ගිම් නිවූ එදා", "artist": "මිල්ටන් මල්ලවාරච්චි", "author": "Unknown", "lyrics": "ගමනේ ගිම් නිවූ එදා සැනසුම් පවන් සලා ඔබ මා දවයි දිවා රෑ හද සෝ සුසුම් හෙළා මතකේ තිබේද ඒ යුගේ මාගෙ චේතනා වැටහෙන්නෙ නැද්ද ආදරේ සෝක වේදනා ගන අන්ධකාරේ පාළුවේ කිමිදුණා තනි වූයෙ ඔබ නොවේ මා පවා තනිවුණා ගමනේ ගිම් නිවූ එදා ඔබ මං මුළා වෙලා ගියා - පෙම් පහන් නිවා අහිතක් හිතන්නෙ නෑ පිරමිදයේ සිහිනෙකින් පවා අද ඔබගෙ ජීවිතේ කතරකී වාලුකා හිනැහෙන්න යළි දිලී දෛවයේ තාරකා ගමනේ ගිම් නිවූ එදා"},
{"title": "දෙයදර විලිකුන් සුරත්පලේ", "artist": "මිල්ටන් මල්ලවාරච්චි", "author": "Unknown", "lyrics": "දෙයදර විලිකුන් සුරත්පලේ පෙම් මදිරා අයදිමින් සැලේ සීත මීදුම් සිහින වැල් පැටලේ සීත මීදුම් සිහින වැල් පැටලේ මුවරද රොන් සුනු සුවඳ වෙතේ පෙම් මදිරා අයදිමින් යතේ නිලුපුල් නෙත් ගත් තඹුරු විතේ කැඳවයි ඔබ තව්තිසා වෙතේ සීත මීදුම් සිහිනයක් වාගේ දෙයදර විලිකුන් මධුවිත සැනෙකින් හිස් වෙනවා දිවි තවලම කතරක යනවා යෞව්වන බව හෙට නැති වෙනවා කල් බැලු අය හිඳ ලතවෙනවා ජීවිතේ පිණි බ්න්දුවක් වාගේ දෙයදර විලිකුන්"},
{"title": "දැස රිදෙනවා", "artist": "මිල්ටන් මල්ලවාරච්චි", "author": "Unknown", "lyrics": "දැස රිදෙනවා පාර බලා ඉදලා අප ආ පාරෙ ආගිය වාරේ මල් ලොව මල් සිදිලා සුරතෙ අත තියලා මට සහතික කරලා හෙට හවසට ආයේ අප හමුවෙමු කීවා නිදි නැති රෑ යහනෙ එකම රැයයි ගෙවුනේ අවුරුද්දක් වාගේ ඒ එක රැය දැනුනේ දැස රිදෙනවා පාර බලා ඉදලා"},
{"title": "එදා රෑ", "artist": "මිල්ටන් මල්ලවාරච්චි", "author": "Unknown", "lyrics": "එදා රෑ ගුවන් තොටුපලේදි මා වෙන්වී ගියේ සිතකින් නොවේ නෑසිය මිතුරන් පැමිණීලා ආසිරි සුභ පැතුම් පැතුවා ඔබ නාවෙ ඇයි මිහිරියේ එදා රෑ ගුවන් තොටුපලේදි මා වෙන්වී ගියේ සිතකින් නොවේ මේ වනතුරු රහසක් වීලා මා සිතේ යම් දෙයක් තිබුනා එය කීමටයි ලතැවුනේ එදා රෑ ගුවන් තොටුපලේදි මා වෙන්වී ගියේ සිතකින් නොවේ…"},
{"title": "දෙනෝදහක් ගැවසෙන සරසවියේ", "artist": "මිල්ටන් මල්ලවාරච්චි", "author": "Unknown", "lyrics": "දෙනෝදහක් ගැවසෙන සරසවියේ පාළුව තනිකම දැණෙනවනම් කුටියේ කවුළුව විවර කරනු මැන සුළඟක් වී ඔබ වෙත එන්නම් ඔබ සරසවියක මා පොඩි ගෙපැලක එක්වන්නට අද වරම් නැතේ එකම පන්තියේ එක ළඟ ඉඳගෙන පාසල් ගිය හැටි සිතට නැගේ දෙනෝදහක් ගැවසෙන ඔබ හා අත්වැල් බැඳ ඇවිදින්නට පෙරුම් පිරූ පාසැල් සමයේ සිල්ප සතර රැඳුණේ නැහැ මා සිත ඒ හින්දයි අපි දුරස් වුණේ දෙනෝදහක් ගැවසෙන"},
{"title": "අවසර නැත මට", "artist": "මිල්ටන් මල්ලවාරච්චි", "author": "Unknown", "lyrics": "අවසර නැත මට ඔබෙ අත ගන්නට බෑමි බෑද ඈත ලොව සතර දෙසේ එනමුදු උපදින හැම භවයකදිම මතු ඔබ හිමි කර ගනිමි ලදේ බඹරෙකු වන්නට නොහෑකිව ලතවෙන මා අභියස ඔබ නෙලුම නොවේ උල්පත වන්නට නොහැකිව ලතවෙන මා අභියස ඔබ සයුර නොවේ අවසර නැත මට ඔහු රිදවන්නට ඔහු හඩවන්නට බැරිකම් මිස ඔබේ සිහින ලොවේ ඔබ කැදවන්නට ඔබ සතපන්නට මා හද තුල ඉඩ නැතිව නොවේ අවසර නැත මට"},
{"title": "ආදරෙන් මෙසේ කතා වෙවී", "artist": "මිල්ටන් මල්ලවාරච්චි", "author": "Unknown", "lyrics": "ආදරෙන් මෙසේ කතා වෙවී ජීවිතේ පුරා සිනාසෙමු ජීවිතේ ගෙවා යන දවසේ සිනාසෙමු වාසනා වෙතේ සංසාරේ මාලිගා එපා වුණා නෑසියන් එපා වුණා ජීවිතේ මගේ ඔබේ වුණා කාටවත් කියා නැතී ආදරේ වදන් ඇසී ජීවිතේ ඔබේ මගේ වුණා බාල සන්දියේ එදා ආදරෙන් හිනා වෙලා කී කතා යලි අසා ඉමු ජීවිතෙන් අපි යලි වෙන් වෙනා වු යම් දිනේ ඒ මගේ ද එක්වෙලා යමු ආදරෙන් මෙසේ කතා වෙවී ජීවිතේ පුරා සිනාසෙමු ජීවිතේ ගෙවා යන දවසේ සිනාසෙමු වාසනා වෙතේ සංසාරේ"},
{"title": "සිතින් හිඳින්න මට ලංවෙලා", "artist": "මොහාන් දර්ශන", "author": "Unknown", "lyrics": "සිතින් හිඳින්න මට ලංවෙලා ගතින් ගියත් අද ඔබ වෙන්වෙලා මුළු ජීවිතේ පැතු ආදරේ රැගෙන යළි එනතුරා හිදිමි මා මගබලා ඔබ පෙරදා, සිත මාගේ, සිත්තම් කෙරුවා අද ඔබ නෑ, ඝණ අඳුරේ, මා තනිවෙලා ඔබ හා මා ගෙවුන අතීතේ, රැගෙන එන්න රත්තරනේ, යළිත් එන්න රත්තරනේ සිතින් හිඳින්න හද හඩනා, තුන්යාමේ, කඳුලැල් නැගුනා හද තැවුනා, උමතු සිනා, සිහිවී ලඳුනේ ඔබ හා මා ගෙවුනු අතීතේ, රැගෙන එන්න රත්තරනේ, යළිත් එන්න රත්තරනේ සිතින් හිඳින්න"},
{"title": "ආදරියේ රුචිරාණනියේ", "artist": "මොහිදින් බෙග්", "author": "Unknown", "lyrics": "ආදරියේ රුචිරාණනියේ ලියලනවා තව තව ශෝකේ වැලපෙනවා මා අද හිර ගේ ආදරියේ රුචිරාණනියේ ලියලනවා තව තව ශෝකේ වැලපෙනවා මා අද හිර ගේ ආදරියේ රුචිරාණනියේ මගෙ ආදරියේ සුව නින්දේ රස සිහින වැලේ එතිලා හමනා සුළඟද මේ එන්නේ කවදද ඇයගේ මුව කමලේ ඔද වැඩෙන සිනා රසයේ ගිලිලා යලි මා සැනසෙන්නේ ආදරියේ රුචිරාණනියේ ලියලනවා තව තව ශෝකේ වැලපෙනවා මා අද හිර ගේ ආදරියේ රුචිරාණනියේ මා හා ඇයි මේ සතුරු වැල මැද කඳුළු පෙරා සිහලුන් මේ ලොවේ නෑ නෑ ළත වෙන්නේ බල පා තෙද පා දැඩි එඩි පා මේ යදම් කඩා පුපුරා යන සේ කකියා යයි රුහිරේ"},
{"title": "තටු දෙනවාදෝ කිඳුරියේ", "artist": "ජයශ්‍රී", "author": "Jayasri", "lyrics": "තටු දෙනවාදෝ කිඳුරියේ ඔබ වටා ඉගිලෙන්නම් සිහිනයේ ඉම සොයා ඈතට පාවී ඈතට පාවී යන්න මගේ කල්පනා බොඳ වේවී ඔබෙ රුව බොඳ වේවී සිතුවම් ඔබේ සිනා දේදුනු පාට පාට ලෝකේ තනිවෙමුදෝ තනිවෙමුදෝ පාවෙන මන් මත් සිහිනේ හැරයමුදෝ හැරයමුදෝ පාලු විජිතයේ අපි අද තනිවෙලා ජීවිත කතරේ අතරමන් වෙලා ඔබේ දෙපා මුල ඒ දෙපා මුල නැවතුනු මගෙ ජීවේ මෙලොවත් නැති කර එලොවක් යා කල මගේ සොඳුරියේ හමුවූ මුල්ම දිනේ ලොවම නැවතුනා නැවතුනා රැඳුනා හද රැඳුනා සිත සැලුනා සැලුනා පාලු විජිතයේ අපි අද තනිවෙලා ජීවිත කතරේ අතරමන් වෙලා හැරදා යන්න මට තනිවන්න මගේ කිඳුරියේ අවසර දෙන්න මට අවදිවන්න නොනිමෙනා සිහිනයේ"},
{"title": "මගේ හිත වෙනතක යාවී ඇති බව", "artist": "ඉන්ද්‍රාණි පෙරේරා", "author": "Sunil Ariyarathna", "lyrics": "මගේ හිත වෙනතක යාවී ඇති බව විහිළුවටයි කීවේ එය ඇත්තට ගෙන ඉවත බලාගෙන ඇයි නොදොඩා ඉන්නේ දරුණුද ඔතරම් හදවත ඔබගේ හිනැහෙන්න දැන්වත් ඉතිං ඔබ විනා නෑ වෙනින් කෙනෙකු මා පතන්නේ එය ඔබ දැන දැන සෙනෙහස නැති සේ ඇයි නිහඬව ඉන්නේ මගේ හිත වෙනතක යාවී ඇති බව විහිළුවටයි කීවේ එය ඇත්තට ගෙන ඉවත බලාගෙන ඇයි නොදොඩා ඉන්නේ දරුණුද ඔතරම් හදවත ඔබගේ හිනැහෙන්න දැන්වත් ඉතිං මේ වගේ සුළු දෙයින් ඔය තරම් උරණ වී දුක සැප එක ලෙස විඳගනු කෙලෙසද දැන්වත් හිනැහෙන්නේ මගේ හිත වෙනතක යාවී ඇති බව විහිළුවටයි කීවේ එය ඇත්තට ගෙන ඉවත බලාගෙන ඇයි නොදොඩා ඉන්නේ දරුණුද ඔතරම් හදවත ඔබගේ හිනැහෙන්න දැන්වත් ඉතිං"},
{"title": "ඉර මුදුනේ ගිරවුන්ගේ කලබලේ", "artist": "ඉන්ද්‍රාණි පෙරේරා", "author": "Sunil Ariyarathna", "lyrics": "ඉර මුදුනේ ගිරවුන්ගේ කලබලේ කඳු මුදුනේ සාවුන්ගේ කලබලේ මනමාලයන් මනමාලීයන් සුභ මේ නැකතේ හරි කලබලේ… සුදු පාවඩ එලලා මාවත රඹ තොරන් බැදී සතර දිගන්තේ අඩ පිරුවට වගේ දිලේ මනමාලයන් මනමාලීයන් සුභ මේ නැකතේ හරි කලබලේ ඉර මුදුනේ රන් පොරු මස්තකේ දෑගිලී රන් හුයෙන් බැඳී කිඳුරු දිසා ඒ මඳු සඳේ ඔමරි කර ලෙසේ මනමාලයන් මනමාලීයන් සුභ මේ නැකතේ හරි කලබලේ ඉර මුදුනේ"},
{"title": "පෙනුණු සුව දසුන්", "artist": "හෙන්රි  කල්දේරා", "author": "Henry Kaldera", "lyrics": "පෙනුණු සුව දසුන් දස අත මිලින වී ගියා දකිනු රිසි නොවී හිතකට දෙවනවද ඔයා යහන මත වදී හිරු දෙවි දෙ ඇස පිය පියා ඔබ තාම නෑ දයාවියෙ මට ආදරෙයි කියා සෙල්ලම් ගෙවල් තනාගෙන වැලි බත් උයා කවා වල් කොළ කොටා දියේ මුසුකර තේ හදා පොවා සැලැකූ ළමා වියේ සැලැකිලි නොමැත මගහැරී මට ආදරෙයි කියන්නකො මුවගින් අමා පිරී ඇන්ද රතු වලා සිතුවම් හකුළුවා තියා සිතරු තෙම සැඳෑ අඳුරට ඉඩ තබා ගියා සීත සඳ නැඟෙයි පෙරඹර කවුළු දොර අයා ඔබ තාම නෑ දයාවියෙ මට ආදරෙයි කියා හමුවුණි අනන්ත මල් රුව මිස සුවඳ නොතැවරි ලියලයි හදේ පැතුම් වැල ඔබ වෙතම හැරි හැරී පාළුව ලැගුම් ගනී හද තුළ පතුල එරි එරී මට ආදරෙයි කියන්නකො මුවගින් අමාපිරි පෙනුණු සුව දසුන් දස අත මිලින වී ගියා දකිනු රිසි නොවී හිතකට දෙවනවද ඔයා යහන මත වදී හිරු දෙවි දෙ ඇස පිය පියා ඔබ තාම නෑ දයාවියෙ මට ආදරෙයි කියා යහන මත වදී හිරු දෙවි දෙ ඇස පිය පියා ඔබ තාම නෑ දයාවියෙ මට ආදරෙයි කියා ඔබ තාම නෑ දයාවියෙ මට ආදරෙයි කියා"},
{"title": "සප්ත ස්වරයයි", "artist": "ඉන්දික රුවන් (Roony)", "author": "Unknown", "lyrics": "නිසග පවග මත හිනැහි හිනැහි පිණි මල් මතින් වඩිනු දෙව්ලියේ රත තඹර මල් සුවඳ විහිදා බිගුන් බමනා ඈ වටා ඇගෙ නිකිණි සිනහ මල් කිණිති සැලෙන විට දැනෙන දැනෙන හැගුමන් රණ තිසර රුවැති ඇගෙ ලකල් ළමැදෙ මං සිහින සිහින වින්දෙම් සප්ත ස්වරයයි සුවද හමනා සප්ත ස්වරයයි ඈ සුවද හමනා හිත පුරා විසිරි මුතුලතා ඉහිරුනා රුවැති හද පතා හීන මුසු වුනු පාට තැවරුණු දෑස අබියස නැවතිලා ඇගෙ නිකිණි සිනහ මල් සප්ත ස්වරයයි සුවද හමනා සප්ත ස්වරයයි ඈ සුවද හමනා මෙපුර සුරඹ නද විදිමි විදිමි ඇගෙ මුව මතින් වයන රිද්මයේ නීල අඹරේ තුහින මල් වැහි තෙමෙනවා මා ආදරෙන් ඇගෙ නිතඹ සැලෙන පා සළඹ සැලෙන විට දැනෙන දැනෙන හැගුමන‍ෙ මුදු සුමුදු සුවැති ඇගෙ ළකල් ළමැදෙ මං සිහින සිහින වින්දෙම් සප්ත ස්වරයයි සුවද හමනා සප්ත ස්වරයයි ඈ සුවද හමනා"},
{"title": "උල්කාපාතයක්", "artist": "ඉන්ද්‍රචාපා ලියනගේ", "author": "Chinthana Dharmadasa", "lyrics": "අළු පාට වළාකුළු කථාවක් වත් නෑ තරු නිවී තරු නිවී රාත්‍රියේ සඳක් නැති අහසේ අරමුණක් නැතුව මං ගිනි අරන් ගිනි අරන් මොනවත් හොයන් උල්කාපාතයක්,අහසේ ගිනි අරන් අළු වෙලා පොළවට වැටෙනා,උල්කාපාතයක් අහස් කාන්තාරයේ නන්නාඳුනනා ජීවිතේ, ආලෝක වර්ෂ ගෙවා ආදරේ අරමුණක් සොයා පොළවට වැටෙනා දේවතා එළියක්, ගිනි ගත්ත තරු එළියක් උල්කාපාතයක්,අහසේ ගිනි අරන් අළු වෙලා පොළවට වැටෙනා,උල්කාපාතයක්"},
{"title": "කවුදෝ මට ආදරේ", "artist": "හෙලන් අත්තනායක", "author": "Unknown", "lyrics": "ආදරෙ යලි මම පතන්නෙ නෑ ආදරෙ යලි මම සොයන්නෙ නෑ සිත රිදීලා මා දැන් තනි වෙලා කවුදෝ මට ආදරේ කවුදෝ මට ආදරේ ගලන ගඟේ දිය බැස ගියාවේ අඳුරේ පහන් තව දැල් වුනාවේ මට හිමි සෙනෙහේ මට ලැබුනාවේ ඉන්නම් මා තව ඉවසිල්ලේ කවුදෝ මට ආදරේ කවුදෝ මට ආදරේ අවර ගිරින් හිරු බැස ගියාවේ මතක පොතේ පිටු පෙරලුනාවේ පුදනා සෙනෙහේ කවුරුන් වුනාවේ සැමදා ඈ මාගේ තුරුලේ කවුදෝ මට ආදරේ කවුදෝ මට ආදරේ කවුදෝ මට ආදරේ"},
{"title": "පියවුණා", "artist": "ඉන්ද්‍රචාපා ලියනගේ", "author": "Unknown", "lyrics": "පියවුණා දෙනෙත් නිදි මතින් ඇවිළුණා ගිණි පුපුරු සිතිවිලි පතුළේ ළං වුණා අඳුර සෙවණැලි මකා දමා පියවුණා සුසුම ආ බොහෝ කළකට කලින් නැවතුණු හදෙන් හදෙන් හදෙන් නැවතුණු හදෙන් හදෙන් හදෙන් කාළය ගෙවුණා අපි අපිට අහිමි කරමින් මතකය තිබුණා නොමැකී මනසේ හැංගී කළකට කලින් කලින් කලින් නැවතුණු හදෙන් හදෙන් හදෙන් යළිත් හමු වුණා නොගිය ගෙවුණු මොහොතක් රූරා ගලනා වියලී නොමැති රුහිරු කළකට කලින් කලින් කලින් නැවතුණු හදෙන් හදෙන් හදෙන්"},
{"title": "නතාෂා", "artist": "ඉන්ද්‍රචාපා ලියනගේ සමග කසුන් කල්හාර", "author": "Unknown", "lyrics": "නතාෂා ඇවිදින් ගියා පියාඹා වෙරලින් එහා නයිල් ගඟේ ඉවුරේ ආදම්ගේ උයනේ රොන් සලා ඈ ගියා නතාෂා කිරිල්ලී මල් මී තියා ඉගිල්ලී රෑනේ ගියා ආයෙත් ආයෙත් ආයෙත් එනවා අහසෙ පොළොවෙ සුළෙඟෙ වෙලෙනවා නිල් නිල් නිල් දැහැනේ එලෙනවා සිත්සේ දොතොලේ පහසේ ඔබ මා සිඹිනවා සිහිනෙන් තැවෙනවා පමා වී ඈතට ඇදී මීදුමේ රැහැනින් මිදී හදවතේ ගිණි අවුලා මා දෑසේ ගිණි අතුරා මා දවා ඈ ගියා නතාෂා ළංවි වෙන්වි දුක් වී දුර ගෙවා සයුරෙ රළසේ සිහිනේ මියැදුණා සඳුගෙ තුරුලෙ විනිසේ ලිහුණා උකුලේ ළමැදේ සයනේ ඔබ මා සැනසුනා සිහිනේ මැවෙනවා නතාෂා හුස්මක් තියා නිදැල්ලේ සක්මන් කලා නයිල් ගඟේ ඉවුරේ ආදම්ගේ උයනේ රොන් සලා ඈ ගියා නතාෂා කිරිල්ලී මල් මී තියා ඉගිල්ලී රෑනේ ගියා"},
{"title": "සිතක් තියෙනවා", "artist": "ඉන්ද්‍රජිත්  දොලමුල්ල", "author": "Unknown", "lyrics": "සිතක් තියෙනවා ආදර සිතක් තියෙනවා ළඳක් සොයනවා ඒ සිත ළඳක් සොයනවා නෙතින් බලනවා ලස්සන රටා මැවෙනවා නෙතඟ කතාවේ දෙවි දුවක් දකිනවා සිතින් සිනාසි සෙනෙහස පෑවා පැතුමන් බොඳ වී දෙනෙත් රතු වුණා සිහින විමානේ අද යාවී පා වෙලා සිතේ සුසුම් වැල් බොඳ වෙවී මැකීලා සිතක් තියෙනවා ආදර සිතක් තියෙනවා ළඳක් සොයනවා ඒ සිත ළඳක් සොයනවා ඇගේ ලෝකයේ රන් කිරුළද පතලා මැවූ සිහින වැල් සුන් කර දමලා ඈ හිනහෙනවා පෙර ලෙසින් බලනවා නෙතු හඬවනවා මා හද රිදවනවා සිතක් තියෙනවා ආදර සිතක් තියෙනවා ළඳක් සොයනවා ඒ සිත ළඳක් සොයනවා නෙතින් බලනවා ලස්සන රටා මැවෙනවා නෙතඟ කතාවේ මිරිඟුවක් දකිනවා ඒ සිත ළඳක් සොයනවා මිරිඟුවක් දකිනවා"},
{"title": "පාටින් පාට අවුලා", "artist": "හර්ෂ  ධනෝෂ්", "author": "Gihan Rodrigo", "lyrics": "පාටින් පාට අවුලා මොහොතින් මොහොත අඳිනා පින්තාරු පෙම්වතිය මාගේ දෑසින් දෑස පටලා හීනෙන් හීනෙ දකිනා පින්තාරු පෙම්වතිය මාගේ හිත් බිතුවේ හිස් අවකාශයේ තෙලිතුඩකින් සිතුවිලි රෝෂයේ කටු සටහන් කල රෑපාශයේ සිරවේ මා ආදර ක්ලේෂයේ පාටින් පාට අවුලා සඳ රවටා සුදු පැහැ ගමි සොරා තරු බිඳ දා නිල් දිය ගෙන පෙරා ඝණ රන් පෑ ගන්නෙමි හිරැ මරා ලෝහිත පෑ තවරමි හද ඉරා පාටින් පාට අවුලා මොහොතින් මොහොත අඳිනා පින්තාරු පෙම්වතිය මාගේ ලෝකයම ගෙන අඳිමි ඇය මනාවා ඒ නැමදුම් මගහැරැණි පෙම් හිනාවා පාටින් පාට අවුලා"},
{"title": "ඔබ දකින දකින", "artist": "ප්‍රනාන්දු M.S.", "author": "Unknown", "lyrics": "ඔබ දකින දකින දිනක මහද පොකුණු තලාවේ කිරි පැහැති සුසුදු සුමුදු සිනිදු කුමුදු හිනාවේ කුමුදු හිනාවේ මේ පොකුණු තලාවේ මේ කුමුදු හිනාවේ පොකුණු තලාවේ මල් දහසක සුවඳින් සුවඳ වෙලා කුංකුම පිණි දිය ගා නළලෙ උලා රන්වන් කැළුම් නංවලා මල් දහසක සුවඳින් සුවඳ වෙලා කුංකුම පිණි දිය ගා නළලෙ උලා බඳ වටලා සළු පටලා බඳ වටලා සළු පටලා ඔබ දකින දකින දිනක මහද පොකුණු තලාවේ කිරි පැහැති සුසුදු සුමුදු සිනිදු කුමුදු හිනාවේ කුමුදු හිනාවේ මේ පොකුණු තලාවේ මේ කුමුදු හිනාවේ පොකුණු තලාවේ පෙති ගෝමර ඉසිලා ළය තුරුලේ සඳ බැබලේ රැඳිලා වත මඩලේ නිල් තරු දෑසෙ හැංගිලා පෙති ගෝමර ඉසිලා ළය තුරුලේ සඳ බැබලේ රැඳිලා වත මඩලේ ඔබ නැති දා ලොව නැත මා ඔබ නැති දා ලොව නැත මා ඔබ දකින දකින දිනක මහද පොකුණු තලාවේ කිරි පැහැති සුසුදු සුමුදු සිනිදු කුමුදු හිනාවේ කුමුදු හිනාවේ මේ පොකුණු තලාවේ මේ කුමුදු හිනාවේ පොකුණු තලාවේ"},
{"title": "මුතු සෙව්වෙමි", "artist": "ප්‍රනාන්දු M.S.", "author": "Karunarathna Abeysekara", "lyrics": "මුතු සෙව්වෙමි මුතු ද හමු වුණා මිණි සෙව්වෙමි මිණි ද සතු වුණා රන් සෙව්වෙමි රන් ද හිමි වුණා නොලද එකම දෙය පමණකි ඔබගෙ ආදරේ මල් පැතුවෙමි මල් ද පිබිදුණා පැණි පැතුවෙමි පැණි ද ඉතිරුණා රස පැතුවෙමි රස ද වැටහුණා නොලද එකම දෙය පමණකි ඔබගෙ ආදරේ මුතු සෙව්වෙමි මුතු ද හමු වුණා නිල්බර සඳ පතා පල නැතේ බැබලෙන තරු පතා පල නැතේ කිඳුරු ලියන් පතා පල නැතේ පතන එකම එක වස්තුව ඔබය පිය කතේ මුතු සෙව්වෙමි මුතු ද හමු වුණා"},
{"title": "ලස්සන අඹ ගසක් සොයාලා", "artist": "ප්‍රනාන්දු M.S.", "author": "Unknown", "lyrics": "ලස්සන අඹ ගසක් සොයාලා ලස්සන කූඩුවක් සදාලා ලස්සන කිරිල්ලී මෙ මාගේ ආවේ එක්ක යන්න මං සදාපු කූඩුව මං මුලදි කැඩී බිඳී සිඳී ගියා ඒ හින්ද තව එකක් සදාලා ආවේ එක්ක යන්න මං ඒ වාගේ සැඩ සුළං ඇවිල්ලා යයිද මේ කූඩුවත් කැඩීලා ඔබ මාගේ ළඟ ඉන්නවානම් සෝකෙත් සැපක් සේ දැනෙයි ලස්සන අඹ ගසක් සොයාලා රසබර පල වැල නෙලාලා කූඩුව වෙතට ගෙන ඇවිල්ලා ඔයාගෙ ළඟ ඉඳන් කවන්නම් ලස්සන කිරිල්ලී මෙ මාගේ උදෑසනෙන් මම පිබිදීලා පෙම්බර ගීතයක් ගයාලා ඔයාගෙ සිත තුටින් තබන්නම් ලස්සන කිරිල්ලී මෙ මාගේ ලස්සන අඹ ගසක් සොයාලා"},
{"title": "රාජ මාළි‍ඟේ", "artist": "ප්‍රෙඩී  සිල්වා", "author": "Siril  Silawimala", "lyrics": "රාජ මාළිඟේ පරවියා වගේ ජීවිතේ මගේ මම ගෙවනවා ඔහේ ඉපදුනාට පස්සේ තාම මං හඬාලා නෑ ඇඬුවත් මට කිසිම දිනක කඳුළු එන්නෙ නෑ මම ආදරේට ඇති කරන්නේ ඉබ්බොයි ගෙම්බොයි උන් නොදැක නොබල එක මොහොතක් ඉන්න බෑ අපොයි මේ සුරතල් සත්තු මාගේ - මට රන්මුතු මැණික් වාගේ උන්ගෙ බරට රන් දුන්නත් - මම විකුණන් නෑ රාජ මාළිඟේ පරවියා වගේ මම යන්න තමයි හිතන් ඉන්නේ ලෝකයේ වටේ මම ගියොත් යන්නේ කවදා හරි බූරුවෙකු පිටේ ඉතිහාසෙට නම තියාල ලංකාවට කොඩි දමාලා එහෙම මිසක් කවදාවත් මම මැරෙන්නෙ නෑ රාජ මාළිඟේ පරවියා වගේ"},
{"title": "සුවඳ රෝස මල් නෙලා", "artist": "ප්‍රනාන්දු C.T.", "author": "Unknown", "lyrics": "සුවඳ රෝස මල් නෙලා මාල ගොතාලා ගෙලේ දමා ඉහේ ඔතා සිරස සදාලා ඈත සීනියා පිච්ච ඩේලියා බලා නෙළා ගනිමි මෙමා උයනෙ සරාලා මාල ගොතාලා ගීත ගයාලා තබා පතුල් රඟන රඟා බලමු සියල්ලා මිහිරි ගීත ගයා ගයා පේළි සැදීලා සිනා පපා වටේ යතා නටති සිනා ලා බාල වූ ළමා සදති මල් දමා දෙපා පදින් පදට තබා කිකිණි සලාලා දෑත නගාලා නේත්‍ර විදාලා නමා කමල් පැදෙති සුරල් රඟ පරදාලා සුවඳ රෝස මල් නෙලා මාල ගොතාලා ගෙලේ දමා ඉහේ ඔතා සිරස සදාලා"},
{"title": "මඟ බල බලා", "artist": "ධර්මදාස  වල්පොල", "author": "Benadikt Fernando", "lyrics": "මඟ බල බලා ඇතිය මගෙ සුදා සුකොමළ සිරියා ප්‍රේමෙන් සනසන්නටා අඳුරට පෙර යමි ලහි කරලා පිපි මල වගේ වුවන දිලිසෙනා ප්‍රේම සුගන්දේ දස අත විහිදා ඒ පෙම් කුසුමේ මධු රස උරනා බිඟු රජ ලෙස මම යමි පියඹා මඟ බල බලා ඇතිය මගෙ සුදා මා ප්‍රේම රැජිනී මා දුටු විගසිනී ලැජ්ජාවේ සැඟවී ඉඟි බිඟි පාවී නාඹර දෙතොලේ පෙම් පැණි ඉතිරේ රොන් ගන්නට බිඟු ලෙස යමි පියඹා මඟ බල බලා ඇතිය මගෙ සුදා බැඳි සෙනහසේ ළදරු වයසෙදී වැඩුණි හදේ දින දින මෝරා ඒ සිරියාවී මාගෙ මනාලී දකිනට බිඟු ලෙස යමි පියඹා මඟ බල බලා ඇතිය මගෙ සුදා"},
{"title": "පියුමෙහි පැණි බොති", "artist": "Unknown", "author": "Karunarathna Abeysekara", "lyrics": "පියුමෙහි පැණි බොති වන බඹරු මල මත නොරැඳෙති කළු දෙබරු දහවල් නොදිලෙයි අඹරෙ තරු අවරින් නොනැගෙයි නැගෙන හිරු කුසගිනි හැදුනට ඉඳල් නොකව් කණකොළ නොබුදිති සිංහ පැටව් හොඳ මල් නොපිපෙයි ගිරි මුදුනේ තල තෙල් නොදමයි රන් බඳුණේ පියුමෙහි පැණි බොති වන බඹරු මල මත නොරැඳෙති කළු දෙබරු දහවල් නොදිලෙයි අඹරෙ තරු අවරින් නොනැගෙයි නැගෙන හිරු ගැයුවට ඉමිහිරි පද උපුටා කොවුලෙකු වෙනවද කළු කපුටා සුදු පැහැ හැරියේ කවුද කිරේ මුතු නොබඳියි ගිරවියගෙ කරේ පියුමෙහි පැණි බොති වන බඹරු මල මත නොරැඳෙති කළු දෙබරු දහවල් නොදිලෙයි අඹරෙ තරු අවරින් නොනැගෙයි නැගෙන හිරු"},
{"title": "තරු පාට", "artist": "දුෂාන් ජයතිලක", "author": "Unknown", "lyrics": "තරු පාට නිලට දිලිසෙන ඇස් කතා කරන ලස්සන මම නොදන්නවා නොවෙයි දන්නවා මම නොදන්නවා වගේ ඉනන්වා මල් පාර දිගට ඉහිරුන රොන් සුවඳ හෙලා හිත මත මනමාල කතාවන් කියනවා හිත රිදුනත් නොරිදුනත් හැඬේනවා හිත නොහුලන හැම කඳුලම පිසලන ඔය රළු අත්වල දැවටි දැවටී ඉන්නද මං හීන කියනා පාරේ රත්තරෙන් ඇවිද යමූ දුරදිග සංසාරේ මට නොකියන හැම රහසම ලියවෙන ඔය තරු ඇස්වල පැටලි පැටලී ඉන්න තමයි හැමදාමත් ඕනේ නින්ද නොයනා රෑ තනියට රහසක් මං ගානේ තරු පාට නිලට දිලිසෙන"},
{"title": "අවසාන ප්‍රේමයයි මාගේ", "artist": "දිමංක වෙල්ලලගේ", "author": "Dilan Gamge", "lyrics": "අවසාන ප්‍රේමයයි මාගේ නෑ පතන්නේ කෙනෙක් ආයේ ඉවරයක් නෑ කඳුළු දෙනෙතේ මාව හැරදාලා ඔයත් යන්නට ගියා කවුරුත්ම එන්නෙපා රවටන්න ආයේ මේමා තනිකම හොදයි පාළුවේ මේ උනන කඳුලට වඩා හීන අතරේ සෙනෙහෙ සොයලා හිතට වෙහෙසයි දුකම විදලා කවුරුත්ම නෑ මට පෙම් කලේ මමම විතරයි ආදරේ කලේ ආයේ රැවටෙන්න බෑ කවුරුවත් ඕනෙ නෑ තනිවෙලා ඉන්න - හිතට පුළුවනි සඳා කවුරුත්ම එන්නෙපා රවටන්න ආයේ මේමා තනිකම හොදයි පාළුවේ මේ උනන කඳුලට වඩා ඔබේ මත්තේ නැහිලා නැහිලා මගේ හිත දැන් නොමැරි මැරිලා හදුනන්නෙ නෑ අයේ ඔබ මා මතක පොත දැන් හොදට පිරිලා ආයේ රැවටෙන්න බෑ කවුරුවත් ඕනෙ නෑ තනිවෙලා ඉන්න - හිතට පුළුවනි සඳා කවුරුත්ම එන්නෙපා රවටන්න ආයේ මේමා තනිකම හොදයි පාළුවේ මේ උනන කඳුලට වඩා අවසාන ප්‍රේමයයි"},
{"title": "මගෙ කදුලින් නිමා වු", "artist": "එඩ්වඩ් ජයකොඩි", "author": "Unknown", "lyrics": "මගෙ කදුලින් නිමා වු මාවතේ මාවතේ ඔහු සමගින් ඔබ මන්දහාසින් යන ගමනේ මගේ යුග නෙතු ඔබට හිරු සදු වේවා වාසනාවන් අහිමි පෙම්වතියේ නිමල පෙම් චේතනාවෙන් - නිහඩ වු වේදනාවෙන් අහින්සක මා හෙලන සුසුම් ඔබට පවනක් වේවා පාලු කුටියේ මා පරජිත වී නිදා නොනිදා ඉදින රෑ සිහිනයෙන් හෝ පෙනේවා ඔබේ සෙනෙහේ නිවුනු පහන් නොනිමි පහනක් වීලා"},
{"title": "කටු අකුලේ", "artist": "එඩ්වඩ් ජයකොඩි", "author": "Unknown", "lyrics": "කටු අකුලේ මල් ඇහැළේ රළු අහසේ තරු හිනැහේ කටු අකුලේ මල් ඇහැළේ තුඩින් තුඩේ රැවුනැගේ කුරුළු ගී ගායනා කුලින් කුලේ වැතිරේතේ සුදුවළා පාවෙනා ළමයින් සුවදයි කදුලක දිලිසෙයි අදුරු විමානේ රන් මිනි පහනයි තුඩින් තුඩේ"},
{"title": "කැරකෙන රෝදේ", "artist": "එඩ්වඩ් ජයකොඩි", "author": "Unknown", "lyrics": "කැරකෙන රෝදේ පුංචි කරත්තේ ඉඳගෙන මම ඉන්නේ පදික වේදිකා පසුකර යන්නට තල්ලු කරන් පුතුනේ කැඩුනු පාවහන් කුඩ නිමවාලා දවසේ වියදම සරි කරවාලා අඳුර වැටෙන්නට කලියෙන් ගෙදරට තල්ලු කරන් පුතුනේ කිරිකැටි දෙ‍අතේ සවිබල දියැවේ පමා වුනොත් අප මහමඟ තනිවේ අම්මා මඟ ඇති නෙත් හරවාගෙන තල්ලු කරන් පුතුනේ"},
{"title": "කරදිය ගැඹරේ", "artist": "එඩ්වඩ් ජයකොඩි", "author": "Unknown", "lyrics": "කරදිය ගැඹරේ තුන්යම ගෙවුනේ නුඹගේ දෑතට දිරිය වඩන්නයි සුහුඹුල් අත්පා යදළු කරන්නයි කිරිකැටි පුතුනේකිරිකැටි පුතුනේ අව්වට වැගිරෙන දාදිය වැස්සේ කළුගල් තලලා මහමං තැනුවේ නිවහල් ලොවකට නුඹට වඩින්යි කිරිකැටි පුතුනේකිරිකැටි පුතුනේ දුම් ගොටු අතරේ කම්මල් ඇතුලේ දැ‍තිරෝදෙට ගත ජීවය දුන්නේ නව මිනිසෙකු නව ලොවට පුදන්නයි කිරිකැටි පුතුනේකිරිකැටි පුතුනේ කරදිය ගැඹරේ"},
{"title": "ඉස්සර විදියට", "artist": "එඩ්වඩ් ජයකොඩි", "author": "Unknown", "lyrics": "ඉස්සර විදියට දුවපැන යන එක මතකද තහනම් කරපු දිනේ සෙල්ලම් වයසට ඉන්නේ කොහොමද කියන්න පොඩි හාමුදුරුවනේ කරඹ කැළෑවට වවුලෝ ඇවිදින් රෑ තුන්යම රජ මඟුල් කතී පාළුව දැනුනම මෙරු රැළ තරහින් වැලි මාලිග වට කුලල් කති ඉස්සර විදියට රෑ කල තනි යහනේ සැතපෙන විට දැනුනිද මවකගෙ සෙනෙහෙ ගුණේ බුදු බණ එතකොට සිහියට එනවද කියන්න පොඩි හාමුදුරුවනේ ඉස්සර විදියට"},
{"title": "එපා ස‍‍ඳේ ඔබේ සිනා", "artist": "එඩ්වඩ් ජයකොඩි", "author": "Unknown", "lyrics": "එපා ස‍‍ඳේ ඔබේ සිනා මේ රැයේ පිපී දිලේ හිතේ යොවුන් ආදරේ මල් මාවතේ තරු සාදයේ පාවේ කැළුම් ආදරේ අඹ මල් යායේ බිඟු දැල් හී ඒ මිහිලොල් සරා හැඟුම් පීදුනා ලැතැවුල් සේදී හසරැල් පාවී ඇගෙ වත පාවී සිනා එපා සදේ ඔබේ සිනා හිත බැඳි සීනේ නෙත රැඳි යාමේ මුවරොද සැලී ලවන් සේදුනා මධු සඳපානේ මල්සර යහනේ මල්වර වී ආදරේ එපා සදේ ඔබේ සිනා"},
{"title": "දොඹ මලින්", "artist": "එඩ්වඩ් ජයකොඩි", "author": "Unknown", "lyrics": "දොඹ මලින් මලෙක රේණු තලන තුරුණු බඹර රැහේ මද මතින් ඉපිල රඟනු බලා මල් මුවරද සැලේ හද සුවය මවෙත රඳන විහඟ ගීතයයි සුව සිහින වැලෙක මල් පීදෙන කාලයයි නව යෞව්වනේ පිපි මල් වනේ රණ තිසර ළමැද සෙවණේ මධු සාදයයි දොඹ මලින් මලෙක රේණු තලන වන වදුළු පුරා නිල්ල නිලන කාලයයි රණ මොණර කිකිණි හඬින් නැගෙන තාලයයි හසරැල් සලා කඳුලැල් නිවා සිත නිබඳ සොයන නිමල සොඳුරු ගීතයයි දොඹ මලින් මලෙක රේණු තලන"},
{"title": "අකුරු මැකී නෑ", "artist": "එඩ්වඩ් ජයකොඩි", "author": "Unknown", "lyrics": "අකුරු මැකී නෑ කොළ ගැලවී නෑ බොඳවී නෑ සිතුවම් ඉස්සර වාගේ තාමත් මතකයි හෝඩි පොතේ පාඩම් මේ ඊරී බිම සීරී කුණ්ඩුමනී හිස පීරී දීසිය පුරවා දෝසි දමා කුමුදුමතී හිනැහේවී අපි දුවමු අපි පනිමු ගී කියමු අපි නටමු ඇත් පොරයට අපි ඇහැ යවමු බාලවියට පා නඟමු"},
{"title": "බිංදු බිංදු මල් වැස්සේ", "artist": "එඩ්වඩ් ජයකොඩි", "author": "Unknown", "lyrics": "බිංදු බිංදු මල් වැස්සේ තෙමෙන්නට එපා ගලින් ගලට පා තබමින් දුවන්නට එපා ගල් මතුපිට ලිස්සනවා පය පැකිලේවී ආල හැඟුම් මං හින්දා හිතෙන්නට එපා දෑස තෙමා ලන දුක් ගිනි නැගෙන්නට එපා දෙමාපියන් පිට ගමකින් මට බහ දේවී නිල් ලන්දේ ගම් මැද්දේ ඉද්ද සමන් ඉපෙනවා වෙල් බැද්දේ වගුරු පුරා කෙකටිය දළු දිලෙනවා ගේ මැද්දේ බරණි පුරා වී අස්වනු පිරෙනවා හිත මැද්දේ ලොකු අඩුවක් මගේ සතුට මකනවා ආල හැඟුම් මං හින්දා ගමෙන් ඈත සිදාදියේ ලොකු නුවරක් තියෙනවා මාල වළලු අරුමෝසම් එහි ඇති බව කියනවා දෙමාපියන් ගමෙන් පිටට මා දෙන්නට හදනවා සිදාදියෙන් කුමාරයෙක් මා බලන්න වඩිනවා"},
{"title": "ඒක තමයි මේක", "artist": "Funky  Dirt", "author": "Murshad Huvais", "lyrics": "it's me   මැට්ට වගේ ආදරේ කලේ it's me   එල හරකා වාගේ සීරියස් වුණේ it's me   රෝමියෝ වෙන්න දැඟලුවේ it's me   අද මෝඩයා වෙලානේ නැවතුනේ it's me ඒක තමයි මේක - ප්‍රේමෙ තමයි මේක කියල හිතල සිරා වෙන්න ගිහිල්ලානේ වැරදුනේ ඒක තමයි මේක - මේක තමයි ඒක කියල හිතල සිරා වෙන්න ගිහිල්ලානේ වැරදුනේ ලයි ල ලයි මදැයි මා පෙම් කලා ලයි ල ලයි මදැයි මා love කලා ලයි ල ලයි ඇයි ගියේ වෙන් වෙලා ලයි ල ලයි මං මෙහේ තනිවෙලා it's me කරපිංචා වාගේ හොද්ද රස කළේ පස්සෙ රස බලද්දි මාව අහක් කරල විසි කළේ it's me  පෙමක් නිසා මදක් කිච වුනේ it's me  රෑ වැටුණු වලේ දවල් ද වැටුනේ it's me ඒක තමයි මේක මම බ්‍රේක් නැතිව කිලෝ ගණන් හීන මවද්දී එයා බ්‍රේකප් වෙන්න දාලා යන්න හේතු හොයද්දී ඊයේ ගැලපුණු හඳහන් අද අවුල් කියද්දී තේරුණේ මට පෙරලෙන බව ප්‍රේමේ බාල්දි Hurts me when i miss your lips are kissing mebaby මාසෙකින් ඒ ප්‍රේමේ කල් ඉකුත් වුණි it's me මඟුල් පෝරු බැන්දේ - දීගෙට නැකැත් බැලුවේ ඒවට බජට් දැම්මේ - බබාට නමුත් බැලුවේ ඒක තමයි මේක"},
{"title": "අද අපේ තාත්තා", "artist": "Funky  Dirt", "author": "Murshad Huvais", "lyrics": "අද අපේ තාත්තා ගෙදර ඇවිල්ලා අඩිය පොලොවෙ ගහලා මවෙත ඔරවලා අහපුදේට මට කට උත්තර නෑනේ කාතෙක්ක ද බොල තෝ බස් හෝලට් ගානේ අත් අල්ලන් ඉන්නේ බෝ ගහ හන්දියෙ හෝල්ට් එක ගාවයි මං තොගෙ වැඩ දැක්කේ ආ ඒකද තාත්තේ ඒ මගෙ කෙල්ලයි ඔබෙ ලේලිය වන්නේ ම්කියපු ගමන් කන හරහට පාරක් තාත්තා මට ගැහුවේ අයි අයි අයි උවයි අම්මියෝ මෙන්න තාත්තා ගහනෝ අයි අයි අයි උවයි අම්මියෝ එලව එලව ගහනෝ ගහනවෝ - බනිනවෝ එලව එලව තාත්තා ගහනෝ ලව් එක මගෙ නැගලම යනකොට දෛවයෙ සරදමදෝ පැණි හල හල හිටි මම අප්පොච්චට ඇයි අසුවුනිදෝ අපට මෙතරම් බාධාදෝ එහෙනම් ඉදගෙන හිටගෙන පෙරලි පෙරලි එලිවෙනකන් මල් කැඩුවා අද ෆොන් එකවත් නෑ අපෙ අප්පොච්චා පොලොවෙ ගහලා කැඩුවා රුම්බාරේ කාලේ උම්බලාවගේ නොවේ අපි කාලකණ්නි වැඩ කෙරුවේ නෑ කොහොමද ඒ කාලෙ තාත්තේ මේ වගෙ නෑනේ ඉන්ටර්නෙට් ෆේස් බුක් තිබ්බෙ නෑ (ඔහෙ හිටු) අයි අයි අයි උවයි අම්මියෝ මෙන්න තාත්තා ගහනෝ අයි අයි අයි උවයි අම්මියෝ එලව එලව ගහනෝ ගහනවෝ බනිනවෝ එලව එලව තාත්තා ගහනෝ"},
{"title": "මා හඬවලා", "artist": "ග්‍රේෂන් ජයමහ", "author": "Rookantha Gunathilaka", "lyrics": "මා හඬවලා හදවත සලා පෙර දාක මාගෙ දෙනුවන් රතු වෙලා දැන් කිසි දිනේ නැත ඒ වගේ හද ආදරේ පිරී ඉතිරෙනවා සිත පිබිදී නෙතු පැහැදී ඔබ හමු වී සුවඳ දිදී දිවිය පුරා මම එනවා මගෙ දෑතින් ඔබ අල්ලා මා හඬවලා හදවත සලා හද උදුරා ගන්නට බෑ සිත පාරා සනසනු බෑ අවරගිරෙන් හිරු පායනු බෑ ඇය හා මා එක් වෙනු බෑ මා හඬවලා හදවත සලා"},
{"title": "කල්ලඩි පාලම පාමුල", "artist": "ගුණදාස කපුගේ", "author": "Unknown", "lyrics": "කල්ලඩි පාලම පාමුල සින්දු කිව්ව මාළුවෝ ඇයි ගොළු ගැහුණේ සිතාරයට වෙඩි වැදුණද යාළුවෝ සිතාරයට වෙඩි වැදුණද යාළුවෝ මහ පොළොව ඉතිං දෙකට තුනට බෙදී යාවි යාළුවෝ ගංගා මහ මුහුදු කලපු නොබෙදේවිද යාළුවෝ උඹලා කොයි දෙස කොයි රටකට යනවද මාළුවෝ කල්ලඩි පාලම පාමුල සින්දු කිව්ව මාළුවෝ අපෙ උතුරු දකුණු සංගීතය දෙකට බෙදෙයි යාළුවෝ මෘදංග ගැට බෙර හදවත් පැලී යාවි යාළුවෝ උඹලාගේ සින්දු ඉතිං කොයි රටේද මාළුවෝ කල්ලඩි පාලම පාමුල සින්දු කිව්ව මාළුවෝ"},
{"title": "දවසක්‌ පැල නැති හේනේ", "artist": "ගුණදාස කපුගේ", "author": "Unknown", "lyrics": "දවසක්‌ පැල නැති හේනේ අකාල මහ වැහි වැස්‌සා තුරුලේ හංගාගෙන මා ඔබ තෙමුනා අම්මේ පායන තුරු හිටි පියවර හිටියා ඔබ අම්මේ නුවර වීදි යට කරගෙන නින්දා වැහි වැගිරුණදා බිරිඳකගේ සෙනෙහේ කියා යෝද ඇළේ බැම්මේ නුඹ සෙනෙහස සුවඳ දිදී දැනුනා මට අම්මේ කොළඹ අහස කලුකරගෙන මුහුදු හුළඟ අඩලනකොට ඔටුන්න බිමදා දිවගෙන එන්නද එක පිම්මේ මම එනතුරු ඉඳිකඩ ලඟ ඉන්නවාද අම්මේ"},
{"title": "දුක හාදු දෙන රැයේ", "artist": "ගුණදාස කපුගේ", "author": "Unknown", "lyrics": "දුක හාදු දෙන රැයේ සිත පතුලටම වෙලා යෞවනේ අපට විය විරහී හද ගිලන් වෙලා ගහකොළද මල් පිපේ ඇළ දොළ විල කඩා හැලේ පෙරදාක මිරිඟු සයුරේ ඒ රුවට රැවටුනේ නන්නාදුන ලෙසේ මගතොට යළිත් හමුවෙලා මහමෙර හිසින් දරාගෙන අපි යමු දුරස්‌ වෙලා"},
{"title": "දෑස නිලුපුල් තෙමා", "artist": "ගුණදාස කපුගේ", "author": "Unknown", "lyrics": "දෑස නිලුපුල් තෙමා කඳුලු මුතුවැල් සලා දෙතොල සුසුමින් පුරා ඉකිබිඳ හඬනු මනමාලියේ නිහඬ හදවත් පොතේ ලියැවුනු සොඳුරු ගී වැල් නැතේ මා තැනූ ඔබේ කඳුලැලි මා සිතේ නිබඳ පදවැල් ඇඳේ පබළු මිණිමුතු නැතේ මා සතු කඳුළු මුතු ඇට ඔබේ මා පැතූ තිසර පිණි ලෙස මල් මතේ කඳුළු කොපුලේ රැඳේ"},
{"title": "බිදුනු පෙම් හද", "artist": "ගුණදාස කපුගේ", "author": "Unknown", "lyrics": "බිදුනු පෙම් හද නිවාලන්නට කඳුල නුඹ ආදා අඳුර රජයන හුදකලා හිත නුඹට පෙම් බැන්දා සරාගික වු නෙතින් ගිලිහී ජීවිතෙන් පිදු ආද‍රේ නිමාවූ සිහි වටන පමණකි දෙනෙත් දෑ‍ලේ ඉදිවුනේ කඳුල නුඹ පිපුනා දැවී ගිණිගත් - පෙම් සුසානේ කඳුළු මල් පිපුනා බිදුනු පෙම් හද ප්‍රේම ආතුරයන් වෙලා ජීවිතේ මංසලේ දිනෙක ඇය මා අමුත්තන්‍ සේ යලිත් හමු වේවී කදුල නුඹ නාඩන් දුරස් වන්නේ නැතේ නුඹ මා කඳුල නුඹ නාඩන් බිදුනු පෙම් හද"},
{"title": "බිම්බරක් සෙනග", "artist": "ගුණදාස කපුගේ", "author": "Unknown", "lyrics": "බිම්බරක් සෙනග ගැවසුණු චන්ද්‍ර සූර්යයා ඉපදුණු ස්වර්ණ භූමියේ මනරම් මාළිගාව කෝ යුද්දෙකට ඇවිත් රුපුසෙන් සත් මුහුදු මතින් ගුවනින් කම්බි වට කළේ මනරම් මාළිගාව කෝ ට්‍රැක්ටරේ යකඩ ගජසෙන් කුංචනාදයෙන් ඇළලුණ වෘක්ෂ දේවතාවුන් බිම වැටී පණ ගසයි මිනී මල් පිපුණු සීතල නිම්න භූමියේ ඇටකටු සතර රියන් කඩ අහිමිව විලාපය නඟයිවිලාපය නඟයි! බිම්බරක් සෙනග කැලෑ මල් පිපී රතු තොල්වලින් කෑ ගසා ඉල්ලන ජාතියේ නිධානය රන් රුවන් කරඩු කොයි වෑකන්ද කඩා බිම් කටු කම්බියෙන් බෙදා මේ රණ බිමේ හිස ගසා දමනා කඩුව බිම දමවුකඩුව බිම දමවු! බිම්බරක් සෙනග"},
{"title": "අපි අසරණ වෙලා වගේ", "artist": "ගුණදාස කපුගේ", "author": "Unknown", "lyrics": "පිහිටක් නැති සරණක් නැති සතුටක් ඇති මුහුණක් නැති මේ සසර දනව්වේ අපි අසරණ වෙලා වගේ හිතට දැනෙනවාබුදු හාමුදුරුවනේ හබලක් නැති ඔරුවක් ඇති මිනිසුන් වෙති වෙරළක් නැති අපි අසරණ වෙලා වගේ හිතට දැනෙනවාබුදු හාමුදුරුවනේ නිවනක් ඇති ගෙදරක් නැති ගමනක් වෙති වෙහෙසක් ඇති අපි අසරණ වෙලා වගේ හිතට දැනෙනවාබුදු හාමුදුරුවනේ"},
{"title": "අහස උසට නැග ගියාට", "artist": "ගුණදාස කපුගේ", "author": "Unknown", "lyrics": "අහස උසට නැග ගියාට නැහැනේ අහසේ රැඳෙන්නේ අහසේ මාලිගා තැනුවට අපි පොළොවේ සිටින්නේ ලඹ කැටයේ අත්වාරුව බිත්ති දිගේ නගින්නේ බිත්තිය ඉහලට යනකොට අපි පොඩියට පෙනෙන්නේ සිමෙන්ති කඳුලින් දියකර සත් මහලයි තනන්නේ පලංචියේ කිරි කිරියයි අපේ දුකට හඩන්නේ"},
{"title": "අභිසාරිකාවන්ගේ", "artist": "ගුණදාස කපුගේ", "author": "Unknown", "lyrics": "අභිසාරිකාවන්ගේ උන්මාද නෙතු අතරේ අයාලේ ගිය ජීවිතේ ඔබෙනි ඵල ගැනුනේ රාග ගිනි ජාලාවේ ප්‍රේමයේ උණුසුම් සුසුමේ වෙනස ඔබෙනි දැනුනේ අයාලේ ගිය ජීවිතේ ඔබෙනි ඵල ගැනුනේ ආදරය යන වදනේ මනු‍ලොවේ මිනිසත් භවයේ මහිම ඔබෙනි හැඟුනේ අයාලේ ගිය ජීවිතේ ඔබෙනි ඵල ගැනුනේ"},
{"title": "දුරස් වන්නට", "artist": "ඉන්ද්‍රජිත්  දොලමුල්ල", "author": "Delthota Chandrapala", "lyrics": "දුරස් වන්නට සිතන සැමවිට තවත් ළං වෙනවා මතක නැතිකර ගන්න සිතු විට සිතේ රජ වෙනවා සතුට සපිරුණු නැවුම් ලොවකට සෙනෙහෙ දම් පිරුවා අපට අප නැති ලොවක් පිළිබඳ සිතන්නත් බැරුවා දුරස් වන්නට සිතන සැමවිට සිතට සුවයක් ගෙනෙන සැනසුම සදන දිව අඳුනක් නෙතට එළියක් ගෙනෙන නොනිමෙන දොළොස් මහ පහනක් දුරස් වන්නට සිතන සැමවිට"},
{"title": "ඔබේ සිනා ලඟ", "artist": "ජගත්  වික්‍රමසිංහ", "author": "Unknown", "lyrics": "ඔබේ සිනා ලඟ - නෙත නැවතුනු දා ඔබේ කථා ලඟ - සිත නැවතුනු දා ප්‍රේමය හැදින්නෙමි ප්‍රේමය හැදින්නෙමි - මේ ලෝ තලයේ කුමටද උපමා ඉතිහාසේ උන් ප්‍රේමවන්තයින්ගෙන් කුමටද ආදරයේ පෙම් සැමරුම් පෙම් පාරාදීසේ ඉමක් කොනක් නැති ආකාසේ තරු පායා එන සේමා ඉමක් නිමක් නැත පෙම් හදවත්තුල පෙම් සිතුවිලි බෝමා ඔබේ සිනා ළඟ - නෙත නැවතුනු දා ඔබේ කථා ළඟ - සිත නැවතුනු දා ප්‍රේමය හැදින්නෙමි ප්‍රේමය හැදින්නෙමි - මේ ලෝ තලයේ"},
{"title": "මුළු ලොවම නැති උනත්", "artist": "ජයරත්න T.M.", "author": "Unknown", "lyrics": "මුළු ලොවම නැති උනත් එකම හදවතක් ඇත ඔබේ නාමයෙන් ඇත ඔබේ නාමයෙන් ඔබේ සෙවණෙහි රැඳී ඉන්නට වරම් නැති වූ ලෝකයෙන් වෙන්ව සිටිනා හුදකලාවේ එකම එක හදවතක් ඇත ඔබේ නාමයෙන් මුළු ලොවම ලොවේ දිනයෙක තනි වුණෝතින් ඔබේ හද සෝ තාපයෙන් සොයා එන්නට සිටින කැපවී එකම එක හදවතක් ඇත ඔබේ නාමයෙන් මුළු ලොවම"},
{"title": "මං නුඹෙම ද අහන හිතින්", "artist": "ජගත්  වික්‍රමසිංහ", "author": "Rakitha Wakishta", "lyrics": "මං නුඹෙම ද අහන හිතින් නුඹ මගෙමද හිතනවානම් මං විතරද අහන මුවින් මගෙ විතරද කියනවා නම් සාගරේ හඬදිගේ මේ ගඟ ගලනවානම් මං නුඹ නුඹ මගේ අපි අපේ විතර නම් සද අහසට රළු පොළව දුරයි කියනවා හිත තිබුනේ දෙතැනක ඇයි අහනවා කිසිවක් නොඅසා ගං දිය පහර ගලා යනවානම් අපි ගැන දන්නා කවුරුත් තව නෑ අපි අපේ විතර නම් සාගරේ හඬදිගේ මේ ගඟ ගලනවානම් මං නුඹ නුඹ මගේ අපි අපේ විතර නම්"},
{"title": "මේ අයුරින් අපි", "artist": "ජයරත්න T.M.", "author": "Unknown", "lyrics": "මේ අයුරින් අපි සංසාරේ ආදරයෙන් හමුවෙන්න ඇති… මේ අයුරින් අපි දවසක් දා සසර මඟදි වෙන් වෙන්න ඇති සාලිය මාලා පෙම් බැදි දා මම සිටු කුමරෙක් වී ඉන්න ඇති ඒ සිටු කුලයේ කුමරිය වී ඔබ මේ ලෙස මට රිදවන්න ඇති ආත්ම ගනනක් ඔබ පය පාමුල මගෙ කඳුලෙන් සේදෙන්න ඇති එදත් මගේ පෙම් ආයචනයට අද මෙන් ඔබ හිනහෙන්න ඇති…"},
{"title": "කුරහන් යායේ", "artist": "ජයරත්න T.M.", "author": "Unknown", "lyrics": "කුරහන් යායේ සඳ උදුරාගෙන -  සිතට දුකක් දැනෙනා වේලේ රෑ තුන් යාමේ ගැයෙනා මේ ගී -  නුබට ඇසේවා සුදු නෑනේ එදා වගේ සැදෑ අදුර -  වැව් බැම්මෙන් ගලා ඇවිත් උණ පදුරේ සෙවන සදනවා - කීව කතා යලි සිතට නැගෙනවා කුරහන් යායේ සඳ උදුරාගෙන -  සිතට දුකක් දැනෙනා වේලේ රෑ තුන් යාමේ ගැයෙනා මේ ගී -  නුබට ඇසේවා සුදු නෑනේ මගේ පැලේ හිනැහීගෙන -  සිටිනා ලෙස නුබේ රුවින් නිදි පැදුරේ සිහින පෙනෙනවා - ඈත සිටින නුබේ නාමෙන් දෑස තෙමෙනවා කුරහන් යායේ සඳ උදුරාගෙන -  සිතට දුකක් දැනෙනා වේලේ රෑ තුන් යාමේ ගැයෙනා මේ ගී -  නුබට ඇසේවා සුදු නෑනේ"},
{"title": "හෙමින් සැරේ", "artist": "ජයරත්න T.M.", "author": "Unknown", "lyrics": "හෙමින් සැරේ පියා විදා සුමුදු සයනේ සිනිඳු ඇතිරිල්ලෙන් පලා ඇවිත් සිතුම් සියොතුන් සුමුදු සයනේ සිනිඳු ඇතිරිල්ලෙන් මලක් නම් එය මලක් වුව මැන සිනිඳු සුකොමල රුවෙන් සරසන විලක් නම් එය විලක් වුව මැන නීල ඉඳුවර දියෙන් උපදින නැවුම් වත්සුණු රොනින් මත් වී සිහින නිම්නය සුපුෂ්පිත වෙයි සිහින් හඬකින් ම හද අමතයි මුදා හැරදා පවුරු සිරි යහනේ"},
{"title": "හදිස්සියේ හනි හනිකට පය තබනා", "artist": "ජයරත්න T.M.", "author": "Unknown", "lyrics": "හදිස්සියේ හනි හනිකට පය තබනා - රුවැත්තියේ නුඹ සිටිනා ගම කොතනා දෑත සලා කිංකිණී නද දෙවන්නී - දෑස සලා මොන මොනවද කියන්නී යටින් හොරෙන් එබිකම් කර බලන්නී - ළඳේ ඔබයි මගේ දුක් ගිනි නිවන්නී රෑන කිතුල් මල පිටමැද හෙලන්නී - සිහින් පබළු වැල් ගෙල වට බදින්නී කොල නැවුම් සිනා දැලක් හෙලන්නී - ළඳේ ඔබයි මගේ දුක් ගිනි නිවන්නී"},
{"title": "අව්වට වැස්සට හුරු මිනිසුන්නේ", "artist": "ජයරත්න T.M.", "author": "Unknown", "lyrics": "අව්වට වැස්සට හුරු මිනිසුන්නේ දෑතේ විරියෙනි රටවල් නැගුනේ ඒ මිනිසුන්ගේ මළගම වෙනුවෙන් මොන රජ මැදුරෙද සුදු කොඩි නැගුනේ දා ගැබ් මහ වැව් කලා නිකේතන නුඹලා දෑතිනි මිහි මත මැවුනේ ඒ නුඹලාටයි දූ දරුවන්ටයි මොන රජ මැදුරෙද දොරටුව හැරුනේ රජ සැප විඳිනට රජ දරුවන් හට නුඹලා දෑතිනි මන්දිර මැවුනේ ඒ නුඹලාගේ දුක දැක ගන්නට මොන රජ දරුවද පැලකට වැඩියේ"},
{"title": "දෙගොඩ තලා ගඟ ගලා", "artist": "ජයරත්න T.M.", "author": "Unknown", "lyrics": "දෙගොඩ තලා ගඟ ගලා මෙගොඩ ගොඩේ ඈ හිඳී තොටුපලේ ගං ඉවුරේ මා තනිවම මද අඳුරේ මේ ගඟ ගලා ගියේ අපි පුංචි ළමුන් දවසේ ඇගෙ දෙපා පවා ආදරෙන් දොවා ආදර ඒ ගඟ නෑ අද නෑ දෙගොඩ තලා ගඟ ගලා මේ ඔරු කඳේ නැගී බොර පාට දියේ තනිවී මා මෙහා ඉමේ ඈ එහා ඉමේ බාධක මේ ගඟ තාම ගලයි දෙගොඩ තලා ගඟ ගලා මෙගොඩ ගොඩේ ඈ හිඳී තොටුපලේ ගං ඉවුරේ මා තනිවම මද අඳුරේ මා තනිවම මද අඳුරේ"},
{"title": "අප හමුවූවත්", "artist": "ජයරත්න T.M.", "author": "Unknown", "lyrics": "අප හමුවූවත් නොවුණත් කාලය ගතවී යනවා අප තනිවූවත් නොවුණත් ලොව එකසේ පවතිනවා ලොව මල් පිබිදෙන්නේ යළි පරවෙන්නට නම් අප හදවත් එක්වන්නෙත් වෙන්වන්නට නම් යළි වෙන්වන්නට නම් අප හමුවූවත් නොවුණත් කාලය ගතවී යනවා පෙරුම් පුරා හමුවන්නෙත් දිගු කලෙකින් නම් හමුවූවත් යළි සැණෙකින් වෙන්වී යයි නම් අප යළි තනිවේ නම් අප හමුවූවත් නොවුණත් කාලය ගතවී යනවා"},
{"title": "අම්මා සඳකි", "artist": "ජයරත්න T.M.", "author": "Unknown", "lyrics": "අම්මා සඳකි මම ඒ ලොව හිරුය රිදී ඒ ඉර හඳින් නුබේ ලෝකය එලිය වුනී රැකුමට පුතුන් දිවියේ දුක් ගැහැට විදී පිය සෙනෙහසට කව් ගී ලියැවුනා මදී සිරුරේ දුවන්නේ මගේ ලේ නොවැ පුතුනේ කුසයේ නොදැරුවත් දිවි බර මට දැනුනේ මහ මෙරකට උසයි දරුපෙම හද පතුලේ පුදුමයි පුතුනි කිම මගෙ ලේ කිරි නූනේ මවකට මුවා වී නුඹ වෙත දිරි දුන්නේ මම වෙමි පුතුනි එය මා පමණයි දන්නේ පිය සෙනෙහස නැතිද දරුවනි හඳුනන්නේ අම්මාවරුන් පමණද මතු බුදුවන්නේ"},
{"title": "සැන්දෑ අහසේ", "artist": "දයාරත්න  රණතුංග", "author": "Sunil Sarath Perera", "lyrics": "සැන්දෑ අහසේ ඉරට මුවාවෙන් කාලය කවුළු දොරින් මිය යනවා සැන්දෑ අහසේ ඈත අතීතෙන් පියවර නඟමින් කණවැල අල්ලන් කවුදෝ එනවා බලාපොරොත්තුව ලයට තුරුල් වී ඈ එන පෙර මඟ බලා සිටිනවා සැන්දෑ අහසේ දුකට මිහිර දෙන පාලුව තනිකම මා වට දැවටී කඳුළු සලනවා අදත් එදා මෙන් නුපුරුදු සුවඳක් ඒ අතරේ මා වෙතට ඇදෙනවා සැන්දෑ අහසේ"},
{"title": "ඔබ හීනයක් වගේ", "artist": "දීපිකා ප්‍රියදර්ශනී", "author": "Unknown", "lyrics": "ඔබ හීනයක් වගේ හාදු වැස්සක් අරන් සිරියහන අද්දරට වී වැතිරෙන්නෙපා සයනේ මම සස්වාමිකයි ස්වාමි මල් මකරන්ද දෝතට අරන් නෙතේ කදුලැලි දරන් මම මඟ බලා සිටියා නෙතු ඝණදුරට තරුවක් වෙලා ඔබ ‍එතැයි සිතා සිල් බිදලන්න නොහැකි නිසා මම මග බලා සිටියා ඔබ හීනයක් වගේ මේඝ දුක් හද රැදුනා සඳ එළිය නිවුනා අඳුර මැද තනිවී පහන් දොරකට සවන් දොර හැරුනා තරු ඇසත් පිපුණා සඳ ලබන්නී මා සරා සඳ ලඟ මා"},
{"title": "සිත ඔබ පාමුල", "artist": "දීපිකා ප්‍රියදර්ශනී", "author": "Kularathna Ariyawansha", "lyrics": "සිත ඔබ පාමුල සතපා බිඳි සෙනෙහස ගිනි උහුලා අහිමි විජිතයෙන් සමුගෙන යන්නම් ඔබට සෝතැවුල් නොම වේවා අසුරු සැනක් වූ රුසිරු අතීතය සිහිනෙන් ගෑ මුදු සුවඳක් සේ සඳා රැදේ‍වාඔබේ ලොවේ සිත ඔබ පාමුල ඔබට පිදුම් වූ සිතක විලාපය කැටපත් පවුරක ගීයක් සේ සදා රැදේවාඔබේ හදේ සිත ඔබ පාමුල"},
{"title": "රෑ පුරා", "artist": "ඩැඩී", "author": "Unknown", "lyrics": "මා දිහා බලනවා ඒ නිල් නුවන් දිලෙනවා නිල්වන් ගැබේ දිස් වෙනා තරු මල් වගේ පේනවා රෑ පුරා හීනෙනුත් පේනවා මා තනි යහනේ දුටු හීන නෑ තනි වූයේ ඔබ ගාව ළඟ ඉන්න ඕනමයි හැමදාම ඔබ යන්න නම් එපා හැර මාව රෑ පුරා හීනෙනුත් පේනවා රුව ඔබේ සිත පුරා දිවෙනවා සරා සඳ නැගුනාවේ මට නම් නෑ නින්දක් තනි යහනේ නිශා යාමේ කිඳුරන් රැඟුවා සේ ළං වි සිත් දැන් නම් බැඳුනාවේ ආදරේ දැනෙනවා හද පත්ලේ මෝරනා පැතු මේ ආදරේ කලලයක් වී මා සිතේ තැවෙනවා දැවෙනවා රිදෙනවා මා තනි යහනේ දුටු හීන නෑ තනි වූයේ ඔබ ගාව ළඟ ඉන්න ඕනමයි හැමදාම ඔබ යන්න නම් එපා හැර මාව රෑ පුරා හීනෙනුත් පේනවා රුව ඔබේ සිත පුරා දිවෙනවා රෑ පුරා හීනෙනුත් පේනවා රුව ඔබේ සිත පුරා දිවෙනවා රෑ පුරා හීනෙනුත් පේනවා රෑ පුරා හීනෙනුත් පේනවා රුව ඔබේ සිත පුරා දිවෙනවා රෑ පුරා රුව ඔබේ"},
{"title": "සිත මගෙ රිදුනා", "artist": "දමිත් අසංක", "author": "Unknown", "lyrics": "සිත මගෙ රිදුනා ඔබ හැර ගිය දා ඔබ මා හැර ගිය දා නෙතු මගෙ හැඬුවා මතකය ගෙන ආ ඔබෙ ආදරෙ සොයලා ඔබ මා නමින් - ගෙන ආ පැතුම් බොදවී ගිහින් - මේ සිත බිදී ඇයි හැරගියේ මගෙ ආදරේ ළඟ නැති ඔබෙ පෙම මතකෙට එනවා ඔබ යලි එයි සිතිලා සිත මගෙ රිදුනා ඔබ හැර ගිය දා මා තනිකර ගියදා නෙතු මගෙ හැඬුවා මතකය ගෙන ආ ඔබෙ ආදරෙ සොයලා ඔබේ සිතුම් ඔබේ හැඟුම් ලඟ මම හදේ මැවු ලොවේ තැනූ සිහිනය කොහේ ගියේ මෙසේ වෙන්වෙලා ආදරේ බිද දමා ඔබ මා නමින් - ගෙන ආ පැතුම් බොදවී ගිහින් - මේ සිත බිදී ඇයි හැරගියේ මගෙ ආදරේ සිත මගෙ රිදුනා මගේ වෙලා මගෙන් ඔයා ඉනුමැන ලඟින් මගේ සිතින් බැදී ඉනුමැන ඔබේ නමයි හදේ ගැහෙන්නේ ඔබට මා ආදරෙයි ඔබ මා නමින් - ගෙන ආ පැතුම් බොදවී ගිහින් - මේ සිත බිදී ඇයි හැරගියේ මගෙ ආදරේ සිත මගෙ රිදුනා"},
{"title": "ප්‍රාර්ථනා", "artist": "ඩැඩී", "author": "Unknown", "lyrics": "පියඹා ඒ ආකාසේ විහිදා දෑතේ දෙව් ලෝ තලේ වයනා ගීතේ සෙව්වා මේ ලෝකයේ ගීතයෙන් වෙලී වාවාන් නැතේ උණුසුමේ වෙලී මා ජීවිතේ පැතූ ආදරෙන් පිදූ රෑ තාරුකා මෙසේ පහන් වී ලෝකේ මගේ ගයනා සාගරේ මගේ දෙසවන් කිති තැවේ වාදනා දෑතින් ඉඟි කලේ වදවා කුලේ රැඳි ඒ ගීතේ පවසයි කතා ගීතේ දුන් රිද්මයයි හදපන ගැන්වූයේ සැනසුම් ලං වූයේ ගීතයෙන් වෙලී වාවාන් නැතේ උණුසුමේ වෙලී"},
{"title": "තරු කැකුළියේ", "artist": "චිලී තිලංක", "author": "Unknown", "lyrics": "තරු කැකුළියේ යලි මැවෙන්න හීනේ ගෑවී ලයේ මුව සිඹින්න ඕනේ ගිම්හානයේ කැන්දා සෙනේ දෙනවාද පෙම තෝරලා රෑ හීන ගානේ ඔබ ඉන්න ඕනේ මා ජිවිතේ සඳ වගේ නොකියූව කාරණේ මා ඉන්න තීරණේ මං ආදරෙන් මංමුලා වෙලා ඔබ ඉන්නේ මා සිතේ සසරේම යා කෙරේ මම ආදරෙන් මත් වෙලා සදා සඳවන්තියේ සිතගත්තියේ හමුවන්න නිල් නිම්නයේ රෑ හීන ගානේ ඔබ ඉන්න ඕනේ මා ජිවිතේ සඳ වගේ සැනසෙන්න ජීවිතේ මට දෙන්න ආදරේ සේයා වෙමින් වෙන් වෙලා නොයා මුමුණන්න මේ ලෙසේ මා ඉන්න මානයේ මාගේ වෙමින් ලං වෙලා සදා ගිම්හානයේ කැන්දා සෙනේ දෙනවාද පෙම තෝරලා රෑ හීන ගානේ ඔබ ඉන්න ඕනේ මා ජිවිතේ සඳ වගේ තරු කැකුළියේ යලි"},
{"title": "සිහින ගෙනෙන", "artist": "ක්ලැරන්ස් විජේවර්ධන", "author": "Unknown", "lyrics": "සිහින ගෙනෙන ඔබ කවුරුන්දෝ අලුත් සිහිනයක් මට නැතිදෝ සුපුරුදු එක සිහිනෙම දැකලා සිතේ සතුට මගෙ ඇත මැකිලා ගත වෙහෙසා මම යහනට ආ විට දෙනෙත් වැසී යයි නොදැනී මා හට සිසිලක් දැනෙයි මට ඒ මොහොතේ සුපුරුදු සිහිනය පෙනෙයි සිතේ පැහැදිලි නැති එක රුවක් ඇතේ සිහිනෙන් දැකුමට පැතුම් සිතේ සිහිනෙන් ඒ රුව දැකගන්න මටත් වරක් අවසර දෙන්න සිහින ගෙනෙන ඔබ කවුරුන්දෝ"},
{"title": "සෙවණැලි වාගේ", "artist": "ක්ලැරන්ස් විජේවර්ධන", "author": "Unknown", "lyrics": "සෙවණැලි වාගේ ඔබේ මගේ අපි දෙන්නා අපි දෙන්නා එක කාලෙක ළංවී උන්නා විකසිත වූ මා ඒ කාලේ සිතන්න ඔබ ගැන මොහොතක් මදි විය ඉවසන්නට මගෙ සිත ඉඩ නැති විය තනි වීලා ඔබ හා ඉඳගෙන කතා කරන්නට දවසක් නැති විය සෙවණැලි වාගේ අද සිතෙනා දේ නොබියව ලියවෙයි ගෙවුණු අතීතය මිහිරෙන් නැහැවෙයි තනි වීලා ඔබ හා ඉඳගෙන කතා කරන්නට දවසක් නැති විය සෙවණැලි වාගේ විකසිත වූ සිත ඒ කාලේ"},
{"title": "සුදු පිරුවටයයි", "artist": "චන්ද්‍රෙස්න හෙට්ටිආරච්චි", "author": "Unknown", "lyrics": "සුදු පිරුවටයයි මංගල යහනයි කදුළින් තෙමනු එපා ‍ඔබේ නිදොස් බව ලොවට කියන්නම් මට දොස් නගනු එපා සාගරයට වැඩි ආදර හිත් ළග අපි ළදරුවන් වගේ අපේම ලොව තුළ තනි වුණුදා අපි දුර නොබැලුවේ ඔබයි නෑසිය මිතුරන් මගෙ දෙගුරුන් හෙට වරද ඔබෙන් විමසයි විමසන වදනට දෙන්නට පිළිතුරු තවමත් සිත සසලයි"},
{"title": "සෙල්ලම්ගේ", "artist": "චන්ද්‍රෙස්න හෙට්ටිආරච්චි", "author": "Unknown", "lyrics": "සෙල්ලම්ගේ පාළුවෙලා බෝනික්කා තරහා වෙලා කෝම්පිට්ටු මාළිගාව කැඩිල ගිහිල්ලා ගේත් එක්ක පාළුවෙලා පුංචි පුතා නෑ චණ්ඩිකමට රණ්ඩු කරලා අම්ම එක්ක තරහාවෙලා තාත්තිගේ ඔඩොක්කුවේ හුරතලේට වාඩිවෙලා හබුං කටයි බත් දෙකටයි කිව්ව පුතා නෑ පුංචි පුතා සීයලාගෙ ගෙදර ගිහිල්ලා බිංකුන්ඩෝ බිම නටවලා වැලි සෙල්ලම් බතක් උයපු හඳ මාම රන් තැටියට කිරියි පැණියි ගෙනත් කවපු අතුරු මිතුරු දඹදිව තුරු කිව්ව පුතා මං පුංචි පුතා සීයලාගේ ගෙදර ගිහිල්ලා"},
{"title": "දුර ඈත දින සමනල් වීයේ", "artist": "අමිල පෙරේරා", "author": "Unknown", "lyrics": "දුර ඈත දින සමනල් වීයේ මා සසල කල යුවතී සිත් බැදි සෙනේ මා සිරකරන් මිතුදම අපේ පැවතී ඔබ තරම් මසිතට සුවගෙනා තව කෙනෙක් නම් නොමැතී අද ගිහින් ඈතට පියඹලා මා ජීවිතේ නැවතී අන්ධකාරේ මං මුලාවී පාවෙමින් ගෙවූ ජීවිතේ අරුත් පුරවා දෙනෙත් පාදා ‍ ඈ ලංවුනේ නොසිතූ ලෙසේ උමතු වූ ආදරෙන් බැඳී ගෙවුනු දින අද සිහිනෙකි පෙර වැරදි මා සතු වෙන්නැති දෙවියෙකු නොව මා මිනිසෙකි ‍ මිතුරු කැල හැම සතුරු වී ඈ මගෙන් උදුරාගත් හැ‍ටී මුළු දිවිය සැනකින් නතර වී අදහනු නොහැකි සේ ඇදවැ‍ටී ඉර හඳ තරුත් ගස්වැල් විලුත් කලඹන්න මට සිතුණි නිලබල ඇතත් රජකම ලදත් දැන් මට කුමට ළදුනී පරම පිවිතුරු ආදරේ සසර දින පැවතී බිඳක්වත් නෑ අඩුවුනේ වැඩිවුනා පමණී ඔබ දුන්නු සතුටට වැඩි දුකක් මා විඳින බැව් තනිවී ඔබ දන්නෙ නෑ එය දන්නවා නම් යන්නෙ නෑ වෙන්වී"},
{"title": "හිරු මැකී යයි", "artist": "අමිල පෙරේරා", "author": "Unknown", "lyrics": "හිරු මැකී යයි නීල අහසේ සේද මීදුම් මායිමේ නිමාවී යයි මේ වසන්තේ යලිත් නොම එයි කිසි දිනේ ගිණි කඳු පුපුරා ලෝදිය ගලනා තරම් රිදුම් දෙයි ආදරේ නෙතු සලා හමුවෙලා සුසුමකින් වෙන් වුනා තුෂර පින්නේ පැතුම් ඕවිල්ලේ ඔබේ සෙනෙහේ ඔහු හදේ රැදුනේ එදා මතකය සිතේ අහුරා කාටවත් නොපෙනී අඳුරේ ඉකිබිඳිමි රහසේ නෙතු සලා හමුවෙලා සුසුම කින් වෙන් වුනා සිනහ කඳුලේ දෙනෙත් දොවමින් දුටුව සිහිනේ නෙත් වැසුනු අඳුරේ ඈත මීදුම් අතර සඟවා යන්න ප්‍රිය ලඳුනේ හද සුසුම් පවනේ රැගෙන මා සුභ පැතුම් හද තුටින් යනු මැනේ හිරු මැකී යයි නීල අහසේ සේද මීදුම් මායිමේ නිමාවී යයි මේ වසන්තේ යලිත් නොම එයි කිසි දිනේ ගිණි කඳු පුපුරා ලෝදිය ගලනා තරම් රිදුම් දෙයි ආදරේ රැගෙන මා සුභ පැතුම් හද තුටින් යනු මැනේ"},
{"title": "සුපිපෙන මලකින්", "artist": "අමිතා වැදිසිංහ", "author": "Unknown", "lyrics": "සුපිපෙන මලකින් රොන් රස බී මත් වීලා ආදරයේ බිඟු යාද එ මල හැර දාලා ආදරයේ බිඟු යාද එ මල හැර දාලා වැල්ල සිපගෙන ආදරේ රැල්ල පෙරළේ සාගරේ නැද්ද බඹරෝ මා කෙරේ මුලදි පිදු ඒ ආදරේ සුපිපෙන මලකින් රොන් රස බී මත් වීලා ආදරයේ බිඟු යාද එ මල හැර දාලා ආදරයේ බිඟු යාද එ මල හැර දාලා වනේ මලකට ළංවෙලා රහස් හෙමිහිට කොඳුරලා සීත සුළඟේ සැරි සරා පාමි පෙම් රැඟුමක් නුරා සුපිපෙන මලකින් රොන් රස බී මත් වීලා ආදරයේ බිඟු යාද එ මල හැර දාලා ආදරයේ බිඟු යාද එ මල හැර දාලා"},
{"title": "කැළේ පිපුණු මලක් විලස", "artist": "අමරදේව W.D.", "author": "Unknown", "lyrics": "කැළේ පිපුණු මලක් විලස ඇගෙ රූ සිරි දිලෙනා ඇලේ දොලේ පෙන පිඬු ඇගෙ සිනා වතින් සැලෙනා කැලේ එපිට ඈත රටක ගව් සිය ගව් දුරිනා සිදාදියෙන් එ මල සොයා කවුදෝ එනු ඇසෙනා සිදාදියේ මන්දිරයක සඟවාලන ලෙසිනා දෑස වසා ඇය ගෙන යන රහස් කතා ඇසෙනා කැළේ පිපුණු මලක් විලස සිදාදියේ මන්දිරයක බැල මෙහෙවර කරනා අනාගතය සිහිවී ඇගෙ නෙත කඳුලැලි සැලෙනා හදේ නැගෙන ගිණි දැල්ලක් ඇගෙ රන් බඳ වෙලෙනා කැළේ පිපුණු සොඳුරු මලට නැතිදෝ රැකවරණා"},
{"title": "ජීවිතයේ තනි මංසල", "artist": "අමරදේව W.D.", "author": "Unknown", "lyrics": "ජීවිතයේ තනි මංසල අතරමං වෙලා හුදෙකලාව සුසුම් හෙලන හදවත සනසා අතීතයේ ගිලිහී ගිය සතුට රැගෙඅන් යළි වඩින්න ආරාධනා නෙලූ සුපෙම් කැටයම් හද පවුරු තලාවේ මැකී ගියාදෝ කාලයේ වෙරළේ ජීවිතයේ දිගු ගමනින් අනාථ වූදා ස්‌නේහයේ සත් පියුමෙන් යළිදු පිපේවා ආරාධනා එදා සිඟිති ගී සුවඳින් යුගදිවි අරණේ ඔබේ උණුහුමේ යළිඳු උපන්නෙමි බිඳුනු එවන් රජ දහනින් සමුගෙන යනදා ඔබේ නුවන් පහනින් යළි එළිය ලැබේවා ආරාධනා"},
{"title": "තාරුකා නිවා දුර", "artist": "අජිත්  බණ්ඩාර", "author": "Unknown", "lyrics": "තාරුකා නිවා දුර ඈත තනි වෙලා කොහේ ගියාද දිව්‍යාංගනා ජීවිතේ කියා පෙරදාක රැවටිලා මගේ නොවේද දිව්‍යාංගනා නික්මී නොයා මහදේ දොර වසා හදේ රැඳෙන්න දිව්‍යාංගනා ළං වී ඉඳින්න දිව්‍යාංගනා සෝක කල්පනා හිතේ තියා ඉගිලී නොයා සැඟවිලා නේක වේදනා සුළගේ විසිරිලා වෙන්වී නොයන්න දිව්‍යාංගනා වෙන්වී නොයන්න දිව්‍යාංගනා තාරුකා නිවා දුර දෑස රිදවනා කඳුලැල් මකා හසරැල්ල රන් තනිවෙලා ප්‍රේම ගීතිකා කොඳුරා කියා තුරුලේ නිදන්න දිව්‍යාංගනා තුරුලේ නිදන්න දිව්‍යාංගනා තාරුකා නිවා දුර නික්මී නොයා මහදේ දොර වසා හදේ රැඳෙන්න දිව්‍යාංගනා ළං වී ඉඳින්න දිව්‍යාංගනා තාරුකා නිවා දුර ඈත තනි වෙලා කොහේ ගියාද දිව්‍යාංගනා නික්මී නොයා මහදේ දොර වසා හදේ රැඳෙන්න දිව්‍යාංගනා ළං වී ඉඳින්න දිව්‍යාංගනා හදේ රැඳෙන්න දිව්‍යාංගනා"},
{"title": "ඔබ නිදනා සීතල පොළවේ", "artist": "අජිත්  බණ්ඩාර", "author": "Unknown", "lyrics": "ඔබ නිදනා සීතල පොළවේ මලක් පිපීලා නමක් නැති ඔපාදම බිම නැමී සිපගමි ඔබේ කිරි සුවඳයි අම්මේ අම්මාඅම්මා වැවේ පතුලෙන් දොවාගත් පැන් පිරිත් පැන් සේ පොවාලා හොවා උකුලේ පුරා මා වෙඩි කුලී මාලිඟ තනාලා කුලී මාලිඟ තනාලා අම්මාඅම්මා ඇසේ ඇසිපිය වසා කඳුලට හිතේ දුක්ගිනි දරාලා මහා බොසත් පෙරුම් පිරුවේ අපේ බුදුබව පතාලා අපේ බුදුබව පතාලා අම්මාඅම්මා ඔබ නිදනා සීතල පොළවේ"},
{"title": "ඇසිපිය සලන නිසා", "artist": "අජිත්  බණ්ඩාර", "author": "Unknown", "lyrics": "ඇසිපිය සලන නිසා දැනගත්තා ඔබ දිව්‍යාංගනාවක් නොවේ කියා කඳුළැලි වැටෙන නිසා දැනගත්තා ඔබ හිත් ආකාසය වගෙයි කියා මගෙ ලොව දිළිඳු නිසා විඳගත්තා හැම රන් යහනා සිහිනයක් කියා ඒ වුණාට ඔබ ඇසිපිය සලමින් සැඟවුණ මගේ ආදරයෙන් ඇසිපිය සැලුවා ඒ වගේම ඔබ කඳුළැලි සලමින් නොහැඬූ මගේ යුග දෑසත් බොඳ කර දැමුවා දැනගත්තා ඔබ දිව්‍යාංගනාවක් නොවේ කියා විඳගත්තා හැම රන් යහනා සිහිනයක් කියා ආදරේට ලොව සීමා නොහැ‍‍ඟෙයි පොළොවේ සිටි මා ඔබ අහසේ රැගෙන ගියා ඒ වගේම ඔබ අහසත් ‍පොළොවත් මේ හැටි දුර බව මා හට හඳුණා දුන්නා දැනගත්තා ඔබ දිව්‍යාංගනාවක් නොවේ කියා විඳගත්තා හැම රන් යහනා සිහිනයක් කියා ඇසිපිය සලන නිසා"},
{"title": "රැලකින් තනි වී", "artist": "අබේවර්ධන බාලසූරිය", "author": "Premakeerthi De Alwis", "lyrics": "රැලකින් තනි වී වනමැද සරනා කැකුලු තුරුණු යාමේ ඇතෙකුට ඇත් දළ යුවලක් වාගේයි මට ඔබගේ ප්රේළමේ හබල බිඳී ගොස් පෙරළුණු ඔරුවක් ලෙස පාවෙන දිවියේ රුවල් මසා දී ගොඩ ගනු රිසියෙන් වෙහෙසෙන මියුලැසියේ රැලකින් තනි වී තුඩ තුඩ තබමින් නෙක නෙක පලවැල කවා පොවා සනහා පෙරුම් පුරනවද මතු බුදු වන්නට මට දී රැකවරණා රැලකින් තනි වී"},
{"title": "රෑ පැල් රකින", "artist": "අබේවර්ධන බාලසූරිය", "author": "Ajantha Ranasinghe", "lyrics": "රෑ පැල් රකින කුරහන් පැහෙනා හේනේ මගෙ තනි නොතනියට නුඹවත් නැතුවානේ හෙට දින නුඹත් දීගෙක ගිය පසු නෑනේ මාසේ පෝය දා ‍වාගෙයි ගම්මානේ එගොඩහ ගොඩේ ඉස්මත්තෙදි දුටුවාට ඇළ කණ්ඩියේ ඉදගෙන අත වැනුවාට මගෙ හිතු මනාපෙට මං බහ දුන්නාට නාඩන් මස්සිනේ පෙර පින් නැතුවාට හැදුවේ ගෙපැල මට තනියෙන් හිදින්නද බාලේ ඉදන් බැදි ආලේ බිදින්නද රෑ තුන්යමේ මේ හැටි දුක් ගෙවන්නද සිහිනෙන් මිසක හැබැහින් එක් නොවන්නද නෑනා නැතත් කල දවසක් ගෙවෙන්නයි සිටු කුමරියක් කරකාරෙට ලැබෙන්නයි පත්තිනි ගම්බාර දෙවියන් රකින්නයි කුරහන් කපන දා මා සිහිකරයි"},
{"title": "පියාණනී මා", "artist": "අබේවර්ධන බාලසූරිය", "author": "Sunil Ariyarathna", "lyrics": "පියාණනී මා නැවත උපන්නොත් අපාර වූ මේ සංසාරේ ඔබේම පුතු වේවා ශිල්ප සතර දී සිහසුන හිඳුවා ඔබට අහිමි ලොව මා රජ කරවා ඈත ඉඳන් ඔබ බලා සිටින්නේ නෑ ඔබ වන් පියවරු හමුවන්නේ පියාණනී මා නැවත උපන්නොත් හිත මිතුරන් මා හැර ගිය දවසේ ලොව ම එරෙහි වී තනිවුණු මොහොතේ ඔබේ පැලේ නැත දොරගුළුලන්නේ ඔබේ සෙනේ ගඟ නැත වියැලෙන්නේ පියාණනී මා නැවත උපන්නොත්"},
{"title": "කල්පනා ලොව මල් වනේ", "artist": "අබේවර්ධන බාලසූරිය", "author": "Ajantha Ranasinghe", "lyrics": "කල්පනා ලොව මල් වනේ සිහින රජ දහනේ ආදරේ ආදරේ නීල අහසේ තාරකා සේ ඈ නුවන් දල්වා බලන්නී ප්රේවමයේ මායා දැලින් මා සිත් නුවන් බඳවා තබන්නී කල්පනා ලොව මල් වනේ මා වටා සහසක් යුගත් පා‍ ඈ රුවින් පිළිරූ මැවීලා පාව යයි මුළු ජීවිතේ සුදු මීදුමෙන් දැවටී එතීලා කල්පනා ලොව මල් වනේ"},
{"title": "බඹරෙකු ඇඬුවා", "artist": "අබේවර්ධන බාලසූරිය", "author": "Unknown", "lyrics": "බඹරෙකු ඇඬුවා මලක් ළඟදි බඹරෙකු ඇඬුවා ඇඬුවා මලක් ළඟදි බඹරෙකු ඇඬුවා ඇහේ කඳුලු ඇති ඒ බඹරිඳු දැක අඬන්නෙ ඇයිදෝ මල ඇසුවා මල ඇසුවා ලන්ද එහා ඇති ඕවිට පාමුල කේතකි මල මට බහ දුන්නා කවුදෝ ඇවිදින් එ මල නෙලූ බව ඉකිබිඳිමින් බඹරිඳු කීවා බඹරෙකු ඇඬුවා මලක් ළඟදි බඹරෙකු ඇඬුවා ඇඬුවා මලක් ළඟදි බඹරෙකු ඇඬුවා ඇහේ කඳුලු නොව හිතේ කඳුලු දැක ඇයටත් හරියට දුක හිතුණා එහෙනම් මා වෙත පියඹා එන්නයි සෙනෙහෙ සිතින් ඒ මල කීවා බඹරෙකු ඇඬුවා"},
{"title": "සුසුදු සුදු හංස විලේ", "artist": "අමල් පෙරේරා", "author": "Unknown", "lyrics": "සුසුදු සුදු හංස විලේ කොකුම් සුවඳ දියේ පිහින පිහිනා සුව විඳිමී මා මන්දෝදරියේ කොපුල් තල යහනතේ සුසුම් සඳ ඉවුරේ කොඳුර කොඳුරා තනි රකිමී මා මන්දෝදරියේ උකුල් තල මිටියාවතේ පිපෙන පියුම් මඬලේ සිතුසේ සැනහී වැතිරගමී මා මන්දෝදරියේ සුසුදු සුදු හංස විලේ කොකුම් සුවඳ දියේ පිහින පිහිනා සුව විඳිමී මා මන්දෝදරියේ"},
{"title": "ප්‍රංශ යුවතියන්", "artist": "අමල් පෙරේරා", "author": "Unknown", "lyrics": "ඉඩෝරයේ නගර කොනේ අයිෆල් සීමාවේ ඔබව පෙනේ ප්‍රංශ යුවතියන් හදේ කොන අරන් ලිලී මල් සුළන් මීදුමෙන් වහන් මායාවී පායාවී පමාවී ෆ්රෑන්ක් මිටි ගණන්, යුරෝපේ ඉදන්, හම්බ කරන මගේ කර පිටින් යන්න එනවනම් ඇයිද නෙතු පියන් යන්න එනවනම් ඇයිද නෙතු පියන් බලා නොඉඳ තවත් කල් අරන් ඉඩෝරයේ නගර කොනේ රයින් ගඟ කොනෙන් පෙම් හසුන් අරන් යන්න එන්න මොකක්දෝ හැඟෙන් කියන නෙතු පියන් අහනවද ඉතින් කියන නෙතු පියන් අහනවද ඉතින් ස්වේත වර්ණ කරලියේ ඉදන් ඉඩෝරයේ නගර කොනේ"},
{"title": "නෙත නෙතට හොරා", "artist": "අමල් පෙරේරා", "author": "Unknown", "lyrics": "නෙත නෙතට හොරා හද පතුල බලා පද බැන්ද සුපෙම් කවියේ නද තාල සිඳී පද පේලි බිඳී සිත කෑලි කැඩී විසිරේ සඳ පෙනෙන රැයේ ඔබ ළඟට වෙලා මුදු හාදු ගෙලේ තවරයි ඔබ කොහෙද කියා මේ තරු ඇසුවා නිදි නැද්ද මගේ හදෙහී නිදියන්න මගේ හදෙහී ඔඛෙ සුවඳ රැයේ මල් බිමට නැවේ පිණි කැකුළු පවා හැකිලේ මේ මතක විලේ තව එකම වරක් හිනැහෙන්න මගේ පියුමී හිනැහෙන්න මගේ පියුමී"},
{"title": "මායම් තරු රෑනේ", "artist": "අමල් පෙරේරා", "author": "Unknown", "lyrics": "මායම් තරු රෑනේ බැල්මෙන් මිදී පායන් ආ සඳටයි බැදුනේ වෙලී රෑනෙන් මිදුනාම නැ අත් බැදී මා නම් අද ඉන්නේ ප්‍රේමේ ගිලී සීතාවියක් හින්දා රෑ නෑ නිදී ඔබ හින්දයි තවමත් මා මග බලමින් ඉන්නේ රැදී කවදාවත් රිදවන්නෑ හිමිවේනම් උන්මාදිනී පාඩම් පොතේ සුවඳ අකුරින් ලියා දුන් උන්මාද ගීතේද ගැයුවේ ඔයා ඒ පොත් කොනේ ලියුව හසුනත් ඔයාටයි මේ පෙම් හැගුම් නැද්ද දැක්කේ ඔයා හැමදාම නෙතු කීව ඒ පෙම් කතාවේ හිතවත් කමක් නේද දැනුනේ කියා කවදා ද ඉටුවන්නෙ මේ ප්‍රාර්ථනාවන් දුක් ගින්දරේ හීන ඇවිලී ගියා මායම් තරු රෑනේ මල්හීන හිත බැන්ද කිරිකෝඩු කාලේ එක හිනයක් ගාව මම නැවතිලා තරු වාගෙ දිලිහෙද්දි පොඩි ඇස් ඔයාගෙ බෑ දැක් කියාගන්න හිත ගොළුවෙලා දැනගත්ත‍දා ඈත වෙන්වී ගියාදෙන් හැමදාම විදවන්න මා මෙහි තියා නොකියාම ඉන්නම් මගේ ප්‍රාර්ථනාවන් මිතුදම් හොදයි අහිමි වෙනවාට වඩා මායම් තරු රෑනේ"},
{"title": "මල් පිට මල්", "artist": "අමල් පෙරේරා", "author": "Unknown", "lyrics": "මල් පිට මල් හැලෙන දිගු මාවතේ පිය මත පිය තබමින් හිනැහෙන නුබේ ඉගි නළුවට වශි වී අත්තල නගයි තුරුපත් පවා දිය පිට දියරැලි නගන ගං දියේ සැඩ රළ මතින් ඔරුවක නැගි එතෙරට යනු දැක ඔබයි මමයි සැඩ නල පවා හමන හැටි පුදුමයි මල් පිට මල්… වැහි පිට වැහි හැලෙන රාත්‍රියේ උණුහුම් වෙමින් තුරුලත වෙලී මුදු රස විදින සඳ ඔබයි මමයි හිරිකඩ පවා දැනෙන හැටි පුදුමයි මල් පිට මල්…"},
{"title": "ඉතින් නම්", "artist": "අමල් පෙරේරා", "author": "Unknown", "lyrics": "ඉතින් නම් තවත් බැහැ මට සිහින මල් කම් නෙලන්නට ඔබ ගැන හද කැටබිතේ ළබැඳිය නුඹෙන් ලද සැනසුමන් අද මට කටුක කඩු තුඩු සේ දැනේ අද මට කටුක කඩු තුඩු සේ දැනේ හැඟුම් බර දෑස්‌ නිල් විල මුසුව ඉන්නට පෙරුම් පිරූ කාලයත් ඉක්‌ම ගිය හැටී ඉතින් නම් තවත් බැහැ මට කියන්නට කවුරුවත් අද මා අසල නැත සවස්‌ යාමයට පෙරම ඉරත් අවර ගිර සැඟව ගියේ ඉතින් නම් තවත් බැහැ මට"},
{"title": "ජගදානන්දන මහා කාරුණික", "artist": "අමරදේව W.D.", "author": "Unknown", "lyrics": "ජගදානන්දන මහා කාරුණික සිරසවන්දන ශීල ගුණෝපිත අනූපමේය වූ එවන් නාමයට නමස්‌කාර වේවා අහස උසට නැගි සවනක්‌ ඝණරැස්‌ කේතු මාලාවෝ මොහඳුර විනිවිද තිමිර පටල බිඳ භවාග්‍රයේ විහිදෙන යාමේ සවනේ ගෙවා දත් මහා ඥාණයට නමස්‌කාර වේවා මහී තලය මත සදා සරණ බඳු දයා සමුදාවෝ ගලා බසින සඳ නිවා අග්නි කඳ පුදා ප්‍රණාමය පා මඬලේ පාරමී පූරිත විපුල වීර්යට නමස්‌කාර වේවා"},
{"title": "ඉරට මුවාවෙන් ඉඳගෙන", "artist": "අමරදේව W.D.", "author": "Unknown", "lyrics": "ඉරට මුවාවෙන් ඉඳගෙන හිස පීරනවා සඳට මුවාවෙන් ඉඳගෙන සළු පළඳනවා දීප චන්ද්‍ර රේඛාවෙන් මුහුණ බලනවා වළාකුලෙන් අහස්‌ තලෙන් බිමට වඩිනවා පායන තරු ඇස්‌ ඇරලා බලා සිටිනවා පීදෙන මල් පෙති විහිදා මුකුළු කරනවා සුළන් රොදින් ඇදී ඇවිත් ඇඟේ වෙලෙනවා ගහකොළ හෙලවෙන තාලෙට රහස්‌ කියනවා මේඝ මැදින් විදුලිය මෙන් නටා දිවෙනවා සීතල පොද වරුසාවෙන් සුසුම් සළනවා ඇළ දොළ ගන් ඇද හැලීලා ගිමන් නිවෙනවා මගේ හදට සදා සතුට ඔබෙන් ලැබෙනවා"},
{"title": "ඉර හඳ පායන ලෝකේ", "artist": "අමරදේව W.D.", "author": "Unknown", "lyrics": "ඉර හඳ පායන ලෝකේ ආලෝකය අතරේ සැප දුක සමබර වේ මේ ජීවන කතරේ සැප දුක සමබර වේ උකුලේ ළමැදේ සමබර උසුලන ගැමි ලිය යන ගමනේ මුදු බඳ නැළවෙන සේ කඳුවැටි ගංගා සාගර එකසේ පොළොවට සමබර වේ මේ ජීවන කතරේ සැප දුක සමබර වේ වැඩිවන ආශා මැඬලන වේගේ ජීවන මඟ කැළමේ ඒකම රසමුසු වේ මහ වන වදුලේ වන විල් මතුවේ පියුම් පිපී නැටවේ මේ ජීවන කතරේ සැප දුක සමබර වේ"},
{"title": "ඇසේ මතුවන", "artist": "අමරදේව W.D.", "author": "Unknown", "lyrics": "ඇසේ මතුවන කදුළු බිඳු ගෙන ඔබේ සිරිපා දොවන්නම් හදේ නැලැවෙන කැලෑ මල් ගෙන ඔබේ සිරිපා පුදන්නම් කෙලෙස් මල පිරි නුවර අතහැ‍ර බවුන් වඩනට වනේ වැඩි ඔබ සොයා ආවෙම් පොලෝ තලයේ අනේ පිහිටක් නොමැති වූ විට ඇසේ මතුවන කදුළු බිඳු ගෙන ඉහල නිල්වන් අහස ‍විනිවිද නැගෙන ඔබගේ යෝධ බුදු බණ මගේ නෙත සිත මෝහනය කර මගේ කුදුබ‍ව පසක් කර ඇත ඇසේ මතුවන කදුළු බිඳු ගෙන"},
{"title": "ඈත කඳුකර හිමව් අරණේ", "artist": "අමරදේව W.D.", "author": "Unknown", "lyrics": "ඈත කඳුකර හිමව් අරණේ සීත චන්දන ලපලු සෙවනේ සුළං රැල්ලේ පාව එන්නේ ඔහුගෙ නාමය වේ සඳැල්ලේ මිණි තලාවේ තාරකා පිපි වෙලාවේ ලදැළියන්ගේ හීන අතරේ මැවෙයි ඒ රූපේ ඈත කඳුකර රනින් කල වන් පුළුල් උරයෙන් හසුන් ළමැදේ මුස කරන්නේ හදේ මෝරන ආදරේ සඳේ සොමි ගුණ යා කෙරේ සරා ගී නිල් නුවන් බඳුනින් නුරා ඉතිරෙන්නේ ඈත කඳුකර"},
{"title": "කන්ද උඩින් එන", "artist": "අමරදේව W.D.", "author": "Unknown", "lyrics": "කන්ද උඩින් එන කිකිළිය ගෝමරියේ නළල් වටින් එන දාඩිය මුතු කැටියේ කන්ද උඩින් එන ගෝමරියේ ඇයි මට පිටුපා ගෙට යන්නේ නළලේ දාඩිය මුතුපට පටලා වළකුලේ සුදු සේලය රැළි ලා අත පාමුදු පය පාමුදු ලාගෙන ළමැද ගෝමර මල් ගවසාගෙන කන්ද උඩින් එන ගෝමරියේ කන්ද උඩින් සඳවත පායන්නේ සිනා කිරෙන් සඳ එළිය ගලන්නේ ලැවුගිනි ගත් හද එයිනි නිවෙන්නේ රන්තැටියෙන් කිරි දියර දියන්නේ කඳු පාමුල මිටියාවත වැතිරී ඔබ එනතුරු මම හිඳිනෙමි තනිවී ඈත ඉඳන් කඳු මුදුනට නැගලා මා කැදවන් ඔබ වෙත අත වනලා"},
{"title": "ජගන් මෝහිණී මධුර භාෂිණී", "artist": "අමරදේව W.D.", "author": "Unknown", "lyrics": "ජගන් මෝහිණී මධුර භාෂිණී චාරු දේහිණී කමල වාචිනී සරස්‌වතී දේවී වන්දේ සරස්‌වතී දේවී කම්පිත කංචන මලා කූචිත කිංකිණි නූපුර ජාලා පාද සරෝජේ කටී තටාකේ චංචල නර්තන ලීලා මීන මකර පංකජ රූපාකුල අංකික කුංකුම රේඛා පූර්ණ කුම්භ මික පීන පයෝධර පූරිතාමෘත ධාරා භාග්‍ය සාධන පුණ්‍ය මුර්ති ධර සුරපුර වර අභිරූපා දේහි දේහි වර දායක හස්‌තේ ශුභ මංගල මුද්‍රා"},
{"title": "ලඳුනේ", "artist": "අමරසිරි පීරිස්", "author": "Unknown", "lyrics": "ලඳුනේ ලඳුනේ ඔබේ දෑස දැක ගත්තෙමි සැදෑ කලෙක ලඳුනේලඳුනේ දෙනෝදහක් අතගත්තද සැමියෙකු නැති ලඳුනේ නෑයෙක් නැකම නොකියන වීදි සරන ලඳුනේලඳුනේ තෙල් මල් ගෙන දෝත පුරා මුණි කුටියට පියමංවන ‍ඔබේ දෑස දැක ගත්තෙමි සැදෑ කලෙක ලඳුනේලඳුනේ බුදුන් දැක නිවන් දකිමැයි දෙව්රම යන පාර අහන ඔබද පටාචාරාවකි ඔබද කිසාගෝතමියකි පිරිමින්ගේ පාප කදට දෝස විදින ලඳුනේ අදුරේ පව් කරන දනා එළිය ලබන ලඳුනේ ලැම පමනක් ලොවට පෙනෙන ලය නොපෙනෙන ලඳුනේ කුහුඹුවකුට වරදක් නැති වැරදිකාර ලඳුනේ"},
{"title": "කවුරුවත් නැහැ", "artist": "අමරසිරි පීරිස්", "author": "Unknown", "lyrics": "කවුරුවත් නැහැ - කවුරුවත් නැහැ එගොඩට යන්නට - එ‍ගොඩට යන්නට ඉරගල වැටිලා - ඉවුර දෙපැත්තේ අඳුර ගලනවා - පාරුව ඇතුලට ලංතෑරුම කෝ ඔහෙ තිබුනාවේ කවුරුවත් නැ කවුරුවත් නැ දවසින් දවසම පාලම හැදුනා පාලම් මොලෙන් හෙන හඩ ඇසුනා කිරන කැලෑවේ කුරුළු කොබෙයියන් ගම හැරදා යන්න ගිහින් කවුරුවත් නැ කවුරුවත් නැ දෑතේ අතැගිලි හබලට ගෙවුනා ගෙනියන්නට බැරි මහ බර තිබුනා මෙතුවක් නොම ගිය බර අද දවසේ මට හිනැහීගෙන යනවා රහසේ කවුරුවත් නැ කවුරුවත් නැ"},
{"title": "කාත් කවුරුවත්", "artist": "අමරසිරි පීරිස්", "author": "Unknown", "lyrics": "කාත් කවුරුවත් නැති බව දැන දැන මාත් මගේ හිතත් රාත්‍රියක තියලා නුඹත් ගියා නම් හෙටක් තියෙවිද මටත් ඉරක් නැගෙනා සාංකාව ඇහරෙන ගන අදුරේ ආත්මයම මගේ රාත්‍රියම වැන්නේ ඈත් වෙන්න නම් ඇයි තුරුලෙම උන්නේ වේදනව ඇවිලෙන දිවි කතරේ දෑස් ඇරන් හිද තවත් පලක් නැත්තෙ ඒත් කියන්නම් හමුවෙමු මතු භවයේ"},
{"title": "ඉරි තැලුනු වලා", "artist": "අමරසිරි පීරිස්", "author": "Unknown", "lyrics": "ඉරි තැලුනු වලා, උඩු වියන් යටින් මුදු තාර ඇතිරිල්ලේ යමු යමු යමු අපි ඇවිද යමු පේමියේ සිව් දෙසින් හඹා එන මොටෝ රත රඟ සෙනග රවටමින් වටපිටේ සීරුවට විදුලි ඇස් සිනා සේවී නොරැවටී යන්න යමු කහ ඉරෙන් එතෙර වීලා ඉරි තැලුනු වලා, උඩු වියන් යටින් මුදු තාර ඇතිරිල්ලේ යමු යමු යමු අපි ඇවිද යමු පේමියේ සිව් දෙසින් හඹා එන මොටෝ රත රඟ සෙනග රවටමින් රිය පිලේ කිරුලු හිමි රජ වරුන් අත වනාවී බිම බලන් යන්න යමු කහ ඉරත් රැලි වැටීලා"},
{"title": "ඉකිගසා හඬන", "artist": "අමරසිරි පීරිස්", "author": "Unknown", "lyrics": "ඉකිගසා හඬන අතීතයක කදුලු එක්ක ගනුදෙනු කරනා මට මගේ නොවන මගේම ආදරයක් තිබුනා මට මගේ නොවන මගේම ආදරයක් තිබුනා හීනෙන් හිනෙහී තුන්යම මා රවටා මැදියම් මහරෑ අදටත් හිත ඉගිලෙනවා නින්දෙන් ඇහැරී කලුවරේම යලි සොයනා මට මගේ නොවන මගේම ආදරයක් තිබුනා රිදුමක් වාගේ කිසිදා සුව නොවෙනා සුසුමින් විතරක් නිරතුරුවම පිරිමදිනා උහුලනු බැරිතැන උනු කඳුලුම වගුරුවනා මට මගේ නොවන මගේම ආදරයක් තිබුනා"},
{"title": "ඉකි ගසා හඬන", "artist": "අමරසිරි පීරිස්", "author": "Unknown", "lyrics": "ඉකි ගසා හඬන අතීතයක කදුළු එක්ක ගනුදෙනු කරනා මට මගේ නොවන මගේම ආදරයක් තිබුනා හීනේන හීනැහී තුන්යම මා රවටා මැදියම් මහ රෑ අදටත් හිත ඉගිලෙනවා නින්දෙන් ඇහැරි කලුවරේම යලි සොයනා මට මගේ නොවන මගේම ආදරයක් තිබුනා මගේම ආදරයක් තිබුනා රිදුමක් වාගේ කිසිදා සුව නොවෙනා සුසුමින් විතරක් නිරතුරුම පිරි මදිනා උහුලනු බැරිතැන උනු කදුළුම වගුරුවනා මට මගේ නොවන මගේම ආදරයක් තිබුනා මගේම ආදරයක් තිබුනා"},
{"title": "චාරු දේහේ නුරා", "artist": "අමරසිරි පීරිස්", "author": "Unknown", "lyrics": "චාරු දේහේ නුරා මා දෑසේ මැවේ රාත්‍රියේ රෑ සඳේ ඈ සිනා ශ්‍රීය දේ චාරු දේහේ නුරා පිහින පීනා රසෝඝේ සාරාගී විලේ රාත්‍රී යාමයේ ඈගේ දෑසේ ප්‍ර‍බෝධේ නුරා ගී නැගේ ජීවිතේ යෞවනේ ප්‍රේමයේ මීවනේ චාරු දේහේ නුරා සීත මිහිදුම් වළාවෝ වෙලීලා සදේ තාරකාවේ මිහිතලාවේ තුසීතේ මැවේ මා හදේ ජීවිතේ යෞවනේ ප්‍රේමයේ මී වනේ චාරු දේහේ නුරා"},
{"title": "හන්තානට පායන සඳ", "artist": "අමරසිරි පීරිස්", "author": "Unknown", "lyrics": "හන්තානට පායන සඳ ලස්සනයිද කියන්න මා නොදකින ඒ පුර හඳ ඔබට හැකිය දකින්න අඳුරු ලලා වහිනා කල සරසවි බිම තෙමෙන්න කුඩේ යටින් ඔබ යන කල එපා තනිය දැනෙන්න ලතා මඩුළු අත වනාවි එපා අහක බලන්න මා ගැන මතකය ගුලිකර මහවැලියට දමන්න හන්තානට පායන සඳ"},
{"title": "අතින් වත් අත ඇල්ලුවේ නෑ", "artist": "අමරසිරි පීරිස්", "author": "Unknown", "lyrics": "අතින් වත් අත ඇල්ලුවේ නෑ කිසිම කිලුටක් තිබුනේ නෑ ආදරය හැර හීනයකවත් කිසිම කිලුටක් තිබුනේ නෑ ඔබට අමතක වෙන්න බෑ අපේ දුප්පත් ප්‍රතම ප්‍රේමය ඔබට අමතක වෙන්න බෑ ඔබට අමතක වෙන්න බෑ කුළුදුලේ කී මුල්ම වචනය පැටලෙද්දි ඔය සොදුරු දෑසට නුබත් මා ලග මං වගේ නිහඩයි බිම බලාගෙන ගොලු වුනේ ඒකයි නොඉදුලේ හැගුමන් තියාගෙන ආලයෙන් වියපත් වෙලා අප වෙන් උනෙත් ආදරේ හින්දාමයි සමු දෙන්න බැරි හමු නොවිත් ඒකයි හමු නොවිත් සමු දෙන්න බැරි ඒකයි ඔබට අමතක වෙන්න බෑ අපේ දුප්පත් ප්‍රතම ප්‍රේමය ඔබට අමතක වෙන්න බෑ ඔබට අමතක වෙන්න බෑ"},
{"title": "ඇය යන්න ගියා මැකිලා", "artist": "අමරසිරි පීරිස්", "author": "Unknown", "lyrics": "ඇය යන්න ගියා මැකිලා වන සිරසක තුරු සෙවණැලි අතරේ ගී ගයමින් හිඳ මා තුරුලේ ඇය යන්න ගියා මැකිලා පිනි කඳුළක් මල් පෙති අග තවරා මීදුම් සළුවෙන් මුහුණ වසා නිල්ල නිලන නිල් කඳුවැටි අතරේ සඳඑළියේ මං පෙත පාදා රහසක් සඟවා ගොළු වූ හදකින් යන්න ගියා මැකිලා ඇය යන්න ගියා මැකිලා යළි කවදාවත් හමු නොවනා බව මඳ පවනක් හිස අතගා කීවද අදහා ගන්නට නොහැකිය කිසිදින ඇය යළි නොඑතැයි ගිම්හානෙට පෙර ඇය යන්න ගියා මැකිලා පිනි කඳුළක් මල් පෙති අග තවරා මීදුම් සළුවෙන් මූණ වසා"},
{"title": "රන් දොරින් එන්න", "artist": "අමිතා වැදිසිංහ", "author": "Unknown", "lyrics": "රන් දොරින් එන්න ආදරේ කැඳවලා මල්සරා නිල් නුවන් ඔබ මා කෙරේ දෙන්න සතුටින් පුරා මිහිරි සමීරෙකී මාගේ උදානයේ සීතල යාමේ ජීවේ සිහින විමානයේ රන් දොරින් එන්න ආදරේ මා හදේ ආශා නිවි නිවී යාදෝ සහන් සුවේ දිදී ඒ නුරා උතුරාදෝ රන් දොරින් එන්න ආදරේ රන් දොරින් එන්න ආදරේ කැඳවලා මල්සරා"},
{"title": "ඔන්න බබෝ ඇතින්නියා", "artist": "අමිතා වැදිසිංහ", "author": "Unknown", "lyrics": "ඔන්න බබෝ ඇතින්නියා ගල් අරඹේ සිටින්නියා ඔන්න බබෝ ඇතින්නියා ගල් අරඹේ සිටින්නියා පුතු ගැන සිහි කරන්නියා නෙත කඳුලැලි සලන්නියා නුඹේ අම්මා කොතැන ගියේ මානෙල් මල් විලට ගියේ නුඹේ අම්මා කොතැන ගියේ මානෙල් මල් විලට ගියේ ඒ විල මැද පිරුණු දියේ දුකට හැඬුව කඳුළු තියේ ඒ විල මැද පිරුණු දියේ දුකට හැඬුව කඳුළු තියේ කන්දෙන් කන්දට පැනලා ඇඟ ලේ කැටි කිරි කරලා කන්දෙන් කන්දට පැනලා ඇඟ ලේ කැටි කිරි කරලා රන් තැටියේ පුරවාලා රන් තැටියේ පුරවාලා කිරි අරගෙන එයි අම්මා ඔන්න බබෝ ඇතින්නියා ඔන්න බබෝ ඇතින්නියා ගල් අරඹේ සිටින්නියා"},
{"title": "අනෝතප්ත විල", "artist": "අමරදේව W.D. සමග අමිතා වැදිසිංහ", "author": "Sunil Sarath Perera", "lyrics": "අනෝතප්ත විල නෙළුම නෙලාලා පීරා වරලස මල් ගවසාලා නාග ලොවින් බැස නාලිය ගමනින් වරගන පිරිවරිනා එරන්දතිය එනවා සිතක උපන් දොල සංසිදුවාලා මතක සිනාවෙන් මුව සරසාලා ඉරට මුවාවෙන් සඳට මුවාවෙන් සිතට තුරුළු වෙනවා එරන්දතිය එනවා කෝමල ගමනින් කෝල හැඟුම් හල කාලය ගිරෙන් සිතුවිලි සේනාගෙන වරගන පිරිවරිනා එරන්දතිය එනවා අනෝතප්ත විල නලලත කුංකුම තිලක තියාලා නීල වර්ණයෙන් කැළුම් නෙලාලා පාද කිකිණි සොලවා එරන්දතිය එනවා අනෝතප්ත විල"},
{"title": "සෙනෙහස විඳිනට", "artist": "චන්ද්‍රලේකා පෙරේරා", "author": "Unknown", "lyrics": "සෙනෙහස විඳිනට පින් කර ඇතිමුත් පිවිතුරු ඔබේ හදින් ඔබේ දෙපා ළඟ දුහුවිල්ලක්වත් වන්නට නොමැත වරම් එක තැන රැඳුනද මනසින් හැඟුමින් ඔබ මා එකම සිතින් කුමටද නිදිනැති යහනට නැතිනම් ඔබගේ සුසුම් පවන් සෙනෙහස විඳිනට පින් කර ඇතිමුත් යළි යළි බැඳුනද නොසැලෙන විලසින් ඔබ මා සිතට සිතින් කුමටද නැති කළ සෙවණට මොහොතක් ඔබ ළඟ රැදෙන වරම් සෙනෙහස විඳිනට පින් කර ඇතිමුත්"},
{"title": "මගේ දිනපොතේහි", "artist": "චන්ද්‍රලේකා පෙරේරා", "author": "Unknown", "lyrics": "මගේ දිනපොතේහි අද රෑ ලියන්නේ අ‍ප පෙම්කතාවේ අවසානයයි ඔබ නේන දා හෙට මා මනමාලියයි මගේ දිනපොතේහි අද රෑ ලියන්නේ කවදාක හෝ එක්තැන් වෙලා සුව හා සුසුම් සමසේ දරා අත් වැල් බැඳන් යමු ජීවිතේ ඒ කී වදන් බොල් හීනෙකී මගේ දිනපොතේහි අද රෑ ලියන්නේ පාසැල් සමේ අ‍පි දෙන්නගේ නම් කුරුටු ගෑ කඩදාසි ඒ ගිණි අවුළුවා නටබුන් පෙමින් අපි වෙන්වෙමු දෛවේ ලෙසින්"},
{"title": "ළඟින් මගේ ඔබ සතපා", "artist": "චන්ද්‍රලේකා පෙරේරා", "author": "Unknown", "lyrics": "ළඟින් මගේ ඔබ සතපා හදින් මගේ කතා කළා හදට ඔබේ නොදැණුනාද මගේ ආදරේ මගේ ආදරේ ඇවිත් වගේ අඳුරු වලා ඔබ ළඟ නෑ දුරස් වෙලා පෙම් කළ හද වෙනස් වෙලා මක් උනාද මේ නැතුව ආදරේ මගේ ආදරේ ළඟින් මගේ ඔබ සතපා හදින් මගේ කතා කළා මගේ හදින් දුරස් වන්න අන් හදකට පෙම් කරන්න හදට ඔබේ හැකි උනාද නැතුව ආදරේ මගේ ආදරේ මගේ ආදරේ ළඟින් මගේ ඔබ සතපා හදින් මගේ කතා කළා අඳුරු වලාකුළක් වගේ අඳුරුයි දැන් සිතද මගේ අඳුරු වලාකුළක් වගේ අඳුරුයි දැන් සිතද මගේ මගේ කඳුළු පිසලන්නට නොහැකි වේද ඔබේ හදට පුදා ආදරේ මගේ ආදරේ අළුත් පෙමින් විඩා වෙලා ආවෝතින් මාව සොයා අතීතයට සමුදීලා පිළිගන්නට හිඳියි බල මගේ ආදරේ මගේ ආදරේ ළඟින් මගේ ඔබ සතපා හදට ඔබේ නොදැණුනාද මගේ ආදරේ මගේ ආදරේ මගේ ආදරේ මගේ ආදරේ මගේ ආදරේ ඔබ නැද්ද ආදරේ"},
{"title": "ගතින් ඉන්නට නැතත් ලංවී", "artist": "චන්ද්‍රලේකා පෙරේරා", "author": "Unknown", "lyrics": "ගතින් ඉන්නට නැතත් ලංවී සිතින් යන්නට එපා වෙන්වී ඔබෙන් තොරවූ ලෝකයක් සිතා ගන්නට බෑ… සිතා ගන්නට බෑ… ඔබේ දෙනෙතින් ලොව දකින්නෙමි ඔබේ වදනින් ලොව අසන්නෙමි නවාතැන ජීවන මගේ… ඔබේ සෙවනැල්ලයි… ඔබේ සෙවනැල්ලයි… ගතින් ඉන්නට ඔබේ ඇසුරින් යලි උපන්නෙමි ඔබේ දැකුමෙන් දිවි ගෙවන්නෙමි සදාතන ජීවය හදේ… ඔබේ හසරැල්ලයි… ඔබේ හසරැල්ලයි… ගතින් ඉන්නට"},
{"title": "ගතින් ඉන්නට නැතත් ලංවී", "artist": "චන්ද්‍රලේකා පෙරේරා", "author": "Unknown", "lyrics": "ගතින් ඉන්නට නැතත් ලංවී සිතින් යන්නට එපා වෙන්වී ඔබෙන් තොරවූ ලෝකයක් සිතා ගන්නට බෑ සිතා ගන්නට බෑ ඔබේ දෙනෙතින් ලොව දකින්නෙමි ඔබේ වදනින් ලොව අසන්නෙමි නවාතැන ජීවන මගේ ඔබේ සෙවනැල්ලයි ඔබේ සෙවනැල්ලයි ගතින් ඉන්නට ඔබේ ඇසුරින් යලි උපන්නෙමි ඔබේ දැකුමෙන් දිවි ගෙවන්නෙමි සදාතන ජීවය හදේ ඔබේ හසරැල්ලයි ඔබේ හසරැල්ලයි ගතින් ඉන්නට"},
{"title": "කිරි අම්මාවරු", "artist": "චන්ද්‍රලේකා පෙරේරා", "author": "Unknown", "lyrics": "කිරි අම්මාවරු දනට වඩිනවා කිරි සුවඳයි මුළු ගම්මානේ අම්මා ඇයි ඒ දනට නොයන්නේ නො අසන් පුතනුවනේ මා සිත රිදෙන නිසා නෙත නිදි වරමින් කැත කුණු අතගා මම නුඹ හැදුවෙමි දුක් විඳලා එනමුදු කුසයේ හොවමින් බිහිකර ඇඟ ලේ කිරි කර නැත පොවලා නුඹගෙන් දරු සුරතල් බැලුවා මිස මව් පදවිය නැත මා පතලා මතු භවයේ මා දනට වඩින්නම් නුඹ බිහි කර කිරි මව වීලා"},
{"title": "දැල්වූ පහන් දැල්වී තිබේවා", "artist": "චන්ද්‍රලේකා පෙරේරා", "author": "Unknown", "lyrics": "දැල්වූ පහන් දැල්වී තිබේවා සුන් වූ පැතුම් දළු ලා වැඩේවා ළං වූ ලවන් හමු වී තිබේවා වෙන් වූ නුවන් කඳුලින් මිදේවා විරහී හඳින් ගලන දුක් වේදනාවන් සිහිලැල් පවන් රැල්ලකින් සංසිදේවා නොබිඳී නිර්මල ප්‍රාර්ථනාවන් පෙම්වත් ලොවක් අරුණු අහසේ දිසේවා දැල්වූ පහන් දැල්වී තිබේවා සුන් වූ පැතුම් දළු ලා වැඩේවා ළං වූ ලවන් හමු වී තිබේවා වෙන් වූ නුවන් කඳුලින් මිදේවා"},
{"title": "සඳට සැහැසිකම් කළ අය", "artist": "චන්ද්‍රෙස්න හෙට්ටිආරච්චි", "author": "Unknown", "lyrics": "සඳට සැහැසිකම් කළ අය සඳ එළියෙන් සැණසුනාම සඳ සාවිට දුක හිතෙන්නෙ නෑ නුඹට ආදරෙන් සිටි අය නුඹ හා දොඩමළු වෙනකොට මට නම් එය දරාගන්න බෑ සුවඳ මතක් වී පෙරදා යළිඳු නුඹ වටා සරනා බිඟුන් නිසා මගෙ හිත නිද නෑ තුඩින් තුඩට රොන් ඉඩ හැර දිනෙන් දින පිපී පරවෙන මලක් නිසා මට නිවනක් නෑ සුවඳක් තනිවම විදින්න බඹරෙකු උහුලන ගින්දර මලකට කිසිදා පෙනෙන්නෙ නෑ නුඹගෙන් උණුසුම විඳිනා මගෙ හිත ලඟ දඟ කෙරුවත් නුඹට උණුසුමක් දැනෙන්නෙ නෑ"},
{"title": "ඔයා නිසා මගේ සිනා", "artist": "චන්ද්‍රෙස්න හෙට්ටිආරච්චි", "author": "Unknown", "lyrics": "ඔයා නිසා මගේ සිනා මැකී ගියාදෙන් ඔබේ සිනාවන් මතකේ රැදී තියෙද්දෙන් ඔබේ පුංචි දොතොල් අතරේ මා තනිවෙද්දෙන් ඔයා ලැබෙන්නේ නැතිනම් තනිකඩ වෙද්දෙන් තනිකමෙන් ගඟ ගලා යනවා සදේ නුඹ නැ අම්බරේ විදවමින් සිත සොයනවා තව ඔයා කොතනද හැංඟුනේ අපි හමුවුනොතින් - සඳ එයි නැගිලා ගංගාවට එලිය අරන් - ආදර මල් යායක් අරන් බලා ඉන්නම් තව හුඟක් කල් ඔයා එනතුරු මා සොයා ඔයා නාවත් ඉවසලා හිත හදාගන්නම් ඔබ නිසා තනිකම උහුලා - පහලට ගලනා ගඟ සේ ඉන්නම් සතුටින් - සෙනෙහස රන්දා රහසින් ඔයා නිසා මගේ සිනා"},
{"title": "මුතු කඳුලින්", "artist": "චන්ද්‍රෙස්න හෙට්ටිආරච්චි", "author": "Unknown", "lyrics": "මුතු කඳුලින් මා දෙනෙතේ පෙම් සිතුවම් බොඳ වන්නේ රිදවන්නද වෙන්වූයේ තනිවෙන්නම් මා සඳ මඩලේ තරු පොකුරේ රුව ඇඳුනේ ඔබගේ මද පවනේ මල් ගොමුවේ සුවඳ දැනේ ඔබගේ කඳුළැල්ලෙන් හසරැල්ලෙන් සැනසෙන්නම් මා මුතු කඳුලින් මල් පිපුනේ රොන් පිරුණේ බඹරුන් ගී ගැයුවේ නෙතු දැහැනේ පෙම් සිහිනේ සිතුවම් මා පෙලුවේ හසරැල්ලෙන් කඳුළැල්ලෙන් සැනසෙන්නම් මා මුතු කඳුලින්"},
{"title": "ඔයා හින්දා මං වින්දා", "artist": "චන්ද්‍රෙස්න හෙට්ටිආරච්චි", "author": "Unknown", "lyrics": "ඔයා හින්දා මං වින්දා දුක් ගංගා එදා හංගා පෙම් බැන්දා ඔබ හට මා ආදරේ කරලා දෑසම රිදවා දමා ගිහින් මගෙන් වෙන්වෙලා වෙනස්වී - දුකක්දී ළඟින් ඈ දුරස් වී මා ඔබේ කියලා, දෑතම පටලා වෙරලේ පියමැන්න කාලයේ මතකය ගෙවෙනා, ආදරේ පිරිලා පාළුව ගොඩ ගැහුනා ජීවිතේ කියාලා දීලා, යනවද පියඹා දන්නේ නෑ මගේ මදිවද ආදරේ ඔයා හින්දා කාලය ගෙවිලා, ඔබ වෙන්වීලා කාටද හිමිවීලා මේ භවේ ඒ දුක ඉවසා ගන්නට බැරුවා ආයේ එනවාද හීන් සැරේ කියාලා දීලා, යනවද පියඹා දන්නේ නෑ මගේ මදිවද ආදරේ ඔයා හින්දා"},
{"title": "දෑසෙ කතාවෙන්", "artist": "චන්ද්‍රෙස්න හෙට්ටිආරච්චි", "author": "Unknown", "lyrics": "දෑසෙ කතාවෙන් හසරැල් ලතාවෙන් මන බැන්දුවේ මා සෙනෙහේ ලතා මනමාලියක් වී වෙනතක් බැලූ දා පර වී ගියේ නෑ මගෙ චේතනා නිමවූ කතාවන් ගොළු වී තියේ දෙනෙතේ මැවේ ඔබේ හසරැලි සිතේ කඳුලක් වුණා ඔබේ සෙනෙහේ මගේ ලොවේ දෑසෙ කතාවෙන් හසරැල් ලතාවෙන් මන බැන්දුවේ මා සෙනෙහේ ලතා මනමාලියක් වී වෙනතක් බැලූ දා පර වී ගියේ නෑ මගෙ චේතනා අද හෝ හෙටින් හෝ මතු කවර දා තනි වූවොතින් ලොවේ ඔබෙ කල්පනා පිළිගන්නෙමි සදා මා ඔබෙම වේ එදා දෑසෙ කතාවෙන් හසරැල් ලතාවෙන් මන බැන්දුවේ මා සෙනෙහේ ලතා මනමාලියක් වී වෙනතක් බැලූ දා පර වී ගියේ නෑ මගෙ චේතනා පර වී ගියේ නෑ මගෙ චේතනා"},
{"title": "ආපසු යන්නට", "artist": "චන්ද්‍රෙස්න හෙට්ටිආරච්චි", "author": "Unknown", "lyrics": "ආපසු යන්නට පාර කියනවද දැන් සමුගන්න ළඟයි ආයෙත් දවසක අප හමුවන්නට කළ පින් මදිද සිතෙයි යොදුන් ගණන් දුර ආවෙද පසුකර මල් මාවතක නොවේ ඇයි ඔබ මට ඔබෙ සෙනෙහස කීවේ ඇයි මා ඔබ ගැන සෙනෙහේ පිරූවේ ආපසු යන්නට පාර කියනවද කල්ප කාලයක්‌ පෙරුම් පිරූවේ හෙට සමුගන්න නොවේ ඇයි ඔබ මට ඔබෙ සෙනෙහස කීවේ ඇයි මා ඔබ ගැන සෙනෙහේ පිරූවේ"},
{"title": "ඈත ඈත චන්ද්‍ර මණ්ඩලේ", "artist": "චන්ද්‍රෙස්න හෙට්ටිආරච්චි", "author": "Unknown", "lyrics": "ඈත ඈත චන්ද්‍ර මණ්ඩලේ පාට පාට තාරකා පෙළේ පුංචි පුංචි මල් සිනා මලේ හැංගුවාද ආදරේ අපේ අඩවන් වූ නිල් දෑසේ කී රහසේ වත කමලේ සිරියාවයි මදහාසේ සිත් සපුරා දුටු සිහිනේ පෙර යාමේ එළිවෙන්නේ කවදාදැයි සංකාවේ පෙර කාලේ දොළ ලන්දේ සැංගිලා අත් පටලා කවි සිංදු කී ලීලා සිහිවේදෝ මන බැන්දු ඒ කාලේ ඔබ හින්දා දුක් කඳුලේ තනිවෙලා"},
{"title": "අහස් ගැඹේ තරු කැට ගානේ", "artist": "චරිතා ප්‍රියදර්ශනී  පීරිස්", "author": "Unknown", "lyrics": "අහස් ගැඹේ තරු කැට ගානේ පොළෝතලේ වැලි කැට ගානේ නිල් සයුරේ රළ පෙළ ගානේ ආදරෙයි මං ආදරෙයි වඳුළු සිරස පිපි මල්ගානේ විහඟ තුඩක කිචි බිචි ගානේ සිහිල සිඹින මදනල ගානේ ආදරෙයි මං ආදරෙයි අහස් ගැඹේ තරුකැට පිපෙන මියෙන හිරු සඳු ගානේ සිතෙහි පිරෙන සිතිවිලි ගානේ සිහින ගෙනෙන හැම රෑ ගානේ ආදරෙයි මං ආදරෙයි අහස් ගැඹේ තරු කැට"},
{"title": "සරසවි උයනේ", "artist": "ක්ලැරන්ස් විජේවර්ධන", "author": "Unknown", "lyrics": "සරසවි උයනේ - මේ තුරු සෙවනේ අපේ සොදුරු ලොව අතීතයේ මහවැලි ඉවුරේ - නිසසල අරණේ මැවූ සිහින ලොව බිඳී ගියේ සීතල සිරිපොද වැස්සේපෙර දිනයක මේ අඩි පාරේ අප තනි වූ මැයි තුරුසෙවනේමත ඔබගෙනි උණුසුම රැදුනේ සරසවි උයනේ පාළුව ඉහිරෙන අඳුරේමා තනිකර දා මෙහි සෙවනේ මතකය පමණකි ලඟ රැදුනේඔබ අද කොතැනද පිය නැඟුවේ සරසවි උයනේ"},
{"title": "සැන්දෑ වලාවන්", "artist": "ක්ලැරන්ස් විජේවර්ධන", "author": "Unknown", "lyrics": "සැන්දෑ වලාවන් පා වුනා‍වේ වැල්‍‍‍‍‍‍‍‍ලේ මා තනි වු ‍‍‍වෙලේ ඇය එන්නේ දෝ මග එන්නේදෝ සිතහි නම් සැකයක් ඇ‍තේ මාගේ සැනසුම ඈ වේ නිරතුරු හමුව‍න්නේ කොහෙ‍දෝ යළි පැතුමන් මගේ සිඳ බිඳ දාලා ඉන්නේ ඇයි මිහිරේ ජීවේ වෙරළින් ආවේ ඔබවයි මා සිත පිළිගන්නේ පැතුමන් මගේ සිඳ බිඳ දාලා ඉන්නේ ඇයි මිහිරේ"},
{"title": "සැණකෙළියේ සඳ එළියේ", "artist": "ක්ලැරන්ස් විජේවර්ධන", "author": "Unknown", "lyrics": "සැණකෙළියේ සඳ එළියේ දිමුතු ලතාවයි සිළි සිළියේ සියුමැලියේ ඔමරි හිනාවයි ඔමරි හිනාවයි ඔමරි හිනාවයි සැණකෙළියේ සඳ එළියේ දිමුතු ලතාවයි නෑ කිසි දුකක් සිතේ සීතල පවන් වැදේ හිරිමල් යොවුන් විලාසේ දෑසින් හොරෙන් වගේ ආදර හැඟුම් මැවේ සමනළ ගමන් ලතාවේ සැණකෙළියේ සඳ එළියේ මහ බඹු කොටා ඇතේ ඉරණම සිනාසුනේ කාගෙද කවුදෝ දන්නේ ජීවන ගමන් මගේ මාවත වෙනස් වුණේ අද රෑ විනෝද වන්නේ සැණකෙළියේ සඳ එළියේ නෑ කිසි දුකක් සිතේ සීතල පවන් වැදේ සැණකෙළියේ සඳ එළියේ"},
{"title": "රෑ තාරකාවෝ", "artist": "ක්ලැරන්ස් විජේවර්ධන", "author": "Unknown", "lyrics": "රෑ තාරකාවෝ බැලුවා එබී කිමදෝ නුවන් ඔබගේ කඳුලින් තෙමී ඊයේ දවාලේ අපගේ ලොවේ ආශා ගඟුල් යා වුණා කඳුලැල් සලාලා නොහඬන් ළඳේ මමමයි කෙදා හෝ ඔය දෑත ගන්නේ ආශා විශාලයි ඉවසීම හීනයි දෙදෙනා කෙනෙක් වී බැඳුණා සිතේ රෑ තාරකාවෝ බැලුවා එබී හඳුණන්නෙදෝ ඔබ මාගේ සෙනේ ඉවසන්නෙදෝ ඔබ ඊයේ වගේ හදවත කොනේ මා කඳුලක් තියෙනවා කිසිදාක නොසිතූ නොපැතූ ලෙසේ රෑ තාරකාවෝ බැලුවා එබී"},
{"title": "නාමල් ආයේ පිපුණාවේ", "artist": "ක්ලැරන්ස් විජේවර්ධන", "author": "Unknown", "lyrics": "නාමල් ආයේ පිපුණාවේ නෑ මං ආයේ විමසන්නේ ඉක්මන් වෙලා සැමට ඔබ කී කතා විශ්වාස කරගන්න බැරි වූ නිසා කකියයි මගේ මනස රිදවූ නිසා කම් නෑ ඉතිං දෙහද වෙන් වූ නිසා නාමල් ආයේ පිපුණාවේ නෑ මං ආයේ විමසන්නේ සිත ගත දෙක සනසාලා මගෙන් වෙන්වීලා කෙනෙක් සනසාලා මගෙ පාමුල වැඳ වැටිලා ඔබ කීවත් නෑ කියලා නෑ මං ආයේ පිළිගන්නේ නාමල් ආයේ පිපුණාවේ දුක සැප දෙක මගේ ජීවේ දරන්නට ආවේ ඔබයි සැනසූවේ මගෙ ආදර සිහිනය වී ඔබ‍ගේ රුව ඇත බොඳවී නෑ මං ආයේ විමසන්නේ නාමල් ආයේ පිපුණාවේ ඉක්මන් වෙලා සැමට ඔබ කී කතා විශ්වාස කරගන්න බැරි වූ නිසා කකියයි මගේ මනස රිදවූ නිසා කම් නෑ ඉතිං දෙහද වෙන් වූ නිසා නාමල් ආයේ පිපුණාවේ"},
{"title": "මුතු වරුසාවක් වැහැලා", "artist": "ක්ලැරන්ස් විජේවර්ධන", "author": "Unknown", "lyrics": "මුතු වරුසාවක් වැහැලා නෙත අපගේ බැඳුණ දිනේ ඔබයි මමයි ජීවිතයේ සුවයක් ලද ඒ සොඳුරු දිනේ බින්දු බින්දු වැහි වැටුණා සෙවණ සොයා නෙත ඇදුණා දෙනෙතේ දැක ආරාධනා ඔබ මා අසලට ආ දිනේ මුතු වරුසාවක් වැහැලා නෙත බැන්දු රූ එදා ඔබගේ සිත ආදරෙන් බැඳී තිබුණා මුතු වරුසාවක් මාවතේ සෙනෙහස අඳුනයි ජීවිතේ මුතු වරුසාවක් වැහැලා"},
{"title": "කිරි සුදු සේලේ", "artist": "ක්ලැරන්ස් විජේවර්ධන", "author": "Unknown", "lyrics": "කිරි සුදු සේලේ ඇඳි ඇගෙ ලෝලේ ගෙල බැඳි මාලේ ඇගෙ නෙතු දෑලේ පියකරු ලීලේ කිරි සුදු සේලේ බැඳි ඇගෙ ලෝලේ ගෙල බැඳි මාලේ ආයන්න කියවන්නෙ ඈ මී බින්දු රස දෙන්නෙ ඈ සිත පුංචි රිදවන්නෙ නෑ පංතියේ කිරි සුදු සේලේ ඇඳි ඇගෙ ලෝලේ ගෙල බැඳි මාලේ ඔබෙ පුංචි ඒ පංතියේ ඉඳගන්න සිතෙහි තියේ ඉඩ දෙන්න බැරිදෝ ලියේ පංතියේ කිරි සුදු සේලේ ඇඳි ඇගෙ ලෝලේ ගෙල බැඳි මාලේ ඇගෙ නෙතු දෑලේ පියකරු ලීලේ කිරි සුදු සේලේ බැඳි ඇගෙ ලෝලේ ගෙල බැඳි මාලේ"},
{"title": "ගමෙන් ලියුමක් ඇවිල්ලා", "artist": "ක්ලැරන්ස් විජේවර්ධන", "author": "Unknown", "lyrics": "ගමෙන් ලියුමක් ඇවිල්ලා අක්කගෙන් වාගේ මොකක් කියලාද දන්නෑ එහෙ ගියෙත් නෑනේ පහළ කුඹුරේ නිල් ගොයම් දැන් හරිම සරුසාරයි වැසි වැටී වැව් ළිං පිරිලා හරිම සිරියාවයි තවත් ආරංචි ගොඩයි ලියන්නට ලැජ්ජයි ගමෙන් ලියුමක් ඇවිල්ලා… ගෙදර අය සතුටින් සිටින්නේ මල්ලි දැකගන්නයි කාලෙකින් මෙහෙ ආවෙ නෑනේ වැඩත් වැඩි වෙන්නයි ළඟදි එනවා නම් හොඳයි නිවාඩුව දැන් දැන් ළඟයි… ගමෙන් ලියුමක් ඇවිල්ලා…"},
{"title": "පෙම් පාට වෙලා", "artist": "චිලී තිලංක", "author": "Unknown", "lyrics": "පෙම් පාට වෙලා සිත් යාය පුරා රතු මල් ගවුමෙන් සිරියා වෑහුණා රෑ සිහින නෙලා පෙම් පැතුම් මවා බලා උන්නු කාලේ දැන් උදා වෙලා වෙල් යායේ හමනා කිරි කෝඩු සිනහා ආදරේ හැඟුම් වත් කළා ලා දම් අහසේ පියඹන්න රිසිසේ ආසයි හැබැහින් රහසේ ආදරේ වාරම් ගයලා ජිවිතේ තෝරා බේරා ආදරේ විඳිමූ ලං වෙලා හැන්දෑවේ දොළ පාරේ දැවටීලා පවනැල්ලේ ඇවිල්ලා සිප ගන්නම් සබඳේ ජීවිතේ මල් යායේ සැනසෙන්න ඔබ තුරුලේ ආසයි මටත් දැන් ඉතින් ආදරේ වරම් ගයලා ජිවිතේ තෝරා බේරා ආදරේ විඳිමූ ලං වෙලා පෙම් පාට වෙලා"},
{"title": "ලා රෝස", "artist": "චිලී තිලංක", "author": "Unknown", "lyrics": "ලා රෝස නා මල් සඳුන් සුවඳින් සිත නැහැවිලා මා නෙත් බොඳ වුනේ පිවිතුරු නුඹේ සෙනෙහෙ දැනිලා දෑතින් අල්ලා ඔහේ යන්න පියඹා මැව් හීනේ සිඳී මා තනිවුනා නුහුරු මිහිරෙන් ඔබේ නෙතු දිලී පියවිලා සිත පුරා පෑව හද පුදා වින්ද ආදරෙත් සැඟවූවා දෑතින් අල්ලා ඈත කඳු නිම්නයේ සිටියදී පියඹලා පුංචි රන්පාට සමනල්ලු රෑන අද වගේ සිහිවුනා දෑතින් අල්ලා මගේ සිතම සිඹලා පෑ සෙනෙහේ තියේ මා දිවිතුරා ලා රෝස"},
{"title": "චන්ද්‍රයන් පිදූ", "artist": "ඩැඩී", "author": "Unknown", "lyrics": "‍සිහිනෙන් වූවත් නෑ මා දුටුවේ මාගේ දිවියේ අන්ධකාරේ ඔබගෙන් පෙර නෑ මා කිසිදා හිරු අග බැලුවේ නෑ මා කිසිදා හිරු අග බැලුවේ පැතුමන් අඳුරේ සිරවූයේ ඔබගේ සෙනෙහෙන් ආදරයේ අර්ථය ලැබුවේ කඳුළැල් දිය දහරා නෙතඟින් නොකැඩී ගලා ගියේ මා තනිවී සිසිලෙන් මුවා වූ වස‍න්තේ උදාවූ ලෙසේ චන්ද්‍රයන් පිදූ කිරණක් සඟවාලා හොරෙන් වර්ණවත් කලේ මාගේ සිහිනේ ඔබේ නමින් වැගුරු ඒ කඳුළැල් බිඳු වියැකි සෙමෙන් ඔබ ගැන ආ සෙනෙහස මුදු පවනේ රැඳි සිසලක් ලෙසින් (සිසලක් ලෙසින්) ඔබ මා හද පුබුදු කලේ වසන්තයයි මා ගේ දෙතොලේ සිහිවන්නේ ඔබෙ මුව හමුවේ කැළඹීලා සැමදා ඔබගේ කැළුමන් අතරේ අප නෙත් ගැටෙනා මොහොතේ ඔබ මා සතුවෙයි ර‍හසේ හැඟේ සිතේ නිසංසලේ රඟදෙයි ඔබ දෙසනා වදනන් යහනේ තනි වී චන්ද්‍රයන් පිදූ කිරණක් සඟවාලා හොරෙන් වර්ණවත් කලේ මාගේ සිහිනේ ඔබේ නමින් වැගුරු ඒ කඳුළැල් බිඳු වියැකි සෙමෙන් ඔබ ගැන ආ සෙනෙහස මුදු පවනේ රැඳි සිසලක් ලෙසින් සිසලක් ලෙසින් ඔබ මා හද පුබුදු කලේ"},
{"title": "මිරිඟුව පරදා", "artist": "චිත්රාල් සෝමපාල", "author": "Unknown", "lyrics": "මිරිඟුව පරදා තුරඟෙකුගේ වේගයෙන් දස දිග පුරා දෙනුවන තියුණුව යොමා මිරිඟුව පරදා තුරඟෙකුගේ වේගයෙන් දස දිග පුරා දෙනුවන තියුණුව යොමා පරතෙරම සොයා දළ රළු මඟ පහුකරන් දිගු ගමනට මගේ වෙහෙසියි ඔබ හුරු කලේ පරතෙරම සොයා දළ රළු මඟ පහුකරන් දිගු ගමනට මගේ වෙහෙසියි ඔබ හුරු කලේ ඕ ඕ ඕ මිරිඟුව පරදා තුරඟෙකුගේ වේගයෙන් නිම්හමුවන තුරා මාවෙමි රුපුලෙන් ඔබේ මිරිඟුව පරදා තුරඟෙකුගේ වේගයෙන් දස දිග පුරා දෙනුවන තියුණුව යොමා ඕ ඕ ඕ මිරිඟුව පරදා"},
{"title": "පායන සඳේ", "artist": "දමිත් අසංක", "author": "Unknown", "lyrics": "පායන සඳේ සීතල රැයේ පෝය වගේ හිනැහෙන්නේ නාදෙට නුඹේ සැලුනා මාගේ හර්දේ නුඹටයි පූජා කළේ රංගන ගෙනා උකුලේ සැලෙනා තාලෙට සෙළවෙයි මා හර්දේ ගී පද සී පද තාලෙට නටනා මා මන බැන්දේ ඒ හින්දා හංස වෙසින් නුඹ රඟනා විලාසේ ඉවසිලි නෑ මගෙ සිත මැණිකේ කන්ට අඳින්නට දෙන්නං සදා මං නවතාපන් නුඹෙ නැටුම් නගේ ලස්සන නුඹෙ ඔය රූපෙ සොබාවේ මට විතරක් නම් මගෙ මැණිකේ රංග සබාවට යන්ට එපා නුඹ මට විතරයි ඔය නැටුම් අගේ"},
{"title": "සිත මගේ රිදුනා", "artist": "දමිත් අසංක", "author": "Unknown", "lyrics": "සිත මගේ රිදුනා ඔබ හැර ගියදා ඔබ මා හැර ගියදා නෙතු මගේ හැඬුවා මතකය ගෙන ආ ඔබෙ ආදරේ සොයලා ඔබ මා නමින් ගෙන ආ පැතුම් බොඳවී ගිහින් මේ සිත බිඳී ඇයි හැර ගියේ මගෙ ආදරේ ළඟ නැති ඔබෙ පෙම මතකෙට එනවා ඔබ යලි එයි සිතිලා සිත මගේ රිදුනා ඔබ හැර ගියදා මා තනිකර ගියදා නෙතු මගේ හැඬුවා මතකය ගෙන ආ ඔබෙ ආදරේ සොයලා ඔබේ සිතුම් ඔබෙ හැඟුම් ළඟ මම හදේ මැවූ ලොවේ තැනූ සිහිනය කොහේ ගියේ මෙසේ වෙන්වෙලා ආදරේ බිඳ දමා ඔබ මා නමින් ගෙන ආ පැතුම් ඇයි හැර ගියේ මගෙ ආදරේ සිත මගේ රිදුනා ඔබ හැර ගියදා ඔබ මා හැර ගියදා මගේ වෙලා මගෙන් නොයා ඉනු මැන ලඟින් මගේ සිතින් බැඳී ඉනු මැන ඔබේ නමයි හදේ ගැහෙන්නේ ඔබට මා ආදරෙයි ඔබ මා නමින් ගෙන ආ පැතුම් ඇයි හැර ගියේ මගෙ ආදරේ සිත මගේ රිදුනා ඔබ හැර ගියදා ඔබ මා හැර ගියදා"},
{"title": "රත්තරන් මාගේ", "artist": "දමිත් අසංක", "author": "Unknown", "lyrics": "රත්තරන් මාගේ සුරඟනක් වාගේ ඇස් වලින් කී දේ ආදරේ නේ හුරතලේ මූණේ මල් මිටක් වාගේ කම්බුලක් ගානේ හාදු ඕනේ හිත් යායේ පෙම් මල් පීදී අමරසදෝ  වෑහෙන්නේ වස්සානේ ඇවිදින් මාගේනේ නෙතු මානේ නිල් මානෙල් පාටයි දෑසේ තුරුලේමයි මා ඉන්නේ ඉගිලෙන්නේ ඔබ හා තනියෙන් මා දුක්  වින්දේ සුසුමක් ගානේ මා හැඬුවේ ඇල්ලක් වාගේ මුළු ලෝකේ එරෙහී වූ එදා දැනුනේ  රස නොයිදුල් දීගේ හීනෙන්  දුටු පාරාදීසේ පියවෙන්නේ පහසින් දෙනුවන් මා රත්තරන් මාගේ නාදල්ලේ  පාටයි වාගේ සිපගන්නත් ලෝබයි ඈගේ දෙතොලේමයි නැවතී ඉන්නේ මා මනමාලයි  හැඟුමන් දෑසේ ගුලිවෙන්නයි හොරැහින් බැලුවේ ඔබ මාගේ පනමයි සෑමදා රත්තරන් මාගේ"},
{"title": "මට හීනයක් වෙලා", "artist": "දමිත් අසංක", "author": "Unknown", "lyrics": "මට හීනයක් වෙලා ඔබේ ඔය ආදරේ සිත තාම දන්නෙ නෑ මා ඇයිද පෙම්කලේ සඳ රාජිනී නුඹයි මගේ හද මන්දිරේ සදා වෙනස් නොවේ මගේ ආදරේ රෑ දොලොස් පැයේ ඔබේ නෙතු මා ලඟයි ප්‍රියේ චංචලයි වගේ ඔබේ හිත කොහේද පාවුනේ අදහන්න බෑ කදුලක්ද ආදරේ නුඹ දන්නේ නෑ සුන්දරයි ජීවිතේ තාරුකාවියන් ගොතාලා මාගෙ අම්බරේ ඇයිද හැන්ගුනේ හෙලා මා අන්දකාරයේ අදහන්න බෑ කඳුලක්ද ආදරේ නුඹ දන්නෙ නෑ සුන්දරයි ජීවිතේ මට හීනයක් වෙලා"},
{"title": "මට දුන්නු දුක් ගින්න", "artist": "දමිත් අසංක", "author": "Unknown", "lyrics": "මට දුන්නු දුක් ගින්න ඇවිලෙයි ඉතින් රිදවන්නෙ විඳවන්නෙ මාගේ සිතින් කොයි කාට වූවාද දුක් මේ තරම් ඇවිලෙන්නෙ පෙම් පතක ලිය වු වදන් අළුවේවි පෙර දිනක පැතු ඒ පැතුම් කොයි කාට වූවාද මේ දුක් සුසුම් ඉවසන්න හැකිවේද දුක් මේ තරම් ළා රෝස මල් උයනෙ අපි පෙම් කළා මල් වලට බඹරුන්ට පෙම් ගී ලියා ඒ කාලෙ ආයේ යළි එන්නෙ නෑනේ මධුමල් පිපේවී ද නුඹෙ ලෝකයේ කවදාක හෝ නුඹට සිහිවෙයි මගේ පෙම් සිතක ඇති මහිම දැනෙනා දිනේ යළි එන්නෙපා දැන් සිත සෑදුවා මං නවතින්න ගිය තැනම නුඹෙ ලෝකයේ"},
{"title": "බාගෙට සැලුන් දොරින්", "artist": "දමිත් අසංක", "author": "Unknown", "lyrics": "බාගෙට සැලුන් දොරින් රිංගා නාගෙන ඕඩි කොලොන් බෘංගා එක්ටැම් ගෙවල්වලින් ඉරිදට පියාඹනා ටියුෂන් කුමාරියෝ සොයනා ටියුෂන් මාස්ටරුත් ඉන්නේ නොදුටු ලෙසින් පෙම්පත් පොතෙන් පොතට යන්නා ලයිසන් තියෙන නිසා ජවුසන් නටන තුරා සිකුරිටි අහක බලා ඉන්නා මලවිගෙ මල් දුන්නට නිවනක් ඇත්තෙම නෑ එක පිට එක පිට ඊ විඳිනා ශිල්පය පසෙක තියා-සිල්පද බිඳුණු නියා ටියුෂන් පුවත අසන් සොදිනා"},
{"title": "සයුරට නොතරම්", "artist": "දයාන් විතාරණ", "author": "Yamuna Malani Perera", "lyrics": "සයුරට නොතරම් ගඟ ගැලූ තරම් අහසට නොතරම් සඳ හැඬූ තරම් ප්‍රේමය නොතරම් පෙම් කෙරූ තරම් තටු රිදෙන තරම් බමනාම බඹරුන් ලබයි මලින් රොන් පැතූ තරම් සයුරට නොතරම් දිවි දෙවෙනි කරන් කෙරුවාට මම පෙම් ලැබුනු දුකින් හිත රිදෙන තරම්"},
{"title": "ආදරේ හිතෙනවා", "artist": "දමිත් අසංක", "author": "Unknown", "lyrics": "ආදරේ හිතෙනවා මුදු හැඟුම් රෑ පුරා ගේනවා ඈ රෑ නුරා හීතලේ මා පෑහිලා ජිවිතේ විඳිනවා සඳ හොරෙන් පායලා පාවුණා ඈ මා සොයා ඈ සිනා වෑහුනා ආයේ ආයේ සිහිනේ පායා වී ආදර හැඟුමන් සිතු සේ සසදාවී ඈතේ ඈතේ ආයේ සේයාවී ඈ මුව සුසුමන් කොපුලේ ගැවසේවී මීදුමේ බලනවා නෙතු අගින් මා දිහා තේරුනා කී කරනා යාවුනේ නෑ වේදනා පාරමී පුරනවා සිතු ලෙසින් පෑහිලා පාවෙලා ඈ රූ සොබා ඈ සදා ගෑවුනා ආයේ ආයේ හීනේ පායා වී ආදර හැඟුමන් සිතු සේ සසදාවී ඈතේ ඈතේ ආයේ සේයාවී ඈ මුව සුසුමන් කොපුලේ ගැවසේවී"},
{"title": "රෑ සඳ ඇවිත් ගියා", "artist": "දයාන් විතාරණ", "author": "Upul Shantha Sannasgala", "lyrics": "රෑ සඳ ඇවිත් ගියා ඉවුර මැදින් රහසේම හිඳින් ආදර බිඳුවක් ඇබින්දක් නුඹ අරන් ඇවිත් තිබුනා මල් මකරන්ද සුවඳ තිබුනා ඔබ දන්නෙ නෑ සිත පෙරුම් පිරුව කාලේ රෑ සිහිනේ ඔබ එන්න එපා දේවී ලං ලංව ඉන්න වේවී හිත රිදුනා හොඳටෝම ඇති රෑ සඳ ඇවිත් ගියා මම දන්නෙ නෑ පෙම කියාගන්න තාලේ රෑ සයනේ ඔබ ඉන්න එපා ප්‍රේමී ලං ලංව ඉන්න වේවී හිත රිදුනා හොඳටෝම ඇතී රෑ සඳ ඇවිත් ගියා"},
{"title": "මේ අමාවක රැයේ", "artist": "දයාන් විතාරණ", "author": "Unknown", "lyrics": "මේ අමාවක රැයේ පුර හඳක් ඒවී හිත පුරා පිපෙණා කිරණ ගලනා නුඹේ ආදරයෙන් සිත නිවී සැනහෙනවා පහන් තරු රැළ කුමකටද වෙන නිවි නිවී දිලෙනා අරුම දකිනට පුර හඳේ නිවන් දකිනා ජාති ජාතිත් නුඹේ හිත මට පිං තනා දෙනවා මේ අමාවක රැයේ සදා සුවඳින් සදා මා සිත සුභ සිහින සදනා අඳුර වෑහෙන තුන් යමේ දෑස් පියවා සිතෙන් ළංවී තුරුළු කර ගමි නොහිම් ආදරයෙන් මේ අමාවක රැයේ"},
{"title": "ජීවිතය ඔබෙන් දැන", "artist": "දයාන් විතාරණ", "author": "Wasantha Kumara Kobawaka", "lyrics": "ජීවිතය ඔබෙන් දැන ආදරයෙන් සිප ලඟම තබාගෙන මුතු කැටය ලෙස මේ කුලකින් රිංගන තරු එළියක් ලෙස මිහිර විඳින්නම් ලඳුනි සදාදර කාලයක අයාලේ පාවී ගිය සිත ලැගුම් සොයයි උණුසුමින් කැදැල්ලක ආදරය තරම් සුවයක් මට මෙහි නැත කියා ගයයි දුර ඉඳන් ලිහිණියක සාගරය තුරුල්ලේ යාවි ගං දිය විඩා නිවයි සිඳු රළින් හැඟුම්බර ස්නේහයට උපන් කවියක් කැට තලයක ලියා තබමි නුඹ නමින් සදාතන"},
{"title": "මුදු මුහුණේ", "artist": "දීපිකා ප්‍රියදර්ශනී සමග කරුණාරත්න දිවුල්ගනේ", "author": "Unknown", "lyrics": "මුදු මුහුණේ සුව දැණුනේ, පිය ළඳුනේ මට විතරද ඔබේ සුසුමේ සුව දැණුනේ, හිමි සඳුනේ මට විතරද පුළුලුකුලේ සුව යහනේ, නිදි වැරුවේ මං විතරද උර තලයේ හිස රන්දා, සුව වින්දේ මම විතරද මුදු මුහුණේ ඉඟ නෙරියේ රැළි බින්දේ, පිය ළඳුනේ මං විතරද ඉඟ නෙරියේ රැලි සැදුවේ, හිමි සඳුනේ මගේ විතරද මුදු මුහුණේ"},
{"title": "කොහේ හෝ", "artist": "දීපිකා ප්‍රියදර්ශනී", "author": "Unknown", "lyrics": "කොහේ හෝ දැන් හිදිනවා ඇති ඔබත් මගේ විජිතේ අහිමි වී මට මං ලැබූ දිනුමක් අත්ද ඔබ මා මැවූ සුන්දර සිහින මතකය මිසක් සිහින රැකගෙන දිවආවේ ආදරෙන් ඇවිද ගිය හැටි ඔබට මතකද ඉතින් අපට අප නැති හෙට දිනක දුක අරන් හඬා කුමටද නොදරුවන් සේ ඉතින් කොහේ හෝ සුසුම්ලන ලොව දැක තැවුල් පිරි හදින් සුසුම් ලන්නද අප ගැනම කොයි ලෙසින් සුභ අසුභපිරි සිහින විද තුන් සිතින් සදා හමුවෙමු මගතොටේ මදහසින් කොහේ හෝ"},
{"title": "කවිය ඔබ", "artist": "දීපිකා ප්‍රියදර්ශනී", "author": "Sunil R. Gamage", "lyrics": "කවිය ඔබ තුන් තිස් පැයක් නිඳි වරා වෙහෙසි සිත දෙගිඩියාවෙන් තවම නොලියු කවිය ඔබ පද එකින් එක ලියවා සිත කුරුටු ගා මැකුවා ඔබ ලියූ කවි කියවා මන් අසරණව උන්නා යෞවනේ තනිකමක් දැනෙනා මොහොතක සිත ඉකිගසා හැඩුවා කවිය ඔබ හොර ඇහින් ඉඟි කරලා සඳ මගෙන් සමු ගත්තා කවි පොතම පොඩිකරලා නිදියන්න මට සිතුනා යෞවනේ අත ළඟින් හිඳිනා මොහොතක දුර ඈත බව දැනුනා කවිය ඔබ"},
{"title": "අහසයි ඔබ මට", "artist": "දීපිකා ප්‍රියදර්ශනී", "author": "Unknown", "lyrics": "අහසයි ඔබ මට නිම් හිම් නොපෙනෙන හිනිමන් බදිනු බැරි පොළොවයි ඔබ මට තරුවක් විලසට රෑකල පතිත වෙමි ගඟේ වතුර නැ ඉහලට ගලා ගියේ අසනි හඩින් නැ කදුබිම් සසල වුනේ ගඟ කවදා හෝ මුවදොර හමුවෙනවා ලොව කැළඹුන දා කදුබිම් හැකිලෙනවා අහසයි ඔබ මට ‍අනාත සයුරක වැහිදිය දෝත ඔබයි අගාත අඳුරක දොල රන් සිළුව ඔබයි ඔබ මට ලඟ බව ඉදුරා මම දනිමි ඔබ වට කහවනු පවුරට මහ දුරකි අහසයි ඔබ මට"},
{"title": "අහස නුඹ මෙතරම්", "artist": "දීපිකා ප්‍රියදර්ශනී", "author": "Unknown", "lyrics": "අහස නුඹ මෙතරම් සැඩ යැයි දැනුනෙ මහ වැසි වැටුනාමයි පොළොව නුඹ මෙතරම් රළු යැයි හැඟුනෙ නියගය ආවාමයි රෑට තරු ඉසිනා අහසට අඳුරු සිත් ලැබුනේ කොහොමද නේක මල් සදනා පොළොවට නපුරු සිත් කොයිඹින් ලැබුනිද අහස නුඹ මෙතරම් නීල ඉදුවර පෑ අහසට කදුළු වැසි දුන්නේ කවුරුද පලා පෑ ඉසි ලූ මිහිමත නියන් ඇති රූ වුයේ කවුරුද අහස නූඹ මෙතරම්"},
{"title": "ඇගේය ඔබ දැන්", "artist": "දීපිකා ප්‍රියදර්ශනී", "author": "Rohana Weerasinghe", "lyrics": "ඇගේය ඔබ දැන් ඇගේය සිරුරින් ඇගේය මගේය එනමුත් මගේය හදවත මගේය අගේය ඔබ මට අගේය කඳුලැලි නැගේය මගේය ඔබ නම් මගේය සැමදා මගේය ඔබ මට ජල ධාරාවක් වගේය සීතල ජල ධාරාවක් වගේය ඒ ජල ධාරාවම දැන් ඇගේය එනමුත් ජලයේ සිසිලස මගේය ජලයේ සිසිලස මගේය ඇගේය ඔබ දැන් ඔබ මට මිණි වීණාවක් වගේය ඔබ නද මිණි වීණාවක් වගේය ඒ මිණි වීණාවම දැන් ඇගේය එනමුත් වීණා නාදය මගේය වීණා නාදය මගේය ඇගේය ඔබ දැන්"}
]